Tag Tool [1.0.6221.33154]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...34576 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...46873 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> 

tags.dat> echo  injecting wall models
injecting wall models 
tags.dat> 

tags.dat> modeltest 3450 objects/wall_xxl.obj
Info,  T14344: Load objects/wall_xxl.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 1992 out: 1059 | ~46.8%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> modeltest 344D objects/wall_xl.obj
Info,  T14344: Load objects/wall_xl.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 1992 out: 1038 | ~47.9%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> modeltest 344A objects/wall_l.obj
Info,  T14344: Load objects/wall_l.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 1992 out: 1039 | ~47.8%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> modeltest 3447 objects/wall_m.obj
Info,  T14344: Load objects/wall_m.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 1992 out: 1095 | ~45.0%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> modeltest 3444 objects/wall_s.obj
Info,  T14344: Load objects/wall_s.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 1992 out: 1124 | ~43.6%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> 

tags.dat> echo  injecting box models
injecting box models 
tags.dat> 

tags.dat> modeltest 3441 objects/box_xxl.obj
Info,  T14344: Load objects/box_xxl.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 1362 out: 344 | ~74.7%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> modeltest 343E objects/box_xl.obj
Info,  T14344: Load objects/box_xl.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 3000 out: 1155 | ~61.5%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> modeltest 343B objects/box_l.obj
Info,  T14344: Load objects/box_l.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 3000 out: 1170 | ~61.0%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> modeltest 3438 objects/box_m.obj
Info,  T14344: Load objects/box_m.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 3000 out: 1162 | ~61.3%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> modeltest 3434 objects/box_s.obj
Info,  T14344: Load objects/box_s.obj

Info,  T14344: Found a matching importer for this file format

Info,  T14344: Import root directory is 'objects\'

Info,  T14344: Entering post processing pipeline

Info,  T14344: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T14344: Kept 0 lights and 0 cameras

Info,  T14344: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T14344: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T14344: CalcTangentsProcess finished. Tangents have been calculated

Info,  T14344: JoinVerticesProcess finished | Verts in: 3000 out: 1163 | ~61.2%

Info,  T14344: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
ERROR: The process cannot access the file 'D:\Games\Halo Online\ElDewrito_0.5.1.1_Release\ElDewrito_0.5.1.1_Release\maps\resources.dat' because it is being used by another process.

tags.dat> 

tags.dat> echo  adding shaders to boxes
adding shaders to boxes 
tags.dat> 

tags.dat> edit 3441
Tag 0x00003441. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3441.> specifyshaders
Please enter the replacement 000046B4 index: 46B4
Done!

tags.dat\0x3441.> exit

tags.dat> 

tags.dat> edit 343E
Tag 0x0000343E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343E.> specifyshaders
Please enter the replacement 000046B4 index: 46B4
Done!

tags.dat\0x343E.> exit

tags.dat> 

tags.dat> edit 343B
Tag 0x0000343B. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343B.> specifyshaders
Please enter the replacement 000046B4 index: 46B4
Done!

tags.dat\0x343B.> exit

tags.dat> 

tags.dat> edit 3438
Tag 0x00003438. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3438.> specifyshaders
Please enter the replacement 000046B4 index: 46B4
Done!

tags.dat\0x3438.> exit

tags.dat> 

tags.dat> edit 3434
Tag 0x00003434. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3434.> specifyshaders
Please enter the replacement 000046B4 index: 46B4
Done!

tags.dat\0x3434.> exit

tags.dat> 

tags.dat> echo  adding shaders to walls
adding shaders to walls 
tags.dat> 

tags.dat> edit 3450
Tag 0x00003450. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3450.> specifyshaders
Please enter the replacement 000046B4 index: 46b4
Done!

tags.dat\0x3450.> exit

tags.dat> 

tags.dat> edit 344D
Tag 0x0000344D. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344D.> specifyshaders
Please enter the replacement 000046B4 index: 46b4
Done!

tags.dat\0x344D.> exit

tags.dat> 

tags.dat> edit 344A
Tag 0x0000344A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344A.> specifyshaders
Please enter the replacement 000046B4 index: 46b4
Done!

tags.dat\0x344A.> exit

tags.dat> 

tags.dat> edit 3447
Tag 0x00003447. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3447.> specifyshaders
Please enter the replacement 000046B4 index: 46b4
Done!

tags.dat\0x3447.> exit

tags.dat> 

tags.dat> edit 3444
Tag 0x00003444. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3444.> specifyshaders
Please enter the replacement 000046B4 index: 46b4
Done!

tags.dat\0x3444.> exit

tags.dat> 

tags.dat> echo  making objects visible from further away to prevent them from disapearing when close. 
making objects visible from further away to prevent them from disapearing when close. 
tags.dat> 

tags.dat> edit 2ee9
Tag 0x00002EE9. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EE9.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EE9.> savechanges
Done!

tags.dat\0x2EE9.> exit

tags.dat> 

tags.dat> edit 3433
Tag 0x00003433. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3433.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3433.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3433.> savechanges
Done!

tags.dat\0x3433.> exit

tags.dat> 

tags.dat> edit 2EEA
Tag 0x00002EEA. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEA.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEA.> savechanges
Done!

tags.dat\0x2EEA.> exit

tags.dat> 

tags.dat> edit 3437
Tag 0x00003437. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3437.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3437.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3437.> savechanges
Done!

tags.dat\0x3437.> exit

tags.dat> 

tags.dat> edit 2EEB
Tag 0x00002EEB. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEB.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEB.> savechanges
Done!

tags.dat\0x2EEB.> exit

tags.dat> 

tags.dat> edit 343A
Tag 0x0000343A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343A.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x343A.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x343A.> savechanges
Done!

tags.dat\0x343A.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 2EEC
Tag 0x00002EEC. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEC.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEC.> savechanges
Done!

tags.dat\0x2EEC.> exit

tags.dat> 

tags.dat> edit 343D
Tag 0x0000343D. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343D.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x343D.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x343D.> savechanges
Done!

tags.dat\0x343D.> exit

tags.dat> 

tags.dat> edit 2EED
Tag 0x00002EED. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EED.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EED.> savechanges
Done!

tags.dat\0x2EED.> exit

tags.dat> 

tags.dat> edit 3440
Tag 0x00003440. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3440.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3440.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3440.> savechanges
Done!

tags.dat\0x3440.> exit

tags.dat> 

tags.dat> echo  walls viewdistance
walls viewdistance 
tags.dat> 

tags.dat> edit 2EEE
Tag 0x00002EEE. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEE.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEE.> savechanges
Done!

tags.dat\0x2EEE.> exit

tags.dat> 

tags.dat> edit 3443
Tag 0x00003443. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3443.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3443.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3443.> savechanges
Done!

tags.dat\0x3443.> exit

tags.dat> 

tags.dat> edit 2EEF
Tag 0x00002EEF. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EEF.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EEF.> savechanges
Done!

tags.dat\0x2EEF.> exit

tags.dat> 

tags.dat> edit 3446
Tag 0x00003446. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3446.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3446.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3446.> savechanges
Done!

tags.dat\0x3446.> exit

tags.dat> 

tags.dat> edit 2EF0
Tag 0x00002EF0. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EF0.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EF0.> savechanges
Done!

tags.dat\0x2EF0.> exit

tags.dat> 

tags.dat> edit 3449
Tag 0x00003449. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3449.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x3449.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x3449.> savechanges
Done!

tags.dat\0x3449.> exit

tags.dat> 

tags.dat> edit 2EF1
Tag 0x00002EF1. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EF1.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EF1.> savechanges
Done!

tags.dat\0x2EF1.> exit

tags.dat> 

tags.dat> edit 344C
Tag 0x0000344C. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344C.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x344C.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x344C.> savechanges
Done!

tags.dat\0x344C.> exit

tags.dat> 

tags.dat> edit 2EF2
Tag 0x00002EF2. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EF2.> setfield BoundingRadius 1
BoundingRadius: Single = 1

tags.dat\0x2EF2.> savechanges
Done!

tags.dat\0x2EF2.> exit

tags.dat> 

tags.dat> edit 344F
Tag 0x0000344F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344F.> SetField ReduceToL1SuperLow 0
ReduceToL1SuperLow: Single = 0

tags.dat\0x344F.> SetField ReduceToL2Low 0
ReduceToL2Low: Single = 0

tags.dat\0x344F.> savechanges
Done!

tags.dat\0x344F.> exit

tags.dat> 

tags.dat> echo   create new string_id's:
create new string_id's: 
tags.dat> stringid add box_s
Added string "box_s" as 0x0000B719.

tags.dat> stringid add box_m
Added string "box_m" as 0x0000B71A.

tags.dat> stringid add box_l
Added string "box_l" as 0x0000B71B.

tags.dat> stringid add box_xl
Added string "box_xl" as 0x0000B71C.

tags.dat> stringid add box_xxl
Added string "box_xxl" as 0x0000B71D.

tags.dat> stringid add wall_s
Added string "wall_s" as 0x0000B71E.

tags.dat> stringid add wall_m
Added string "wall_m" as 0x0000B71F.

tags.dat> stringid add wall_l
Added string "wall_l" as 0x0000B720.

tags.dat> stringid add wall_xl
Added string "wall_xl" as 0x0000B721.

tags.dat> stringid add wall_xxl
Added string "wall_xxl" as 0x0000B722.

tags.dat> stringid add elephant
Added string "elephant" as 0x0000B723.

tags.dat> stringid add Gauss_Turret
Added string "Gauss_Turret" as 0x0000B724.

tags.dat> stringid add Chaingun_Turret
Added string "Chaingun_Turret" as 0x0000B725.

tags.dat> stringid add Wraith_Turret
Added string "Wraith_Turret" as 0x0000B726.

tags.dat> 

tags.dat> stringid add warthog_pallete
Added string "warthog_pallete" as 0x0000B727.

tags.dat> stringid add mongoose_pallete
Added string "mongoose_pallete" as 0x0000B728.

tags.dat> stringid add cornersandbag
Added string "cornersandbag" as 0x0000B729.

tags.dat> stringid add cornersandbag2
Added string "cornersandbag2" as 0x0000B72A.

tags.dat> stringid add sandbagblock
Added string "sandbagblock" as 0x0000B72B.

tags.dat> stringid add sandbags
Added string "sandbags" as 0x0000B72C.

tags.dat> stringid add twosandbags
Added string "twosandbags" as 0x0000B72D.

tags.dat> stringid add onesandbag
Added string "onesandbag" as 0x0000B72E.

tags.dat> stringid add opendroppod
Added string "opendroppod" as 0x0000B72F.

tags.dat> 

tags.dat> stringid add lastR_Bridge
Added string "lastR_Bridge" as 0x0000B730.

tags.dat> stringid add lastR_Barricade
Added string "lastR_Barricade" as 0x0000B731.

tags.dat> stringid add lastR_Light
Added string "lastR_Light" as 0x0000B732.

tags.dat> stringid add lastR_Window
Added string "lastR_Window" as 0x0000B733.

tags.dat> stringid add lastR_Mascot
Added string "lastR_Mascot" as 0x0000B734.

tags.dat> stringid add lastR_walllight
Added string "lastR_walllight" as 0x0000B735.

tags.dat> stringid add lastR_walllight
Added string "lastR_walllight" as 0x0000B736.

tags.dat> stringid add lastR_barriers
Added string "lastR_barriers" as 0x0000B737.

tags.dat> 

tags.dat> stringid add pit_controlpanel
Added string "pit_controlpanel" as 0x0000B738.

tags.dat> stringid add pit_metal
Added string "pit_metal" as 0x0000B739.

tags.dat> stringid add pit_keyboard
Added string "pit_keyboard" as 0x0000B73A.

tags.dat> stringid add pit_pcmonitor
Added string "pit_pcmonitor" as 0x0000B73B.

tags.dat> stringid add pit_filecabinet
Added string "pit_filecabinet" as 0x0000B73C.

tags.dat> stringid add pit_sfilecabinet
Added string "pit_sfilecabinet" as 0x0000B73D.

tags.dat> stringid add pit_chair
Added string "pit_chair" as 0x0000B73E.

tags.dat> stringid add pit_gravlift
Added string "pit_gravlift" as 0x0000B73F.

tags.dat> stringid add pit_bird
Added string "pit_bird" as 0x0000B740.

tags.dat> stringid add pit_bird2
Added string "pit_bird2" as 0x0000B741.

tags.dat> stringid add pit_bird3
Added string "pit_bird3" as 0x0000B742.

tags.dat> stringid add pit_camera
Added string "pit_camera" as 0x0000B743.

tags.dat> stringid add pit_table
Added string "pit_table" as 0x0000B744.

tags.dat> stringid add pit_largescreen
Added string "pit_largescreen" as 0x0000B745.

tags.dat> stringid add pit_smallscreen
Added string "pit_smallscreen" as 0x0000B746.

tags.dat> stringid add pit_whitescreen
Added string "pit_whitescreen" as 0x0000B747.

tags.dat> stringid add pit_coveredcrate1
Added string "pit_coveredcrate1" as 0x0000B748.

tags.dat> stringid add pit_coveredcrate2
Added string "pit_coveredcrate2" as 0x0000B749.

tags.dat> stringid add pit_coveredmetal
Added string "pit_coveredmetal" as 0x0000B74A.

tags.dat> stringid add pit_coveredcrate3
Added string "pit_coveredcrate3" as 0x0000B74B.

tags.dat> stringid add pit_cameramoving
Added string "pit_cameramoving" as 0x0000B74C.

tags.dat> stringid add pit_missiles
Added string "pit_missiles" as 0x0000B74D.

tags.dat> stringid add pit_loudspeaker
Added string "pit_loudspeaker" as 0x0000B74E.

tags.dat> stringid add pit_pelican
Added string "pit_pelican" as 0x0000B74F.

tags.dat> stringid add pit_mirrorsink
Added string "pit_mirrorsink" as 0x0000B750.

tags.dat> 

tags.dat> stringid add narrows_iceicle
Added string "narrows_iceicle" as 0x0000B751.

tags.dat> stringid add narrows_miceicle
Added string "narrows_miceicle" as 0x0000B752.

tags.dat> stringid add narrows_gravlift
Added string "narrows_gravlift" as 0x0000B753.

tags.dat> stringid add narrows_sentinel
Added string "narrows_sentinel" as 0x0000B754.

tags.dat> stringid add narrows_sentinel2
Added string "narrows_sentinel2" as 0x0000B755.

tags.dat> stringid add narrows_core
Added string "narrows_core" as 0x0000B756.

tags.dat> stringid add narrows_iceicle2
Added string "narrows_iceicle2" as 0x0000B757.

tags.dat> stringid add narrows_iceicle3
Added string "narrows_iceicle3" as 0x0000B758.

tags.dat> stringid add narrows_iceicle4
Added string "narrows_iceicle4" as 0x0000B759.

tags.dat> 

tags.dat> 

tags.dat> stringid add Highground_bunkerlid
Added string "Highground_bunkerlid" as 0x0000B75A.

tags.dat> stringid add Highground_chaingate
Added string "Highground_chaingate" as 0x0000B75B.

tags.dat> stringid add Highground_Cardboardbox
Added string "Highground_Cardboardbox" as 0x0000B75C.

tags.dat> stringid add Highground_CardboardboxOpen
Added string "Highground_CardboardboxOpen" as 0x0000B75D.

tags.dat> stringid add Highground_Cboardboxrec
Added string "Highground_Cboardboxrec" as 0x0000B75E.

tags.dat> stringid add Highground_Cboardbox2
Added string "Highground_Cboardbox2" as 0x0000B75F.

tags.dat> stringid add Highground_squaretable
Added string "Highground_squaretable" as 0x0000B760.

tags.dat> stringid add Highground_chaingate2
Added string "Highground_chaingate2" as 0x0000B761.

tags.dat> stringid add Highground_ProwlerTurret
Added string "Highground_ProwlerTurret" as 0x0000B762.

tags.dat> stringid add Highground_Shelves
Added string "Highground_Shelves" as 0x0000B763.

tags.dat> stringid add Highground_Gate
Added string "Highground_Gate" as 0x0000B764.

tags.dat> stringid add Highground_unknown
Added string "Highground_unknown" as 0x0000B765.

tags.dat> 

tags.dat> 

tags.dat> 

tags.dat> stringid add Sandtrap_UsncMetal
Added string "Sandtrap_UsncMetal" as 0x0000B766.

tags.dat> stringid add Sandtrap_GravityLift
Added string "Sandtrap_GravityLift" as 0x0000B767.

tags.dat> stringid add Sandtrap_Barrel
Added string "Sandtrap_Barrel" as 0x0000B768.

tags.dat> stringid add Sandtrap_crowbar
Added string "Sandtrap_crowbar" as 0x0000B769.

tags.dat> stringid add Sandtrap_Metal_plate
Added string "Sandtrap_Metal_plate" as 0x0000B76A.

tags.dat> stringid add Sandtrap_Davinci_egg
Added string "Sandtrap_Davinci_egg" as 0x0000B76B.

tags.dat> stringid add Sandtrap_lightstick
Added string "Sandtrap_lightstick" as 0x0000B76C.

tags.dat> stringid add sandtrap_phantom_part1
Added string "sandtrap_phantom_part1" as 0x0000B76D.

tags.dat> stringid add sandtrap_phantom_part2
Added string "sandtrap_phantom_part2" as 0x0000B76E.

tags.dat> stringid add sandtrap_phantom_part3
Added string "sandtrap_phantom_part3" as 0x0000B76F.

tags.dat> stringid add sandtrap_phantom_part4
Added string "sandtrap_phantom_part4" as 0x0000B770.

tags.dat> stringid add sandtrap_phantom_part5
Added string "sandtrap_phantom_part5" as 0x0000B771.

tags.dat> stringid add sandtrap_phantom_part6
Added string "sandtrap_phantom_part6" as 0x0000B772.

tags.dat> stringid add sandtrap_phantom_part7
Added string "sandtrap_phantom_part7" as 0x0000B773.

tags.dat> stringid add sandtrap_phantom_part8
Added string "sandtrap_phantom_part8" as 0x0000B774.

tags.dat> stringid add sandtrap_phantom_part9
Added string "sandtrap_phantom_part9" as 0x0000B775.

tags.dat> stringid add sandtrap_phantom_part10
Added string "sandtrap_phantom_part10" as 0x0000B776.

tags.dat> stringid add sandtrap_phantom_part11
Added string "sandtrap_phantom_part11" as 0x0000B777.

tags.dat> 

tags.dat> 

tags.dat> stringid add Guardian_GoldLift
Added string "Guardian_GoldLift" as 0x0000B778.

tags.dat> stringid add Guardian_MancannonLift
Added string "Guardian_MancannonLift" as 0x0000B779.

tags.dat> stringid add Guardian_Mancannonlift2
Added string "Guardian_Mancannonlift2" as 0x0000B77A.

tags.dat> stringid add Guardian_Mancannonlift3
Added string "Guardian_Mancannonlift3" as 0x0000B77B.

tags.dat> stringid add Guardian_Minilift
Added string "Guardian_Minilift" as 0x0000B77C.

tags.dat> stringid add Guardian_Quadwing
Added string "Guardian_Quadwing" as 0x0000B77D.

tags.dat> stringid add Guardian_vine1
Added string "Guardian_vine1" as 0x0000B77E.

tags.dat> stringid add Guardian_vine2
Added string "Guardian_vine2" as 0x0000B77F.

tags.dat> stringid add Guardian_vine3
Added string "Guardian_vine3" as 0x0000B780.

tags.dat> stringid add Guardian_blueholo
Added string "Guardian_blueholo" as 0x0000B781.

tags.dat> stringid add Guardian_purpleholo
Added string "Guardian_purpleholo" as 0x0000B782.

tags.dat> 

tags.dat> 

tags.dat> stringid add Diamondback_Gravitylift1
Added string "Diamondback_Gravitylift1" as 0x0000B783.

tags.dat> stringid add Diamondback_Gravitylift2
Added string "Diamondback_Gravitylift2" as 0x0000B784.

tags.dat> stringid add Diamondback_Gravitylift3
Added string "Diamondback_Gravitylift3" as 0x0000B785.

tags.dat> stringid add Diamondback_Gravitylift4
Added string "Diamondback_Gravitylift4" as 0x0000B786.

tags.dat> stringid add Diamondback_Gravitylift5
Added string "Diamondback_Gravitylift5" as 0x0000B787.

tags.dat> stringid add Diamondback_Gravitylift6
Added string "Diamondback_Gravitylift6" as 0x0000B788.

tags.dat> stringid add Diamondback_Crack
Added string "Diamondback_Crack" as 0x0000B789.

tags.dat> 

tags.dat> stringid add turf_Antenna
Added string "turf_Antenna" as 0x0000B78A.

tags.dat> stringid add turf_metalbox
Added string "turf_metalbox" as 0x0000B78B.

tags.dat> stringid add turf_hornet
Added string "turf_hornet" as 0x0000B78C.

tags.dat> 

tags.dat> stringid add reactor_redlight
Added string "reactor_redlight" as 0x0000B78D.

tags.dat> stringid add reactor_bluelight
Added string "reactor_bluelight" as 0x0000B78E.

tags.dat> stringid add reactor_yellowlight
Added string "reactor_yellowlight" as 0x0000B78F.

tags.dat>  

tags.dat> stringid add standoff_lights
Added string "standoff_lights" as 0x0000B790.

tags.dat> stringid add standoff_locker
Added string "standoff_locker" as 0x0000B791.

tags.dat> stringid add standoff_metalfence
Added string "standoff_metalfence" as 0x0000B792.

tags.dat> stringid add standoff_metalsheet
Added string "standoff_metalsheet" as 0x0000B793.

tags.dat> stringid add standoff_undergrounddoor
Added string "standoff_undergrounddoor" as 0x0000B794.

tags.dat> stringid add standoff_windowflaps
Added string "standoff_windowflaps" as 0x0000B795.

tags.dat> stringid add standoff_switch
Added string "standoff_switch" as 0x0000B796.

tags.dat> stringid add standoff_light2
Added string "standoff_light2" as 0x0000B797.

tags.dat> stringid add standoff_windowflaps2
Added string "standoff_windowflaps2" as 0x0000B798.

tags.dat> 

tags.dat> stringid add valhalla_mancannonfx
Added string "valhalla_mancannonfx" as 0x0000B799.

tags.dat> stringid add valhalla_mancannonfx2
Added string "valhalla_mancannonfx2" as 0x0000B79A.

tags.dat> stringid add valhalla_waterfalltop
Added string "valhalla_waterfalltop" as 0x0000B79B.

tags.dat> stringid add valhalla_waterfallmiddle
Added string "valhalla_waterfallmiddle" as 0x0000B79C.

tags.dat> stringid add valhalla_waterfallbottom
Added string "valhalla_waterfallbottom" as 0x0000B79D.

tags.dat> 

tags.dat> echo   add these new string_id's to tag 1221.multilingual_unicode_string_list. So they appear in the forge list.
add these new string_id's to tag 1221.multilingual_unicode_string_list. So they appear in the forge list. 
tags.dat> edit 1221
Tag 0x00001221. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1221.> set english box_s "Box Small"
String changed successfully.

tags.dat\0x1221.> set english box_m "Box Med"
String changed successfully.

tags.dat\0x1221.> set english box_l "Box Large"
String changed successfully.

tags.dat\0x1221.> set english box_xl "Box xLarge"
String changed successfully.

tags.dat\0x1221.> set english box_xxl "Box xxLarge"
String changed successfully.

tags.dat\0x1221.> set english wall_s "Wall Small"
String changed successfully.

tags.dat\0x1221.> set english wall_m "Wall Med"
String changed successfully.

tags.dat\0x1221.> set english wall_l "Wall Large"
String changed successfully.

tags.dat\0x1221.> set english wall_xl "Wall xLarge"
String changed successfully.

tags.dat\0x1221.> set english wall_xxl "Wall xxLarge"
String changed successfully.

tags.dat\0x1221.> set english elephant "Elephant"
String changed successfully.

tags.dat\0x1221.> set english Gauss_Turret "Gauss turret"
String changed successfully.

tags.dat\0x1221.> set english Chaingun_Turret "Warthog turret"
String changed successfully.

tags.dat\0x1221.> set english Wraith_Turret "Wraith Turret"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english warthog_pallete "Warthog palette"
String changed successfully.

tags.dat\0x1221.> set english mongoose_pallete "Mongoose palette"
String changed successfully.

tags.dat\0x1221.> set english cornersandbag "Corner Sandbag"
String changed successfully.

tags.dat\0x1221.> set english cornersandbag2 "Corner Sandbag 2"
String changed successfully.

tags.dat\0x1221.> set english sandbagblock "Sandbag end"
String changed successfully.

tags.dat\0x1221.> set english sandbags "Sandbag wall"
String changed successfully.

tags.dat\0x1221.> set english twosandbags "two sandbags *"
String changed successfully.

tags.dat\0x1221.> set english onesandbag "One sandbag *"
String changed successfully.

tags.dat\0x1221.> set english opendroppod "Open Drop Pod"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> 

tags.dat\0x1221.> set english lastR_Bridge "Bridge *"
String changed successfully.

tags.dat\0x1221.> set english lastR_Barricade "Metal Barricade"
String changed successfully.

tags.dat\0x1221.> set english lastR_Light "Light"
String changed successfully.

tags.dat\0x1221.> set english lastR_Window "Window"
String changed successfully.

tags.dat\0x1221.> set english lastR_Mascot "Mascot"
String changed successfully.

tags.dat\0x1221.> set english lastR_walllight "Wall light"
String changed successfully.

tags.dat\0x1221.> set english lastR_barriers "Barriers *"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> 

tags.dat\0x1221.> set english pit_controlpanel "Control Panel"
String changed successfully.

tags.dat\0x1221.> set english pit_metal "Metal"
String changed successfully.

tags.dat\0x1221.> set english pit_keyboard "Keyboard"
String changed successfully.

tags.dat\0x1221.> set english pit_pcmonitor "Monitor"
String changed successfully.

tags.dat\0x1221.> set english pit_filecabinet "File Cabinet"
String changed successfully.

tags.dat\0x1221.> set english pit_sfilecabinet "File Cabinet s"
String changed successfully.

tags.dat\0x1221.> set english pit_chair "Chair"
String changed successfully.

tags.dat\0x1221.> set english pit_gravlift "Gravity Lift *"
String changed successfully.

tags.dat\0x1221.> set english pit_bird "Bird"
String changed successfully.

tags.dat\0x1221.> set english pit_bird2 "Bird 2"
String changed successfully.

tags.dat\0x1221.> set english pit_bird3 "Bird 3"
String changed successfully.

tags.dat\0x1221.> set english pit_camera "camera"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> 

tags.dat\0x1221.> set english pit_table "Table"
String changed successfully.

tags.dat\0x1221.> set english pit_largescreen "Large Screen"
String changed successfully.

tags.dat\0x1221.> set english pit_smallscreen "Small Screen"
String changed successfully.

tags.dat\0x1221.> set english pit_whitescreen "White Screen"
String changed successfully.

tags.dat\0x1221.> set english pit_coveredcrate1 "Covered turret case"
String changed successfully.

tags.dat\0x1221.> set english pit_coveredcrate2 "Covered Crate"
String changed successfully.

tags.dat\0x1221.> set english pit_coveredmetal "Metal Crate"
String changed successfully.

tags.dat\0x1221.> set english pit_coveredcrate3 "Covered Crate 2"
String changed successfully.

tags.dat\0x1221.> set english pit_cameramoving "Moving Camera"
String changed successfully.

tags.dat\0x1221.> set english pit_missiles "Missles *"
String changed successfully.

tags.dat\0x1221.> set english pit_loudspeaker "Loudspeaker"
String changed successfully.

tags.dat\0x1221.> set english pit_pelican "Pelican *"
String changed successfully.

tags.dat\0x1221.> set english pit_mirrorsink "Sink and Mirror"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> 

tags.dat\0x1221.> set english narrows_iceicle "Iceicle"
String changed successfully.

tags.dat\0x1221.> set english narrows_miceicle "Iceicle 2"
String changed successfully.

tags.dat\0x1221.> set english narrows_gravlift "Gravity lift *"
String changed successfully.

tags.dat\0x1221.> set english narrows_sentinel "sentinel"
String changed successfully.

tags.dat\0x1221.> set english narrows_sentinel2 "sentinel 2"
String changed successfully.

tags.dat\0x1221.> set english narrows_core "power core"
String changed successfully.

tags.dat\0x1221.> set english narrows_iceicle2 "Iceicle 3"
String changed successfully.

tags.dat\0x1221.> set english narrows_iceicle3 "iceicle 4"
String changed successfully.

tags.dat\0x1221.> set english narrows_iceicle4 "iceicle 5"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english Highground_bunkerlid "Bunker Lid"
String changed successfully.

tags.dat\0x1221.> set english Highground_chaingate "Chain gate"
String changed successfully.

tags.dat\0x1221.> set english Highground_Cardboardbox "Cardboard box"
String changed successfully.

tags.dat\0x1221.> set english Highground_CardboardboxOpen "Cardboard Box Open"
String changed successfully.

tags.dat\0x1221.> set english Highground_Cboardboxrec "Cardboard box 2"
String changed successfully.

tags.dat\0x1221.> set english Highground_Cboardbox2 "Cardboard Box 3"
String changed successfully.

tags.dat\0x1221.> set english Highground_squaretable "Square table"
String changed successfully.

tags.dat\0x1221.> set english Highground_chaingate2 "Chain gate 2"
String changed successfully.

tags.dat\0x1221.> set english Highground_ProwlerTurret "Prowler Turret"
String changed successfully.

tags.dat\0x1221.> set english Highground_Shelves "Shelves"
String changed successfully.

tags.dat\0x1221.> set english Highground_Gate "gate *"
String changed successfully.

tags.dat\0x1221.> set english Highground_unknown "unknown"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english Sandtrap_UsncMetal "Usnc Lid"
String changed successfully.

tags.dat\0x1221.> set english Sandtrap_GravityLift "Gravity lift *"
String changed successfully.

tags.dat\0x1221.> set english Sandtrap_Barrel "Fancy Barrel"
String changed successfully.

tags.dat\0x1221.> set english Sandtrap_crowbar "Crowbar"
String changed successfully.

tags.dat\0x1221.> set english Sandtrap_Metal_plate "Metal plate"
String changed successfully.

tags.dat\0x1221.> set english Sandtrap_Davinci_egg "Da vinci egg"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english Sandtrap_lightstick "Lightstick"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part1 "Phantom Part 1"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part2 "Phantom Part 2"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part3 "Phantom Part 3"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part4 "Phantom Part 4"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part5 "Phantom Part 5"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part6 "Phantom Part 6"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part7 "Phantom Part 7"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part8 "Phantom Part 8"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part9 "Phantom Part 9"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part10 "Phantom Part 10"
String changed successfully.

tags.dat\0x1221.> set english sandtrap_phantom_part11 "Phantom Part 11"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english Guardian_GoldLift "Gold Lift"
String changed successfully.

tags.dat\0x1221.> set english Guardian_MancannonLift "Mancannon 1 *"
String changed successfully.

tags.dat\0x1221.> set english Guardian_Mancannonlift2 "ManCannon 2 *"
String changed successfully.

tags.dat\0x1221.> set english Guardian_Mancannonlift3 "ManCannon 3"
String changed successfully.

tags.dat\0x1221.> set english Guardian_Minilift "Minilift"
String changed successfully.

tags.dat\0x1221.> set english Guardian_Quadwing "Quadwing"
String changed successfully.

tags.dat\0x1221.> set english Guardian_vine1 "vine"
String changed successfully.

tags.dat\0x1221.> set english Guardian_vine2 "Vine 2"
String changed successfully.

tags.dat\0x1221.> set english Guardian_vine3 "vine 3"
String changed successfully.

tags.dat\0x1221.> set english Guardian_blueholo "Blue hologram"
String changed successfully.

tags.dat\0x1221.> set english Guardian_purpleholo "Purple hologram"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english Diamondback_Gravitylift1 "Gravitylift 1 *"
String changed successfully.

tags.dat\0x1221.> set english Diamondback_Gravitylift2 "Gravitylift 2 *"
String changed successfully.

tags.dat\0x1221.> set english Diamondback_Gravitylift3 "Gravitylift 3 *"
String changed successfully.

tags.dat\0x1221.> set english Diamondback_Gravitylift4 "Gravitylift 4 *"
String changed successfully.

tags.dat\0x1221.> set english Diamondback_Gravitylift5 "Gravitylift 5 *"
String changed successfully.

tags.dat\0x1221.> set english Diamondback_Gravitylift6 "Gravitylift 6 *"
String changed successfully.

tags.dat\0x1221.> set english Diamondback_Crack "Diamondback crack"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english turf_Antenna "Antenna"
String changed successfully.

tags.dat\0x1221.> set english turf_metalbox "Metal box"
String changed successfully.

tags.dat\0x1221.> set english turf_hornet "Hornet"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english reactor_redlight "Red light"
String changed successfully.

tags.dat\0x1221.> set english reactor_bluelight "Blue light"
String changed successfully.

tags.dat\0x1221.> set english reactor_yellowlight "Yellow Light"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english standoff_lights "Light"
String changed successfully.

tags.dat\0x1221.> set english standoff_locker "Locker"
String changed successfully.

tags.dat\0x1221.> set english standoff_metalfence "Metal fence"
String changed successfully.

tags.dat\0x1221.> set english standoff_metalsheet "Metal sheet"
String changed successfully.

tags.dat\0x1221.> set english standoff_undergrounddoor "Underground door *"
String changed successfully.

tags.dat\0x1221.> set english standoff_windowflaps "Window panels *"
String changed successfully.

tags.dat\0x1221.> set english standoff_switch "Switch *"
String changed successfully.

tags.dat\0x1221.> set english standoff_light2 "Light 2 *"
String changed successfully.

tags.dat\0x1221.> set english standoff_windowflaps2 "Window Panels 2 *"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> set english valhalla_mancannonfx "Mancannon fx *"
String changed successfully.

tags.dat\0x1221.> set english valhalla_mancannonfx2 "Mancannon fx 2 *"
String changed successfully.

tags.dat\0x1221.> set english valhalla_waterfalltop "Waterfall top"
String changed successfully.

tags.dat\0x1221.> set english valhalla_waterfallmiddle "Waterfall Middle"
String changed successfully.

tags.dat\0x1221.> set english valhalla_waterfallbottom "Waterfall Bottom"
String changed successfully.

tags.dat\0x1221.> 

tags.dat\0x1221.> 

tags.dat\0x1221.> 

tags.dat\0x1221.> exitTo tags.dat

tags.dat> 

tags.dat> echo   edit the scnr of valhalla
edit the scnr of valhalla 
tags.dat> edit 3488
Tag 0x00003488. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3488.> echo   This command "removefrom sandboxScenery 48 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 48 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x3488.> removefrom sandboxScenery 48 *
Successfully removed 13 elements from SandboxScenery at index 48: List`1<SandboxObject>
{...}[48]

tags.dat\0x3488.> 

tags.dat\0x3488.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x3488.> addto sandboxScenery 13
Successfully added 13 elements to SandboxScenery: List`1<SandboxObject>
{...}[61]

tags.dat\0x3488.> setfield SandboxScenery[48].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x3488.> setfield SandboxScenery[49].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x3488.> setfield SandboxScenery[50].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x3488.> setfield SandboxScenery[51].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x3488.> setfield SandboxScenery[52].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x3488.> setfield SandboxScenery[53].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x3488.> setfield SandboxScenery[54].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x3488.> setfield SandboxScenery[55].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x3488.> setfield SandboxScenery[56].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x3488.> setfield SandboxScenery[57].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x3488.> setfield SandboxScenery[58].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x3488.> setfield SandboxScenery[59].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x3488.> setfield SandboxScenery[60].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x3488.> 

tags.dat\0x3488.> removefrom sandboxGoalObjects 9 *
Successfully removed 7 elements from SandboxGoalObjects at index 9: List`1<SandboxObject>
{...}[9]

tags.dat\0x3488.> addto sandboxGoalObjects 7
Successfully added 7 elements to SandboxGoalObjects: List`1<SandboxObject>
{...}[16]

tags.dat\0x3488.> setfield SandboxGoalObjects[9].object 348E
Object: TagInstance = 0x0000348E

tags.dat\0x3488.> setfield SandboxGoalObjects[10].object 3490
Object: TagInstance = 0x00003490

tags.dat\0x3488.> setfield SandboxGoalObjects[11].object 3493
Object: TagInstance = 0x00003493

tags.dat\0x3488.> setfield SandboxGoalObjects[12].object 3494
Object: TagInstance = 0x00003494

tags.dat\0x3488.> setfield SandboxGoalObjects[13].object 3497
Object: TagInstance = 0x00003497

tags.dat\0x3488.> setfield SandboxGoalObjects[14].object 3496
Object: TagInstance = 0x00003496

tags.dat\0x3488.> setfield SandboxGoalObjects[15].object 3495
Object: TagInstance = 0x00003495

tags.dat\0x3488.> 

tags.dat\0x3488.> setfield SandboxGoalObjects[9].name opendroppod 
Name: StringID = opendroppod

tags.dat\0x3488.> setfield SandboxGoalObjects[10].name valhalla_mancannonfx
Name: StringID = valhalla_mancannonfx

tags.dat\0x3488.> setfield SandboxGoalObjects[11].name warthog_pallete 
Name: StringID = warthog_pallete

tags.dat\0x3488.> setfield SandboxGoalObjects[12].name valhalla_mancannonfx2
Name: StringID = valhalla_mancannonfx2

tags.dat\0x3488.> setfield SandboxGoalObjects[13].name valhalla_waterfalltop
Name: StringID = valhalla_waterfalltop

tags.dat\0x3488.> setfield SandboxGoalObjects[14].name valhalla_waterfallmiddle
Name: StringID = valhalla_waterfallmiddle

tags.dat\0x3488.> setfield SandboxGoalObjects[15].name valhalla_waterfallbottom
Name: StringID = valhalla_waterfallbottom

tags.dat\0x3488.> 

tags.dat\0x3488.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x3488.> setfield sandboxScenery[48].name box_s
Name: StringID = box_s

tags.dat\0x3488.> setfield sandboxScenery[49].name box_m
Name: StringID = box_m

tags.dat\0x3488.> setfield sandboxScenery[50].name box_l
Name: StringID = box_l

tags.dat\0x3488.> setfield sandboxScenery[51].name box_xl
Name: StringID = box_xl

tags.dat\0x3488.> setfield sandboxScenery[52].name box_xxl
Name: StringID = box_xxl

tags.dat\0x3488.> setfield sandboxScenery[53].name wall_s
Name: StringID = wall_s

tags.dat\0x3488.> setfield sandboxScenery[54].name wall_m
Name: StringID = wall_m

tags.dat\0x3488.> setfield sandboxScenery[55].name wall_l
Name: StringID = wall_l

tags.dat\0x3488.> setfield sandboxScenery[56].name wall_xl
Name: StringID = wall_xl

tags.dat\0x3488.> setfield sandboxScenery[57].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x3488.> setfield SandboxScenery[58].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x3488.> setfield SandboxScenery[59].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x3488.> setfield SandboxScenery[60].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x3488.> 

tags.dat\0x3488.> savechanges
Done!

tags.dat\0x3488.> exit

tags.dat> 

tags.dat> echo  changing the box objects so they are phased.
changing the box objects so they are phased. 
tags.dat> edit 3435
Tag 0x00003435. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3435.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3435.> savechanges
Done!

tags.dat\0x3435.> exit

tags.dat> 

tags.dat> edit 3439
Tag 0x00003439. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3439.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3439.> savechanges
Done!

tags.dat\0x3439.> exit

tags.dat> 

tags.dat> edit 343C
Tag 0x0000343C. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343C.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x343C.> savechanges
Done!

tags.dat\0x343C.> exit

tags.dat> 

tags.dat> edit 343F
Tag 0x0000343F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x343F.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x343F.> savechanges
Done!

tags.dat\0x343F.> exit

tags.dat> 

tags.dat> edit 3442
Tag 0x00003442. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3442.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3442.> savechanges
Done!

tags.dat\0x3442.> exit

tags.dat> 

tags.dat> echo  Changing the Wall objects so they are phased
Changing the Wall objects so they are phased 
tags.dat> edit 3445
Tag 0x00003445. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3445.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3445.> savechanges
Done!

tags.dat\0x3445.> exit

tags.dat> 

tags.dat> edit 3448
Tag 0x00003448. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3448.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3448.> savechanges
Done!

tags.dat\0x3448.> exit

tags.dat> 

tags.dat> edit 344B
Tag 0x0000344B. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344B.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x344B.> savechanges
Done!

tags.dat\0x344B.> exit

tags.dat> 

tags.dat> edit 344E
Tag 0x0000344E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x344E.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x344E.> savechanges
Done!

tags.dat\0x344E.> exit

tags.dat> 

tags.dat> edit 3451
Tag 0x00003451. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3451.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3451.> savechanges
Done!

tags.dat\0x3451.> exit

tags.dat> 

tags.dat> echo phasing vehicle turrets
phasing vehicle turrets 
tags.dat> 

tags.dat> edit 2A23
Tag 0x00002A23. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2A23.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x2A23.> savechanges
Done!

tags.dat\0x2A23.> exit

tags.dat> 

tags.dat> edit 2A07
Tag 0x00002A07. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2A07.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x2A07.> savechanges
Done!

tags.dat\0x2A07.> exit

tags.dat> 

tags.dat> edit 379D
Tag 0x0000379D. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x379D.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x379D.> savechanges
Done!

tags.dat\0x379D.> exit

tags.dat> 

tags.dat> edit 53A7
Tag 0x000053A7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x53A7.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x53A7.> savechanges
Done!

tags.dat\0x53A7.> exit

tags.dat> 

tags.dat> echo phasing shared droppods, sandbags, warthog palettes etc
phasing shared droppods, sandbags, warthog palettes etc 
tags.dat> 

tags.dat> edit 3628
Tag 0x00003628. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3628.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3628.> savechanges
Done!

tags.dat\0x3628.> exit

tags.dat> 

tags.dat> edit 3634
Tag 0x00003634. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3634.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3634.> savechanges
Done!

tags.dat\0x3634.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 50F2
Tag 0x000050F2. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50F2.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x50F2.> savechanges
Done!

tags.dat\0x50F2.> exit

tags.dat> 

tags.dat> edit 50F7
Tag 0x000050F7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50F7.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x50F7.> savechanges
Done!

tags.dat\0x50F7.> exit

tags.dat> 

tags.dat> edit 50FC
Tag 0x000050FC. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50FC.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x50FC.> savechanges
Done!

tags.dat\0x50FC.> exit

tags.dat> 

tags.dat> edit 5101
Tag 0x00005101. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5101.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x5101.> savechanges
Done!

tags.dat\0x5101.> exit

tags.dat> 

tags.dat> edit 35FC
Tag 0x000035FC. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x35FC.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x35FC.> savechanges
Done!

tags.dat\0x35FC.> exit

tags.dat> 

tags.dat> 

tags.dat> echo Phasing objects on Pit
Phasing objects on Pit 
tags.dat> 

tags.dat> edit 470D
Tag 0x0000470D. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x470D.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x470D.> savechanges
Done!

tags.dat\0x470D.> exit

tags.dat> 

tags.dat> edit 461C
Tag 0x0000461C. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x461C.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x461C.> savechanges
Done!

tags.dat\0x461C.> exit

tags.dat> 

tags.dat> echo phasing objects on narrows
phasing objects on narrows 
tags.dat> 

tags.dat> 

tags.dat> edit 4B7A
Tag 0x00004B7A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B7A.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4B7A.> savechanges
Done!

tags.dat\0x4B7A.> exit

tags.dat> 

tags.dat> echo phasing items on Last resort
phasing items on Last resort 
tags.dat> 

tags.dat> 

tags.dat> edit 5219
Tag 0x00005219. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5219.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x5219.> savechanges
Done!

tags.dat\0x5219.> exit

tags.dat> 

tags.dat> echo Phasing items on High ground
Phasing items on High ground 
tags.dat> 

tags.dat> edit 54A6
Tag 0x000054A6. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54A6.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x54A6.> savechanges
Done!

tags.dat\0x54A6.> exit

tags.dat> 

tags.dat> edit 54DB
Tag 0x000054DB. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54DB.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x54DB.> savechanges
Done!

tags.dat\0x54DB.> exit

tags.dat> 

tags.dat> 

tags.dat> echo Phasing items on Guardian
Phasing items on Guardian 
tags.dat> 

tags.dat> edit 3425
Tag 0x00003425. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3425.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3425.> savechanges
Done!

tags.dat\0x3425.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 342f
Tag 0x0000342F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x342F.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x342F.> savechanges
Done!

tags.dat\0x342F.> exit

tags.dat> 

tags.dat> edit 3432
Tag 0x00003432. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3432.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3432.> savechanges
Done!

tags.dat\0x3432.> exit

tags.dat> 

tags.dat> 

tags.dat> phasing Items on Diamondback
Unrecognized command: phasing
Use "help" to list available commands.

tags.dat> 

tags.dat> edit 3C84
Tag 0x00003C84. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3C84.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3C84.> savechanges
Done!

tags.dat\0x3C84.> exit

tags.dat> 

tags.dat> edit 3C6F
Tag 0x00003C6F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3C6F.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3C6F.> savechanges
Done!

tags.dat\0x3C6F.> exit

tags.dat> 

tags.dat> edit 3C61
Tag 0x00003C61. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3C61.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x3C61.> savechanges
Done!

tags.dat\0x3C61.> exit

tags.dat> 

tags.dat> 

tags.dat> echo   edit the scnr of The Pit
edit the scnr of The Pit 
tags.dat> edit 4455
Tag 0x00004455. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4455.> echo   This command "removefrom sandboxScenery 23 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 23 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x4455.> removefrom sandboxScenery 23 *
Successfully removed 39 elements from SandboxScenery at index 23: List`1<SandboxObject>
{...}[23]

tags.dat\0x4455.> 

tags.dat\0x4455.> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x4455.> 

tags.dat\0x4455.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x4455.> addto sandboxScenery 39
Successfully added 39 elements to SandboxScenery: List`1<SandboxObject>
{...}[62]

tags.dat\0x4455.> setfield SandboxScenery[23].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x4455.> setfield SandboxScenery[24].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x4455.> setfield SandboxScenery[25].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x4455.> setfield SandboxScenery[26].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x4455.> setfield SandboxScenery[27].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x4455.> setfield SandboxScenery[28].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x4455.> setfield SandboxScenery[29].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x4455.> setfield SandboxScenery[30].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x4455.> setfield SandboxScenery[31].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x4455.> setfield SandboxScenery[32].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x4455.> setfield SandboxScenery[33].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x4455.> setfield SandboxScenery[34].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x4455.> setfield SandboxScenery[35].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x4455.> setfield SandboxScenery[36].object 48EF
Object: TagInstance = 0x000048EF

tags.dat\0x4455.> setfield SandboxScenery[37].object 4904
Object: TagInstance = 0x00004904

tags.dat\0x4455.> setfield SandboxScenery[38].object 490E
Object: TagInstance = 0x0000490E

tags.dat\0x4455.> setfield SandboxScenery[39].object 4918
Object: TagInstance = 0x00004918

tags.dat\0x4455.> setfield SandboxScenery[40].object 4923
Object: TagInstance = 0x00004923

tags.dat\0x4455.> setfield SandboxScenery[41].object 492F
Object: TagInstance = 0x0000492F

tags.dat\0x4455.> setfield SandboxScenery[42].object 4934
Object: TagInstance = 0x00004934

tags.dat\0x4455.> setfield SandboxScenery[43].object 4950
Object: TagInstance = 0x00004950

tags.dat\0x4455.> setfield SandboxScenery[44].object 49B1
Object: TagInstance = 0x000049B1

tags.dat\0x4455.> setfield SandboxScenery[45].object 49C3
Object: TagInstance = 0x000049C3

tags.dat\0x4455.> setfield SandboxScenery[46].object 49DE
Object: TagInstance = 0x000049DE

tags.dat\0x4455.> setfield SandboxScenery[47].object 4703
Object: TagInstance = 0x00004703

tags.dat\0x4455.> setfield SandboxScenery[48].object 4608
Object: TagInstance = 0x00004608

tags.dat\0x4455.> setfield SandboxScenery[49].object 4686
Object: TagInstance = 0x00004686

tags.dat\0x4455.> setfield SandboxScenery[50].object 469F
Object: TagInstance = 0x0000469F

tags.dat\0x4455.> setfield SandboxScenery[51].object 46D0
Object: TagInstance = 0x000046D0

tags.dat\0x4455.> setfield SandboxScenery[52].object 461D
Object: TagInstance = 0x0000461D

tags.dat\0x4455.> setfield SandboxScenery[53].object 4628
Object: TagInstance = 0x00004628

tags.dat\0x4455.> setfield SandboxScenery[54].object 4632
Object: TagInstance = 0x00004632

tags.dat\0x4455.> setfield SandboxScenery[55].object 463D
Object: TagInstance = 0x0000463D

tags.dat\0x4455.> setfield SandboxScenery[56].object 4643
Object: TagInstance = 0x00004643

tags.dat\0x4455.> setfield SandboxScenery[57].object 4662
Object: TagInstance = 0x00004662

tags.dat\0x4455.> setfield SandboxScenery[58].object 46BE
Object: TagInstance = 0x000046BE

tags.dat\0x4455.> setfield SandboxScenery[59].object 46C7
Object: TagInstance = 0x000046C7

tags.dat\0x4455.> setfield sandboxScenery[60].object 46A4
Object: TagInstance = 0x000046A4

tags.dat\0x4455.> setfield sandboxScenery[61].object 46CF
Object: TagInstance = 0x000046CF

tags.dat\0x4455.> 

tags.dat\0x4455.> 

tags.dat\0x4455.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x4455.> setfield sandboxScenery[23].name box_s
Name: StringID = box_s

tags.dat\0x4455.> setfield sandboxScenery[24].name box_m
Name: StringID = box_m

tags.dat\0x4455.> setfield sandboxScenery[25].name box_l
Name: StringID = box_l

tags.dat\0x4455.> setfield sandboxScenery[26].name box_xl
Name: StringID = box_xl

tags.dat\0x4455.> setfield sandboxScenery[27].name box_xxl
Name: StringID = box_xxl

tags.dat\0x4455.> setfield sandboxScenery[28].name wall_s
Name: StringID = wall_s

tags.dat\0x4455.> setfield sandboxScenery[29].name wall_m
Name: StringID = wall_m

tags.dat\0x4455.> setfield sandboxScenery[30].name wall_l
Name: StringID = wall_l

tags.dat\0x4455.> setfield sandboxScenery[31].name wall_xl
Name: StringID = wall_xl

tags.dat\0x4455.> setfield sandboxScenery[32].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x4455.> setfield SandboxScenery[33].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x4455.> setfield SandboxScenery[34].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x4455.> setfield SandboxScenery[35].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x4455.> setfield SandboxScenery[36].name pit_controlpanel
Name: StringID = pit_controlpanel

tags.dat\0x4455.> setfield SandboxScenery[37].name pit_metal
Name: StringID = pit_metal

tags.dat\0x4455.> setfield SandboxScenery[38].name pit_keyboard
Name: StringID = pit_keyboard

tags.dat\0x4455.> setfield SandboxScenery[39].name pit_pcmonitor 
Name: StringID = pit_pcmonitor

tags.dat\0x4455.> setfield SandboxScenery[40].name pit_filecabinet 
Name: StringID = pit_filecabinet

tags.dat\0x4455.> setfield SandboxScenery[41].name pit_sfilecabinet
Name: StringID = pit_sfilecabinet

tags.dat\0x4455.> setfield SandboxScenery[42].name pit_chair 
Name: StringID = pit_chair

tags.dat\0x4455.> setfield SandboxScenery[43].name pit_gravlift
Name: StringID = pit_gravlift

tags.dat\0x4455.> setfield SandboxScenery[44].name pit_bird
Name: StringID = pit_bird

tags.dat\0x4455.> setfield SandboxScenery[45].name pit_bird2
Name: StringID = pit_bird2

tags.dat\0x4455.> setfield SandboxScenery[46].name pit_bird3
Name: StringID = pit_bird3

tags.dat\0x4455.> setfield SandboxScenery[47].name pit_camera
Name: StringID = pit_camera

tags.dat\0x4455.> 

tags.dat\0x4455.> 

tags.dat\0x4455.> setfield SandboxScenery[48].name pit_table
Name: StringID = pit_table

tags.dat\0x4455.> setfield SandboxScenery[49].name pit_largescreen
Name: StringID = pit_largescreen

tags.dat\0x4455.> setfield SandboxScenery[50].name pit_smallscreen
Name: StringID = pit_smallscreen

tags.dat\0x4455.> setfield SandboxScenery[51].name pit_whitescreen
Name: StringID = pit_whitescreen

tags.dat\0x4455.> setfield SandboxScenery[52].name pit_coveredcrate1
Name: StringID = pit_coveredcrate1

tags.dat\0x4455.> setfield SandboxScenery[53].name pit_coveredcrate2
Name: StringID = pit_coveredcrate2

tags.dat\0x4455.> setfield SandboxScenery[54].name pit_coveredmetal
Name: StringID = pit_coveredmetal

tags.dat\0x4455.> setfield SandboxScenery[55].name pit_coveredcrate3
Name: StringID = pit_coveredcrate3

tags.dat\0x4455.> setfield SandboxScenery[56].name pit_cameramoving
Name: StringID = pit_cameramoving

tags.dat\0x4455.> setfield SandboxScenery[57].name pit_missiles
Name: StringID = pit_missiles

tags.dat\0x4455.> setfield SandboxScenery[58].name pit_loudspeaker
Name: StringID = pit_loudspeaker

tags.dat\0x4455.> setfield SandboxScenery[59].name pit_pelican
Name: StringID = pit_pelican

tags.dat\0x4455.> setfield SandboxScenery[60].name pit_mirrorsink
Name: StringID = pit_mirrorsink

tags.dat\0x4455.> setfield SandboxScenery[61].name turf_hornet
Name: StringID = turf_hornet

tags.dat\0x4455.> 

tags.dat\0x4455.> 

tags.dat\0x4455.> echo  maxing forge pallete for Pit
maxing forge pallete for Pit 
tags.dat\0x4455.> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxScenery[22].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> 

tags.dat\0x4455.> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> 

tags.dat\0x4455.> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxWeapons[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> 

tags.dat\0x4455.> 

tags.dat\0x4455.> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> 

tags.dat\0x4455.> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> 

tags.dat\0x4455.> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> 

tags.dat\0x4455.> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4455.> 

tags.dat\0x4455.> 

tags.dat\0x4455.> savechanges
Done!

tags.dat\0x4455.> exit

tags.dat> 

tags.dat> echo   edit the scnr of Narrows
edit the scnr of Narrows 
tags.dat> edit 4A08
Tag 0x00004A08. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4A08.> echo   This command "removefrom sandboxScenery 19 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 19 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x4A08.> removefrom sandboxScenery 19 *
Successfully removed 21 elements from SandboxScenery at index 19: List`1<SandboxObject>
{...}[19]

tags.dat\0x4A08.> 

tags.dat\0x4A08.> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x4A08.> 

tags.dat\0x4A08.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x4A08.> addto sandboxScenery 21
Successfully added 21 elements to SandboxScenery: List`1<SandboxObject>
{...}[40]

tags.dat\0x4A08.> setfield SandboxScenery[19].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x4A08.> setfield SandboxScenery[20].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x4A08.> setfield SandboxScenery[21].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x4A08.> setfield SandboxScenery[22].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x4A08.> setfield SandboxScenery[23].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x4A08.> setfield SandboxScenery[24].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x4A08.> setfield SandboxScenery[25].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x4A08.> setfield SandboxScenery[26].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x4A08.> setfield SandboxScenery[27].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x4A08.> setfield SandboxScenery[28].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x4A08.> setfield SandboxScenery[29].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x4A08.> setfield SandboxScenery[30].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x4A08.> setfield SandboxScenery[31].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x4A08.> setfield SandboxScenery[32].object 4B5E
Object: TagInstance = 0x00004B5E

tags.dat\0x4A08.> setfield SandboxScenery[33].object 4B76
Object: TagInstance = 0x00004B76

tags.dat\0x4A08.> setfield SandboxScenery[34].object 4BC8
Object: TagInstance = 0x00004BC8

tags.dat\0x4A08.> setfield SandboxScenery[35].object 4B4D
Object: TagInstance = 0x00004B4D

tags.dat\0x4A08.> setfield SandboxScenery[36].object 4B4E
Object: TagInstance = 0x00004B4E

tags.dat\0x4A08.> setfield SandboxScenery[37].object 4B70
Object: TagInstance = 0x00004B70

tags.dat\0x4A08.> setfield SandboxScenery[38].object 4B7B
Object: TagInstance = 0x00004B7B

tags.dat\0x4A08.> setfield SandboxScenery[39].object 3495
Object: TagInstance = 0x00003495

tags.dat\0x4A08.> 

tags.dat\0x4A08.> 

tags.dat\0x4A08.> 

tags.dat\0x4A08.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x4A08.> setfield sandboxScenery[19].name box_s
Name: StringID = box_s

tags.dat\0x4A08.> setfield sandboxScenery[20].name box_m
Name: StringID = box_m

tags.dat\0x4A08.> setfield sandboxScenery[21].name box_l
Name: StringID = box_l

tags.dat\0x4A08.> setfield sandboxScenery[22].name box_xl
Name: StringID = box_xl

tags.dat\0x4A08.> setfield sandboxScenery[23].name box_xxl
Name: StringID = box_xxl

tags.dat\0x4A08.> setfield sandboxScenery[24].name wall_s
Name: StringID = wall_s

tags.dat\0x4A08.> setfield sandboxScenery[25].name wall_m
Name: StringID = wall_m

tags.dat\0x4A08.> setfield sandboxScenery[26].name wall_l
Name: StringID = wall_l

tags.dat\0x4A08.> setfield sandboxScenery[27].name wall_xl
Name: StringID = wall_xl

tags.dat\0x4A08.> setfield sandboxScenery[28].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x4A08.> setfield SandboxScenery[29].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x4A08.> setfield SandboxScenery[30].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x4A08.> setfield SandboxScenery[31].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x4A08.> setfield SandboxScenery[32].name narrows_iceicle 
Name: StringID = narrows_iceicle

tags.dat\0x4A08.> setfield SandboxScenery[33].name narrows_miceicle
Name: StringID = narrows_miceicle

tags.dat\0x4A08.> setfield SandboxScenery[34].name narrows_gravlift
Name: StringID = narrows_gravlift

tags.dat\0x4A08.> setfield SandboxScenery[35].name narrows_core
Name: StringID = narrows_core

tags.dat\0x4A08.> setfield SandboxScenery[36].name narrows_iceicle2
Name: StringID = narrows_iceicle2

tags.dat\0x4A08.> setfield SandboxScenery[37].name narrows_iceicle3
Name: StringID = narrows_iceicle3

tags.dat\0x4A08.> setfield SandboxScenery[38].name narrows_iceicle4
Name: StringID = narrows_iceicle4

tags.dat\0x4A08.> setfield SandboxScenery[39].name valhalla_waterfallbottom
Name: StringID = valhalla_waterfallbottom

tags.dat\0x4A08.> 

tags.dat\0x4A08.> echo  maxing forge pallete for Narrows
maxing forge pallete for Narrows 
tags.dat\0x4A08.> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> 

tags.dat\0x4A08.> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> 

tags.dat\0x4A08.> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxWeapons[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> 

tags.dat\0x4A08.> 

tags.dat\0x4A08.> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> 

tags.dat\0x4A08.> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> 

tags.dat\0x4A08.> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> 

tags.dat\0x4A08.> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4A08.> 

tags.dat\0x4A08.> savechanges
Done!

tags.dat\0x4A08.> exit

tags.dat> 

tags.dat> echo   edit the scnr of Standoff
edit the scnr of Standoff 
tags.dat> edit 4BD7
Tag 0x00004BD7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4BD7.> echo   This command "removefrom sandboxScenery 30 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 30 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x4BD7.> removefrom sandboxScenery 30 *
Successfully removed 20 elements from SandboxScenery at index 30: List`1<SandboxObject>
{...}[30]

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> echo  Adds 13 entrys to the scenery forge menu
Adds 13 entrys to the scenery forge menu 
tags.dat\0x4BD7.> addto sandboxScenery 20
Successfully added 20 elements to SandboxScenery: List`1<SandboxObject>
{...}[50]

tags.dat\0x4BD7.> setfield SandboxScenery[30].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x4BD7.> setfield SandboxScenery[31].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x4BD7.> setfield SandboxScenery[32].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x4BD7.> setfield SandboxScenery[33].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x4BD7.> setfield SandboxScenery[34].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x4BD7.> setfield SandboxScenery[35].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x4BD7.> setfield SandboxScenery[36].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x4BD7.> setfield SandboxScenery[37].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x4BD7.> setfield SandboxScenery[38].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x4BD7.> setfield SandboxScenery[39].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x4BD7.> setfield SandboxScenery[40].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x4BD7.> setfield SandboxScenery[41].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x4BD7.> setfield SandboxScenery[42].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x4BD7.> setfield SandboxScenery[43].object 4D16
Object: TagInstance = 0x00004D16

tags.dat\0x4BD7.> setfield SandboxScenery[44].object 4D44
Object: TagInstance = 0x00004D44

tags.dat\0x4BD7.> setfield SandboxScenery[45].object 4D46
Object: TagInstance = 0x00004D46

tags.dat\0x4BD7.> setfield SandboxScenery[46].object 4D4F
Object: TagInstance = 0x00004D4F

tags.dat\0x4BD7.> setfield SandboxScenery[47].object 4D59
Object: TagInstance = 0x00004D59

tags.dat\0x4BD7.> setfield SandboxScenery[48].object 4D6A
Object: TagInstance = 0x00004D6A

tags.dat\0x4BD7.> setfield SandboxScenery[49].object 4D78
Object: TagInstance = 0x00004D78

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x4BD7.> setfield sandboxScenery[30].name box_s
Name: StringID = box_s

tags.dat\0x4BD7.> setfield sandboxScenery[31].name box_m
Name: StringID = box_m

tags.dat\0x4BD7.> setfield sandboxScenery[32].name box_l
Name: StringID = box_l

tags.dat\0x4BD7.> setfield sandboxScenery[33].name box_xl
Name: StringID = box_xl

tags.dat\0x4BD7.> setfield sandboxScenery[34].name box_xxl
Name: StringID = box_xxl

tags.dat\0x4BD7.> setfield sandboxScenery[35].name wall_s
Name: StringID = wall_s

tags.dat\0x4BD7.> setfield sandboxScenery[36].name wall_m
Name: StringID = wall_m

tags.dat\0x4BD7.> setfield sandboxScenery[37].name wall_l
Name: StringID = wall_l

tags.dat\0x4BD7.> setfield sandboxScenery[38].name wall_xl
Name: StringID = wall_xl

tags.dat\0x4BD7.> setfield sandboxScenery[39].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x4BD7.> setfield SandboxScenery[40].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x4BD7.> setfield SandboxScenery[41].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x4BD7.> setfield SandboxScenery[42].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x4BD7.> setfield SandboxScenery[43].name sandbags
Name: StringID = sandbags

tags.dat\0x4BD7.> setfield SandboxScenery[44].name pit_smallscreen
Name: StringID = pit_smallscreen

tags.dat\0x4BD7.> setfield SandboxScenery[45].name standoff_lights
Name: StringID = standoff_lights

tags.dat\0x4BD7.> setfield SandboxScenery[46].name cornersandbag
Name: StringID = cornersandbag

tags.dat\0x4BD7.> setfield SandboxScenery[47].name standoff_locker
Name: StringID = standoff_locker

tags.dat\0x4BD7.> setfield SandboxScenery[48].name standoff_metalfence
Name: StringID = standoff_metalfence

tags.dat\0x4BD7.> setfield SandboxScenery[49].name standoff_metalsheet
Name: StringID = standoff_metalsheet

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> echo  maxing forge pallete for Standoff
maxing forge pallete for Standoff 
tags.dat\0x4BD7.> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[22].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[23].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[24].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[25].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[26].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[27].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[28].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxScenery[29].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxVehicles[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxVehicles[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxVehicles[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxVehicles[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxVehicles[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxWeapons[22].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4BD7.> 

tags.dat\0x4BD7.> savechanges
Done!

tags.dat\0x4BD7.> exit

tags.dat> 

tags.dat> echo  Phasing Standoff Objects
Phasing Standoff Objects 
tags.dat> edit 4DF7
Tag 0x00004DF7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4DF7.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4DF7.> savechanges
Done!

tags.dat\0x4DF7.> exit

tags.dat> 

tags.dat> edit 4E1F
Tag 0x00004E1F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E1F.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E1F.> savechanges
Done!

tags.dat\0x4E1F.> exit

tags.dat> 

tags.dat> edit 4E2A
Tag 0x00004E2A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E2A.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E2A.> savechanges
Done!

tags.dat\0x4E2A.> exit

tags.dat> 

tags.dat> edit 4E52
Tag 0x00004E52. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E52.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E52.> savechanges
Done!

tags.dat\0x4E52.> exit

tags.dat> 

tags.dat> edit 4E3B
Tag 0x00004E3B. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E3B.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E3B.> savechanges
Done!

tags.dat\0x4E3B.> exit

tags.dat> 

tags.dat> edit 4E45
Tag 0x00004E45. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4E45.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x4E45.> savechanges
Done!

tags.dat\0x4E45.> exit

tags.dat> 

tags.dat> echo phasing objects on sandtrap
phasing objects on sandtrap 
tags.dat> 

tags.dat> edit 56F4
Tag 0x000056F4. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x56F4.> setfield Rigidbodies[*].motiontype 4
MotionType: MotionTypeValue = Keyframed

tags.dat\0x56F4.> savechanges
Done!

tags.dat\0x56F4.> exit

tags.dat> 

tags.dat> echo   edit the scnr of Last resort
edit the scnr of Last resort 
tags.dat> edit 4F14
Tag 0x00004F14. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4F14.> echo   This command "removefrom sandboxScenery 21 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 21 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x4F14.> removefrom sandboxScenery 21 *
Successfully removed 26 elements from SandboxScenery at index 21: List`1<SandboxObject>
{...}[21]

tags.dat\0x4F14.> 

tags.dat\0x4F14.> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x4F14.> 

tags.dat\0x4F14.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x4F14.> addto sandboxScenery 23
Successfully added 23 elements to SandboxScenery: List`1<SandboxObject>
{...}[44]

tags.dat\0x4F14.> setfield SandboxScenery[21].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x4F14.> setfield SandboxScenery[22].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x4F14.> setfield SandboxScenery[23].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x4F14.> setfield SandboxScenery[24].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x4F14.> setfield SandboxScenery[25].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x4F14.> setfield SandboxScenery[26].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x4F14.> setfield SandboxScenery[27].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x4F14.> setfield SandboxScenery[28].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x4F14.> setfield SandboxScenery[29].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x4F14.> setfield SandboxScenery[30].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x4F14.> setfield SandboxScenery[31].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x4F14.> setfield SandboxScenery[32].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x4F14.> setfield SandboxScenery[33].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x4F14.> setfield SandboxScenery[34].object 51C7
Object: TagInstance = 0x000051C7

tags.dat\0x4F14.> setfield SandboxScenery[35].object 5210
Object: TagInstance = 0x00005210

tags.dat\0x4F14.> setfield SandboxScenery[36].object 51FD
Object: TagInstance = 0x000051FD

tags.dat\0x4F14.> setfield SandboxScenery[37].object 51EA
Object: TagInstance = 0x000051EA

tags.dat\0x4F14.> setfield SandboxScenery[38].object 50E0
Object: TagInstance = 0x000050E0

tags.dat\0x4F14.> setfield SandboxScenery[39].object 3492
Object: TagInstance = 0x00003492

tags.dat\0x4F14.> setfield SandboxScenery[40].object 3493
Object: TagInstance = 0x00003493

tags.dat\0x4F14.> setfield SandboxScenery[41].object 50E9
Object: TagInstance = 0x000050E9

tags.dat\0x4F14.> setfield SandboxScenery[42].object 50EE
Object: TagInstance = 0x000050EE

tags.dat\0x4F14.> setfield SandboxScenery[43].object 50F3
Object: TagInstance = 0x000050F3

tags.dat\0x4F14.> 

tags.dat\0x4F14.> 

tags.dat\0x4F14.> 

tags.dat\0x4F14.> 

tags.dat\0x4F14.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x4F14.> setfield sandboxScenery[21].name box_s
Name: StringID = box_s

tags.dat\0x4F14.> setfield sandboxScenery[22].name box_m
Name: StringID = box_m

tags.dat\0x4F14.> setfield sandboxScenery[23].name box_l
Name: StringID = box_l

tags.dat\0x4F14.> setfield sandboxScenery[24].name box_xl
Name: StringID = box_xl

tags.dat\0x4F14.> setfield sandboxScenery[25].name box_xxl
Name: StringID = box_xxl

tags.dat\0x4F14.> setfield sandboxScenery[26].name wall_s
Name: StringID = wall_s

tags.dat\0x4F14.> setfield sandboxScenery[27].name wall_m
Name: StringID = wall_m

tags.dat\0x4F14.> setfield sandboxScenery[28].name wall_l
Name: StringID = wall_l

tags.dat\0x4F14.> setfield sandboxScenery[29].name wall_xl
Name: StringID = wall_xl

tags.dat\0x4F14.> setfield sandboxScenery[30].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x4F14.> setfield SandboxScenery[31].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x4F14.> setfield SandboxScenery[32].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x4F14.> setfield SandboxScenery[33].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x4F14.> setfield SandboxScenery[34].name lastR_Bridge
Name: StringID = lastR_Bridge

tags.dat\0x4F14.> setfield SandboxScenery[35].name lastR_Barricade
Name: StringID = lastR_Barricade

tags.dat\0x4F14.> setfield SandboxScenery[36].name lastR_Light
Name: StringID = lastR_Light

tags.dat\0x4F14.> setfield SandboxScenery[37].name lastR_Window
Name: StringID = lastR_Window

tags.dat\0x4F14.> setfield SandboxScenery[38].name lastR_walllight
Name: StringID = lastR_walllight

tags.dat\0x4F14.> setfield SandboxScenery[39].name warthog_pallete
Name: StringID = warthog_pallete

tags.dat\0x4F14.> setfield SandboxScenery[40].name mongoose_pallete
Name: StringID = mongoose_pallete

tags.dat\0x4F14.> setfield SandboxScenery[41].name cornersandbag
Name: StringID = cornersandbag

tags.dat\0x4F14.> setfield SandboxScenery[42].name sandbagblock 
Name: StringID = sandbagblock

tags.dat\0x4F14.> setfield SandboxScenery[43].name sandbags
Name: StringID = sandbags

tags.dat\0x4F14.> 

tags.dat\0x4F14.> 

tags.dat\0x4F14.> echo  maxing forge pallete for last resort
maxing forge pallete for last resort 
tags.dat\0x4F14.> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> 

tags.dat\0x4F14.> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxVehicles[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxVehicles[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxVehicles[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> 

tags.dat\0x4F14.> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxWeapons[18].maxallowed 0
Invalid index requested from block sandboxWeapons: 18
SetField: Sets the value of a specific field in the current Scenario definition.

Usage:
SetField <field name> <field value>

Use "help SetField" for more information.

tags.dat\0x4F14.> 

tags.dat\0x4F14.> 

tags.dat\0x4F14.> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> 

tags.dat\0x4F14.> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> 

tags.dat\0x4F14.> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> 

tags.dat\0x4F14.> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x4F14.> 

tags.dat\0x4F14.> 

tags.dat\0x4F14.> savechanges
Done!

tags.dat\0x4F14.> exit

tags.dat> 

tags.dat> echo   edit the scnr of High Ground
edit the scnr of High Ground 
tags.dat> edit 5247
Tag 0x00005247. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5247.> echo   This command "removefrom sandboxScenery 31 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 31 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x5247.> removefrom sandboxScenery 31 *
Successfully removed 26 elements from SandboxScenery at index 31: List`1<SandboxObject>
{...}[31]

tags.dat\0x5247.> 

tags.dat\0x5247.> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x5247.> 

tags.dat\0x5247.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x5247.> addto sandboxScenery 26
Successfully added 26 elements to SandboxScenery: List`1<SandboxObject>
{...}[57]

tags.dat\0x5247.> setfield SandboxScenery[31].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x5247.> setfield SandboxScenery[32].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x5247.> setfield SandboxScenery[33].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x5247.> setfield SandboxScenery[34].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x5247.> setfield SandboxScenery[35].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x5247.> setfield SandboxScenery[36].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x5247.> setfield SandboxScenery[37].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x5247.> setfield SandboxScenery[38].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x5247.> setfield SandboxScenery[39].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x5247.> setfield SandboxScenery[40].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x5247.> setfield SandboxScenery[41].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x5247.> setfield SandboxScenery[42].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x5247.> setfield SandboxScenery[43].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x5247.> setfield SandboxScenery[44].object 5495
Object: TagInstance = 0x00005495

tags.dat\0x5247.> setfield SandboxScenery[45].object 54A2
Object: TagInstance = 0x000054A2

tags.dat\0x5247.> setfield SandboxScenery[46].object 54AB
Object: TagInstance = 0x000054AB

tags.dat\0x5247.> setfield SandboxScenery[47].object 54C7
Object: TagInstance = 0x000054C7

tags.dat\0x5247.> setfield SandboxScenery[48].object 54CC
Object: TagInstance = 0x000054CC

tags.dat\0x5247.> setfield SandboxScenery[49].object 54D1
Object: TagInstance = 0x000054D1

tags.dat\0x5247.> setfield SandboxScenery[50].object 54D7
Object: TagInstance = 0x000054D7

tags.dat\0x5247.> setfield SandboxScenery[51].object 53A2
Object: TagInstance = 0x000053A2

tags.dat\0x5247.> 

tags.dat\0x5247.> setfield SandboxScenery[52].object 3492
Object: TagInstance = 0x00003492

tags.dat\0x5247.> setfield SandboxScenery[53].object 3493
Object: TagInstance = 0x00003493

tags.dat\0x5247.> setfield SandboxScenery[54].object 348E
Object: TagInstance = 0x0000348E

tags.dat\0x5247.> setfield SandboxScenery[55].object 5324
Object: TagInstance = 0x00005324

tags.dat\0x5247.> setfield SandboxScenery[56].object 4608
Object: TagInstance = 0x00004608

tags.dat\0x5247.> 

tags.dat\0x5247.> 

tags.dat\0x5247.> 

tags.dat\0x5247.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x5247.> setfield sandboxScenery[31].name box_s
Name: StringID = box_s

tags.dat\0x5247.> setfield sandboxScenery[32].name box_m
Name: StringID = box_m

tags.dat\0x5247.> setfield sandboxScenery[33].name box_l
Name: StringID = box_l

tags.dat\0x5247.> setfield sandboxScenery[34].name box_xl
Name: StringID = box_xl

tags.dat\0x5247.> setfield sandboxScenery[35].name box_xxl
Name: StringID = box_xxl

tags.dat\0x5247.> setfield sandboxScenery[36].name wall_s
Name: StringID = wall_s

tags.dat\0x5247.> setfield sandboxScenery[37].name wall_m
Name: StringID = wall_m

tags.dat\0x5247.> setfield sandboxScenery[38].name wall_l
Name: StringID = wall_l

tags.dat\0x5247.> setfield sandboxScenery[39].name wall_xl
Name: StringID = wall_xl

tags.dat\0x5247.> setfield sandboxScenery[40].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x5247.> setfield SandboxScenery[41].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x5247.> setfield SandboxScenery[42].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x5247.> setfield SandboxScenery[43].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x5247.> setfield sandboxScenery[44].name Highground_bunkerlid
Name: StringID = Highground_bunkerlid

tags.dat\0x5247.> setfield sandboxScenery[45].name Highground_chaingate
Name: StringID = Highground_chaingate

tags.dat\0x5247.> setfield sandboxScenery[46].name Highground_Cardboardbox
Name: StringID = Highground_Cardboardbox

tags.dat\0x5247.> setfield sandboxScenery[47].name Highground_Cboardboxrec
Name: StringID = Highground_Cboardboxrec

tags.dat\0x5247.> setfield sandboxScenery[48].name Highground_Cboardbox2 
Name: StringID = Highground_Cboardbox2

tags.dat\0x5247.> setfield SandboxScenery[49].name Highground_squaretable
Name: StringID = Highground_squaretable

tags.dat\0x5247.> setfield SandboxScenery[50].name Highground_chaingate2
Name: StringID = Highground_chaingate2

tags.dat\0x5247.> setfield SandboxScenery[51].name Highground_ProwlerTurret
Name: StringID = Highground_ProwlerTurret

tags.dat\0x5247.> setfield SandboxScenery[52].name warthog_pallete
Name: StringID = warthog_pallete

tags.dat\0x5247.> setfield SandboxScenery[53].name mongoose_pallete 
Name: StringID = mongoose_pallete

tags.dat\0x5247.> setfield SandboxScenery[54].name opendroppod 
Name: StringID = opendroppod

tags.dat\0x5247.> setfield SandboxScenery[55].name Highground_Shelves
Name: StringID = Highground_Shelves

tags.dat\0x5247.> setfield SandboxScenery[56].name pit_table
Name: StringID = pit_table

tags.dat\0x5247.> 

tags.dat\0x5247.> 

tags.dat\0x5247.> 

tags.dat\0x5247.> echo  maxing forge pallete for High Ground
maxing forge pallete for High Ground 
tags.dat\0x5247.> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[22].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[23].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[24].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[25].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[26].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[27].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[28].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[29].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxScenery[30].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> 

tags.dat\0x5247.> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxVehicles[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxVehicles[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxVehicles[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxVehicles[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxVehicles[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxVehicles[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> 

tags.dat\0x5247.> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxWeapons[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> 

tags.dat\0x5247.> 

tags.dat\0x5247.> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxEquipment[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> 

tags.dat\0x5247.> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> 

tags.dat\0x5247.> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> 

tags.dat\0x5247.> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x5247.> 

tags.dat\0x5247.> savechanges
Done!

tags.dat\0x5247.> exit

tags.dat> 

tags.dat> 

tags.dat> echo   edit the scnr of Sandtrap
edit the scnr of Sandtrap 
tags.dat> edit 54E9
Tag 0x000054E9. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54E9.> echo   This command "removefrom sandboxScenery 22 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 22 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x54E9.> removefrom sandboxScenery 22 *
Successfully removed 40 elements from SandboxScenery at index 22: List`1<SandboxObject>
{...}[22]

tags.dat\0x54E9.> 

tags.dat\0x54E9.> setfield sandboxbudget 10000
SandboxBudget: Single = 10000

tags.dat\0x54E9.> 

tags.dat\0x54E9.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x54E9.> addto sandboxScenery 38
Successfully added 38 elements to SandboxScenery: List`1<SandboxObject>
{...}[60]

tags.dat\0x54E9.> setfield SandboxScenery[22].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x54E9.> setfield SandboxScenery[23].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x54E9.> setfield SandboxScenery[24].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x54E9.> setfield SandboxScenery[25].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x54E9.> setfield SandboxScenery[26].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x54E9.> setfield SandboxScenery[27].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x54E9.> setfield SandboxScenery[28].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x54E9.> setfield SandboxScenery[29].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x54E9.> setfield SandboxScenery[30].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x54E9.> setfield SandboxScenery[31].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x54E9.> setfield SandboxScenery[32].object 5628
Object: TagInstance = 0x00005628

tags.dat\0x54E9.> setfield SandboxScenery[33].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x54E9.> setfield SandboxScenery[34].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x54E9.> setfield SandboxScenery[35].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x54E9.> setfield SandboxScenery[36].object 56EC
Object: TagInstance = 0x000056EC

tags.dat\0x54E9.> setfield SandboxScenery[37].object 56F5
Object: TagInstance = 0x000056F5

tags.dat\0x54E9.> setfield SandboxScenery[38].object 56FF
Object: TagInstance = 0x000056FF

tags.dat\0x54E9.> setfield SandboxScenery[39].object 5709
Object: TagInstance = 0x00005709

tags.dat\0x54E9.> setfield SandboxScenery[40].object 5713
Object: TagInstance = 0x00005713

tags.dat\0x54E9.> setfield SandboxScenery[41].object 5699
Object: TagInstance = 0x00005699

tags.dat\0x54E9.> setfield SandboxScenery[42].object 3492
Object: TagInstance = 0x00003492

tags.dat\0x54E9.> setfield SandboxScenery[43].object 3493
Object: TagInstance = 0x00003493

tags.dat\0x54E9.> setfield SandboxScenery[44].object 50F3
Object: TagInstance = 0x000050F3

tags.dat\0x54E9.> setfield SandboxScenery[45].object 50EE
Object: TagInstance = 0x000050EE

tags.dat\0x54E9.> setfield SandboxScenery[46].object 55A8
Object: TagInstance = 0x000055A8

tags.dat\0x54E9.> setfield SandboxScenery[47].object 50E9
Object: TagInstance = 0x000050E9

tags.dat\0x54E9.> setfield SandboxScenery[48].object 55E6
Object: TagInstance = 0x000055E6

tags.dat\0x54E9.> setfield SandboxScenery[49].object 55F0
Object: TagInstance = 0x000055F0

tags.dat\0x54E9.> setfield SandboxScenery[50].object 55FB
Object: TagInstance = 0x000055FB

tags.dat\0x54E9.> setfield SandboxScenery[51].object 5600
Object: TagInstance = 0x00005600

tags.dat\0x54E9.> setfield SandboxScenery[52].object 5605
Object: TagInstance = 0x00005605

tags.dat\0x54E9.> setfield SandboxScenery[53].object 560A
Object: TagInstance = 0x0000560A

tags.dat\0x54E9.> setfield SandboxScenery[54].object 560F
Object: TagInstance = 0x0000560F

tags.dat\0x54E9.> setfield SandboxScenery[55].object 5614
Object: TagInstance = 0x00005614

tags.dat\0x54E9.> setfield SandboxScenery[56].object 560A
Object: TagInstance = 0x0000560A

tags.dat\0x54E9.> setfield SandboxScenery[57].object 5619
Object: TagInstance = 0x00005619

tags.dat\0x54E9.> setfield SandboxScenery[58].object 561E
Object: TagInstance = 0x0000561E

tags.dat\0x54E9.> setfield SandboxScenery[59].object 5623
Object: TagInstance = 0x00005623

tags.dat\0x54E9.> 

tags.dat\0x54E9.> 

tags.dat\0x54E9.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x54E9.> setfield sandboxScenery[22].name box_s
Name: StringID = box_s

tags.dat\0x54E9.> setfield sandboxScenery[23].name box_m
Name: StringID = box_m

tags.dat\0x54E9.> setfield sandboxScenery[24].name box_l
Name: StringID = box_l

tags.dat\0x54E9.> setfield sandboxScenery[25].name box_xl
Name: StringID = box_xl

tags.dat\0x54E9.> setfield sandboxScenery[26].name box_xxl
Name: StringID = box_xxl

tags.dat\0x54E9.> setfield sandboxScenery[27].name wall_s
Name: StringID = wall_s

tags.dat\0x54E9.> setfield sandboxScenery[28].name wall_m
Name: StringID = wall_m

tags.dat\0x54E9.> setfield sandboxScenery[29].name wall_l
Name: StringID = wall_l

tags.dat\0x54E9.> setfield sandboxScenery[30].name wall_xl
Name: StringID = wall_xl

tags.dat\0x54E9.> setfield sandboxScenery[31].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x54E9.> setfield sandboxScenery[32].name elephant
Name: StringID = elephant

tags.dat\0x54E9.> setfield SandboxScenery[33].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x54E9.> setfield SandboxScenery[34].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x54E9.> setfield SandboxScenery[35].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x54E9.> setfield SandboxScenery[36].name Sandtrap_UsncMetal
Name: StringID = Sandtrap_UsncMetal

tags.dat\0x54E9.> setfield SandboxScenery[37].name Sandtrap_GravityLift
Name: StringID = Sandtrap_GravityLift

tags.dat\0x54E9.> setfield SandboxScenery[38].name Sandtrap_Barrel
Name: StringID = Sandtrap_Barrel

tags.dat\0x54E9.> setfield SandboxScenery[39].name Sandtrap_crowbar
Name: StringID = Sandtrap_crowbar

tags.dat\0x54E9.> setfield SandboxScenery[40].name Sandtrap_Metal_plate 
Name: StringID = Sandtrap_Metal_plate

tags.dat\0x54E9.> setfield SandboxScenery[41].name Sandtrap_Davinci_egg  
Name: StringID = Sandtrap_Davinci_egg

tags.dat\0x54E9.> setfield SandboxScenery[42].name warthog_pallete
Name: StringID = warthog_pallete

tags.dat\0x54E9.> setfield SandboxScenery[43].name mongoose_pallete
Name: StringID = mongoose_pallete

tags.dat\0x54E9.> setfield SandboxScenery[44].name sandbags
Name: StringID = sandbags

tags.dat\0x54E9.> setfield SandboxScenery[45].name sandbagblock
Name: StringID = sandbagblock

tags.dat\0x54E9.> setfield SandboxScenery[46].name cornersandbag
Name: StringID = cornersandbag

tags.dat\0x54E9.> setfield SandboxScenery[47].name cornersandbag2
Name: StringID = cornersandbag2

tags.dat\0x54E9.> setfield SandboxScenery[48].name Sandtrap_lightstick
Name: StringID = Sandtrap_lightstick

tags.dat\0x54E9.> setfield SandboxScenery[49].name sandtrap_phantom_part1
Name: StringID = sandtrap_phantom_part1

tags.dat\0x54E9.> setfield SandboxScenery[50].name sandtrap_phantom_part2
Name: StringID = sandtrap_phantom_part2

tags.dat\0x54E9.> setfield SandboxScenery[51].name sandtrap_phantom_part3 
Name: StringID = sandtrap_phantom_part3

tags.dat\0x54E9.> setfield SandboxScenery[52].name sandtrap_phantom_part4 
Name: StringID = sandtrap_phantom_part4

tags.dat\0x54E9.> setfield SandboxScenery[53].name sandtrap_phantom_part5
Name: StringID = sandtrap_phantom_part5

tags.dat\0x54E9.> setfield SandboxScenery[54].name sandtrap_phantom_part6 
Name: StringID = sandtrap_phantom_part6

tags.dat\0x54E9.> setfield SandboxScenery[55].name sandtrap_phantom_part7 
Name: StringID = sandtrap_phantom_part7

tags.dat\0x54E9.> setfield SandboxScenery[56].name sandtrap_phantom_part8
Name: StringID = sandtrap_phantom_part8

tags.dat\0x54E9.> setfield SandboxScenery[57].name sandtrap_phantom_part9 
Name: StringID = sandtrap_phantom_part9

tags.dat\0x54E9.> setfield SandboxScenery[58].name sandtrap_phantom_part10
Name: StringID = sandtrap_phantom_part10

tags.dat\0x54E9.> setfield SandboxScenery[59].name sandtrap_phantom_part11
Name: StringID = sandtrap_phantom_part11

tags.dat\0x54E9.> 

tags.dat\0x54E9.> echo  maxing forge pallete for Sandtrap
maxing forge pallete for Sandtrap 
tags.dat\0x54E9.> setfield sandboxScenery[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[19].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[20].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxScenery[21].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> 

tags.dat\0x54E9.> setfield sandboxVehicles[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxVehicles[10].maxallowed 0
Invalid index requested from block sandboxVehicles: 10
SetField: Sets the value of a specific field in the current Scenario definition.

Usage:
SetField <field name> <field value>

Use "help SetField" for more information.

tags.dat\0x54E9.> 

tags.dat\0x54E9.> 

tags.dat\0x54E9.> setfield sandboxWeapons[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxWeapons[18].maxallowed 0
Invalid index requested from block sandboxWeapons: 18
SetField: Sets the value of a specific field in the current Scenario definition.

Usage:
SetField <field name> <field value>

Use "help SetField" for more information.

tags.dat\0x54E9.> 

tags.dat\0x54E9.> 

tags.dat\0x54E9.> setfield sandboxEquipment[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxEquipment[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> 

tags.dat\0x54E9.> setfield sandboxTeleporters[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxTeleporters[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxTeleporters[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> 

tags.dat\0x54E9.> setfield sandboxSpawning[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[9].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[10].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[11].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[12].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[13].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[14].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[15].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[16].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[17].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxSpawning[18].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> 

tags.dat\0x54E9.> setfield sandboxGoalObjects[0].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxGoalObjects[1].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxGoalObjects[2].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxGoalObjects[3].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxGoalObjects[4].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxGoalObjects[5].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxGoalObjects[6].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxGoalObjects[7].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> setfield sandboxGoalObjects[8].maxallowed 0
MaxAllowed: Int32 = 0

tags.dat\0x54E9.> 

tags.dat\0x54E9.> 

tags.dat\0x54E9.> savechanges
Done!

tags.dat\0x54E9.> exit

tags.dat> 

tags.dat> echo   edit the scnr of Guardian
edit the scnr of Guardian 
tags.dat> edit 2E8A
Tag 0x00002E8A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2E8A.> echo   This command "removefrom sandboxScenery 48 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 48 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x2E8A.> removefrom sandboxScenery 48 *
Successfully removed 13 elements from SandboxScenery at index 48: List`1<SandboxObject>
{...}[48]

tags.dat\0x2E8A.> 

tags.dat\0x2E8A.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x2E8A.> addto sandboxScenery 13
Successfully added 13 elements to SandboxScenery: List`1<SandboxObject>
{...}[61]

tags.dat\0x2E8A.> setfield SandboxScenery[48].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x2E8A.> setfield SandboxScenery[49].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x2E8A.> setfield SandboxScenery[50].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x2E8A.> setfield SandboxScenery[51].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x2E8A.> setfield SandboxScenery[52].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x2E8A.> setfield SandboxScenery[53].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x2E8A.> setfield SandboxScenery[54].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x2E8A.> setfield SandboxScenery[55].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x2E8A.> setfield SandboxScenery[56].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x2E8A.> setfield SandboxScenery[57].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x2E8A.> setfield SandboxScenery[58].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x2E8A.> setfield SandboxScenery[59].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x2E8A.> setfield SandboxScenery[60].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x2E8A.> 

tags.dat\0x2E8A.> echo forge pallete limit is 64
forge pallete limit is 64 
tags.dat\0x2E8A.> 

tags.dat\0x2E8A.> removefrom sandboxGoalObjects 9 *
Successfully removed 9 elements from SandboxGoalObjects at index 9: List`1<SandboxObject>
{...}[9]

tags.dat\0x2E8A.> addto sandboxGoalObjects 9
Successfully added 9 elements to SandboxGoalObjects: List`1<SandboxObject>
{...}[18]

tags.dat\0x2E8A.> setfield SandboxGoalObjects[9].object 2ED9
Object: TagInstance = 0x00002ED9

tags.dat\0x2E8A.> setfield SandboxGoalObjects[10].object 2EDA
Object: TagInstance = 0x00002EDA

tags.dat\0x2E8A.> setfield SandboxGoalObjects[11].object 2EDB
Object: TagInstance = 0x00002EDB

tags.dat\0x2E8A.> setfield SandboxGoalObjects[12].object 2EDD
Object: TagInstance = 0x00002EDD

tags.dat\0x2E8A.> setfield SandboxGoalObjects[13].object 2EE6
Object: TagInstance = 0x00002EE6

tags.dat\0x2E8A.> setfield SandboxGoalObjects[14].object 2EE7
Object: TagInstance = 0x00002EE7

tags.dat\0x2E8A.> setfield SandboxGoalObjects[15].object 2EE8
Object: TagInstance = 0x00002EE8

tags.dat\0x2E8A.> setfield SandboxGoalObjects[16].object 2EA4
Object: TagInstance = 0x00002EA4

tags.dat\0x2E8A.> setfield SandboxGoalObjects[17].object 2EA5
Object: TagInstance = 0x00002EA5

tags.dat\0x2E8A.> 

tags.dat\0x2E8A.> 

tags.dat\0x2E8A.> 

tags.dat\0x2E8A.> setfield SandboxGoalObjects[9].name Guardian_GoldLift
Name: StringID = Guardian_GoldLift

tags.dat\0x2E8A.> setfield SandboxGoalObjects[10].name Guardian_MancannonLift 
Name: StringID = Guardian_MancannonLift

tags.dat\0x2E8A.> setfield SandboxGoalObjects[11].name Guardian_Mancannonlift2
Name: StringID = Guardian_Mancannonlift2

tags.dat\0x2E8A.> setfield SandboxGoalObjects[12].name Guardian_Minilift 
Name: StringID = Guardian_Minilift

tags.dat\0x2E8A.> setfield SandboxGoalObjects[13].name Guardian_vine1
Name: StringID = Guardian_vine1

tags.dat\0x2E8A.> setfield SandboxGoalObjects[14].name Guardian_vine2
Name: StringID = Guardian_vine2

tags.dat\0x2E8A.> setfield SandboxGoalObjects[15].name Guardian_vine3
Name: StringID = Guardian_vine3

tags.dat\0x2E8A.> setfield SandboxGoalObjects[16].name Guardian_blueholo
Name: StringID = Guardian_blueholo

tags.dat\0x2E8A.> setfield SandboxGoalObjects[17].name Guardian_purpleholo
Name: StringID = Guardian_purpleholo

tags.dat\0x2E8A.> 

tags.dat\0x2E8A.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x2E8A.> setfield sandboxScenery[48].name box_s
Name: StringID = box_s

tags.dat\0x2E8A.> setfield sandboxScenery[49].name box_m
Name: StringID = box_m

tags.dat\0x2E8A.> setfield sandboxScenery[50].name box_l
Name: StringID = box_l

tags.dat\0x2E8A.> setfield sandboxScenery[51].name box_xl
Name: StringID = box_xl

tags.dat\0x2E8A.> setfield sandboxScenery[52].name box_xxl
Name: StringID = box_xxl

tags.dat\0x2E8A.> setfield sandboxScenery[53].name wall_s
Name: StringID = wall_s

tags.dat\0x2E8A.> setfield sandboxScenery[54].name wall_m
Name: StringID = wall_m

tags.dat\0x2E8A.> setfield sandboxScenery[55].name wall_l
Name: StringID = wall_l

tags.dat\0x2E8A.> setfield sandboxScenery[56].name wall_xl
Name: StringID = wall_xl

tags.dat\0x2E8A.> setfield sandboxScenery[57].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x2E8A.> setfield SandboxScenery[58].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x2E8A.> setfield SandboxScenery[59].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x2E8A.> setfield SandboxScenery[60].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x2E8A.> 

tags.dat\0x2E8A.> savechanges
Done!

tags.dat\0x2E8A.> exit

tags.dat> 

tags.dat> echo   edit the scnr of Diamondback
edit the scnr of Diamondback 
tags.dat> edit 3A0E
Tag 0x00003A0E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3A0E.> echo   This command "removefrom sandboxScenery 48 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 48 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x3A0E.> removefrom sandboxScenery 48 *
Successfully removed 13 elements from SandboxScenery at index 48: List`1<SandboxObject>
{...}[48]

tags.dat\0x3A0E.> 

tags.dat\0x3A0E.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x3A0E.> addto sandboxScenery 13
Successfully added 13 elements to SandboxScenery: List`1<SandboxObject>
{...}[61]

tags.dat\0x3A0E.> setfield SandboxScenery[48].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x3A0E.> setfield SandboxScenery[49].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x3A0E.> setfield SandboxScenery[50].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x3A0E.> setfield SandboxScenery[51].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x3A0E.> setfield SandboxScenery[52].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x3A0E.> setfield SandboxScenery[53].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x3A0E.> setfield SandboxScenery[54].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x3A0E.> setfield SandboxScenery[55].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x3A0E.> setfield SandboxScenery[56].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x3A0E.> setfield SandboxScenery[57].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x3A0E.> setfield SandboxScenery[58].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x3A0E.> setfield SandboxScenery[59].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x3A0E.> setfield SandboxScenery[60].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x3A0E.> 

tags.dat\0x3A0E.> echo forge limit
forge limit 
tags.dat\0x3A0E.> 

tags.dat\0x3A0E.> removefrom sandboxGoalObjects 9 *
Successfully removed 10 elements from SandboxGoalObjects at index 9: List`1<SandboxObject>
{...}[9]

tags.dat\0x3A0E.> addto sandboxGoalObjects 10
Successfully added 10 elements to SandboxGoalObjects: List`1<SandboxObject>
{...}[19]

tags.dat\0x3A0E.> setfield SandboxGoalObjects[9].object 3A9F
Object: TagInstance = 0x00003A9F

tags.dat\0x3A0E.> setfield SandboxGoalObjects[10].object 3AA0
Object: TagInstance = 0x00003AA0

tags.dat\0x3A0E.> setfield SandboxGoalObjects[11].object 3AA1
Object: TagInstance = 0x00003AA1

tags.dat\0x3A0E.> setfield SandboxGoalObjects[12].object 3AA2
Object: TagInstance = 0x00003AA2

tags.dat\0x3A0E.> setfield SandboxGoalObjects[13].object 3AA3
Object: TagInstance = 0x00003AA3

tags.dat\0x3A0E.> setfield SandboxGoalObjects[14].object 3AA4
Object: TagInstance = 0x00003AA4

tags.dat\0x3A0E.> setfield SandboxGoalObjects[15].object 3A14
Object: TagInstance = 0x00003A14

tags.dat\0x3A0E.> setfield SandboxGoalObjects[16].object 3A15
Object: TagInstance = 0x00003A15

tags.dat\0x3A0E.> setfield SandboxGoalObjects[17].object 3A16
Object: TagInstance = 0x00003A16

tags.dat\0x3A0E.> setfield SandboxGoalObjects[18].object 3A17
Object: TagInstance = 0x00003A17

tags.dat\0x3A0E.> 

tags.dat\0x3A0E.> 

tags.dat\0x3A0E.> setfield SandboxGoalObjects[9].name Diamondback_Gravitylift1
Name: StringID = Diamondback_Gravitylift1

tags.dat\0x3A0E.> setfield SandboxGoalObjects[10].name Diamondback_Gravitylift2
Name: StringID = Diamondback_Gravitylift2

tags.dat\0x3A0E.> setfield SandboxGoalObjects[11].name Diamondback_Gravitylift3
Name: StringID = Diamondback_Gravitylift3

tags.dat\0x3A0E.> setfield SandboxGoalObjects[12].name Diamondback_Gravitylift4
Name: StringID = Diamondback_Gravitylift4

tags.dat\0x3A0E.> setfield SandboxGoalObjects[13].name Diamondback_Gravitylift5
Name: StringID = Diamondback_Gravitylift5

tags.dat\0x3A0E.> setfield SandboxGoalObjects[14].name Diamondback_Gravitylift6
Name: StringID = Diamondback_Gravitylift6

tags.dat\0x3A0E.> setfield SandboxGoalObjects[15].name narrows_iceicle 
Name: StringID = narrows_iceicle

tags.dat\0x3A0E.> setfield SandboxGoalObjects[16].name narrows_miceicle
Name: StringID = narrows_miceicle

tags.dat\0x3A0E.> setfield SandboxGoalObjects[17].name narrows_iceicle2
Name: StringID = narrows_iceicle2

tags.dat\0x3A0E.> setfield SandboxGoalObjects[18].name Diamondback_Crack
Name: StringID = Diamondback_Crack

tags.dat\0x3A0E.> 

tags.dat\0x3A0E.> 

tags.dat\0x3A0E.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x3A0E.> setfield sandboxScenery[48].name box_s
Name: StringID = box_s

tags.dat\0x3A0E.> setfield sandboxScenery[49].name box_m
Name: StringID = box_m

tags.dat\0x3A0E.> setfield sandboxScenery[50].name box_l
Name: StringID = box_l

tags.dat\0x3A0E.> setfield sandboxScenery[51].name box_xl
Name: StringID = box_xl

tags.dat\0x3A0E.> setfield sandboxScenery[52].name box_xxl
Name: StringID = box_xxl

tags.dat\0x3A0E.> setfield sandboxScenery[53].name wall_s
Name: StringID = wall_s

tags.dat\0x3A0E.> setfield sandboxScenery[54].name wall_m
Name: StringID = wall_m

tags.dat\0x3A0E.> setfield sandboxScenery[55].name wall_l
Name: StringID = wall_l

tags.dat\0x3A0E.> setfield sandboxScenery[56].name wall_xl
Name: StringID = wall_xl

tags.dat\0x3A0E.> setfield sandboxScenery[57].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x3A0E.> setfield SandboxScenery[58].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x3A0E.> setfield SandboxScenery[59].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x3A0E.> setfield SandboxScenery[60].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x3A0E.> 

tags.dat\0x3A0E.> savechanges
Done!

tags.dat\0x3A0E.> exit

tags.dat> 

tags.dat> echo   edit the scnr of Reactor
edit the scnr of Reactor 
tags.dat> edit 3F83
Tag 0x00003F83. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3F83.> echo   This command "removefrom sandboxScenery 48 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 48 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x3F83.> removefrom sandboxScenery 48 *
Successfully removed 13 elements from SandboxScenery at index 48: List`1<SandboxObject>
{...}[48]

tags.dat\0x3F83.> 

tags.dat\0x3F83.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x3F83.> addto sandboxScenery 13
Successfully added 13 elements to SandboxScenery: List`1<SandboxObject>
{...}[61]

tags.dat\0x3F83.> setfield SandboxScenery[48].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x3F83.> setfield SandboxScenery[49].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x3F83.> setfield SandboxScenery[50].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x3F83.> setfield SandboxScenery[51].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x3F83.> setfield SandboxScenery[52].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x3F83.> setfield SandboxScenery[53].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x3F83.> setfield SandboxScenery[54].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x3F83.> setfield SandboxScenery[55].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x3F83.> setfield SandboxScenery[56].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x3F83.> setfield SandboxScenery[57].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x3F83.> setfield SandboxScenery[58].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x3F83.> setfield SandboxScenery[59].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x3F83.> setfield SandboxScenery[60].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x3F83.> 

tags.dat\0x3F83.> removefrom sandboxGoalObjects 9 *
Successfully removed 4 elements from SandboxGoalObjects at index 9: List`1<SandboxObject>
{...}[9]

tags.dat\0x3F83.> addto sandboxGoalObjects 4
Successfully added 4 elements to SandboxGoalObjects: List`1<SandboxObject>
{...}[13]

tags.dat\0x3F83.> setfield SandboxGoalObjects[9].object 27C7
Object: TagInstance = 0x000027C7

tags.dat\0x3F83.> setfield SandboxGoalObjects[10].object 3F8A
Object: TagInstance = 0x00003F8A

tags.dat\0x3F83.> setfield SandboxGoalObjects[11].object 3F8B
Object: TagInstance = 0x00003F8B

tags.dat\0x3F83.> setfield SandboxGoalObjects[12].object 3F8C
Object: TagInstance = 0x00003F8C

tags.dat\0x3F83.> 

tags.dat\0x3F83.> setfield SandboxGoalObjects[9].name pit_pelican
Name: StringID = pit_pelican

tags.dat\0x3F83.> setfield SandboxGoalObjects[10].name reactor_redlight
Name: StringID = reactor_redlight

tags.dat\0x3F83.> setfield SandboxGoalObjects[11].name reactor_bluelight 
Name: StringID = reactor_bluelight

tags.dat\0x3F83.> setfield SandboxGoalObjects[12].name reactor_yellowlight
Name: StringID = reactor_yellowlight

tags.dat\0x3F83.> 

tags.dat\0x3F83.> 

tags.dat\0x3F83.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x3F83.> setfield sandboxScenery[48].name box_s
Name: StringID = box_s

tags.dat\0x3F83.> setfield sandboxScenery[49].name box_m
Name: StringID = box_m

tags.dat\0x3F83.> setfield sandboxScenery[50].name box_l
Name: StringID = box_l

tags.dat\0x3F83.> setfield sandboxScenery[51].name box_xl
Name: StringID = box_xl

tags.dat\0x3F83.> setfield sandboxScenery[52].name box_xxl
Name: StringID = box_xxl

tags.dat\0x3F83.> setfield sandboxScenery[53].name wall_s
Name: StringID = wall_s

tags.dat\0x3F83.> setfield sandboxScenery[54].name wall_m
Name: StringID = wall_m

tags.dat\0x3F83.> setfield sandboxScenery[55].name wall_l
Name: StringID = wall_l

tags.dat\0x3F83.> setfield sandboxScenery[56].name wall_xl
Name: StringID = wall_xl

tags.dat\0x3F83.> setfield sandboxScenery[57].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x3F83.> setfield SandboxScenery[58].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x3F83.> setfield SandboxScenery[59].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x3F83.> setfield SandboxScenery[60].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x3F83.> 

tags.dat\0x3F83.> savechanges
Done!

tags.dat\0x3F83.> exit

tags.dat> 

tags.dat> echo   edit the scnr of Turf
edit the scnr of Turf 
tags.dat> edit 41E4
Tag 0x000041E4. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x41E4.> echo   This command "removefrom sandboxScenery 48 *" will remove any new tagblocks added by previous installations, so that they don't stack up.
This command removefrom sandboxScenery 48 * will remove any new tagblocks added by previous installations, so that they don't stack up. 
tags.dat\0x41E4.> removefrom sandboxScenery 48 *
Successfully removed 13 elements from SandboxScenery at index 48: List`1<SandboxObject>
{...}[48]

tags.dat\0x41E4.> 

tags.dat\0x41E4.> echo  Adds 10 entrys to the scenery forge menu
Adds 10 entrys to the scenery forge menu 
tags.dat\0x41E4.> addto sandboxScenery 13
Successfully added 13 elements to SandboxScenery: List`1<SandboxObject>
{...}[61]

tags.dat\0x41E4.> setfield SandboxScenery[48].object 2EE9
Object: TagInstance = 0x00002EE9

tags.dat\0x41E4.> setfield SandboxScenery[49].object 2EEA
Object: TagInstance = 0x00002EEA

tags.dat\0x41E4.> setfield SandboxScenery[50].object 2EEB
Object: TagInstance = 0x00002EEB

tags.dat\0x41E4.> setfield SandboxScenery[51].object 2EEC
Object: TagInstance = 0x00002EEC

tags.dat\0x41E4.> setfield SandboxScenery[52].object 2EED
Object: TagInstance = 0x00002EED

tags.dat\0x41E4.> setfield SandboxScenery[53].object 2EEE
Object: TagInstance = 0x00002EEE

tags.dat\0x41E4.> setfield SandboxScenery[54].object 2EEF
Object: TagInstance = 0x00002EEF

tags.dat\0x41E4.> setfield SandboxScenery[55].object 2EF0
Object: TagInstance = 0x00002EF0

tags.dat\0x41E4.> setfield SandboxScenery[56].object 2EF1
Object: TagInstance = 0x00002EF1

tags.dat\0x41E4.> setfield SandboxScenery[57].object 2EF2
Object: TagInstance = 0x00002EF2

tags.dat\0x41E4.> setfield SandboxScenery[58].object 29ED
Object: TagInstance = 0x000029ED

tags.dat\0x41E4.> setfield SandboxScenery[59].object 29EC
Object: TagInstance = 0x000029EC

tags.dat\0x41E4.> setfield SandboxScenery[60].object 3743
Object: TagInstance = 0x00003743

tags.dat\0x41E4.> 

tags.dat\0x41E4.> removefrom sandboxGoalObjects 9 *
Successfully removed 7 elements from SandboxGoalObjects at index 9: List`1<SandboxObject>
{...}[9]

tags.dat\0x41E4.> addto sandboxGoalObjects 7
Successfully added 7 elements to SandboxGoalObjects: List`1<SandboxObject>
{...}[16]

tags.dat\0x41E4.> setfield SandboxGoalObjects[9].object 41E9
Object: TagInstance = 0x000041E9

tags.dat\0x41E4.> setfield SandboxGoalObjects[10].object 3A14
Object: TagInstance = 0x00003A14

tags.dat\0x41E4.> setfield SandboxGoalObjects[11].object 3A15
Object: TagInstance = 0x00003A15

tags.dat\0x41E4.> setfield SandboxGoalObjects[12].object 3A16
Object: TagInstance = 0x00003A16

tags.dat\0x41E4.> setfield SandboxGoalObjects[13].object 41EA
Object: TagInstance = 0x000041EA

tags.dat\0x41E4.> setfield SandboxGoalObjects[14].object 41ED
Object: TagInstance = 0x000041ED

tags.dat\0x41E4.> setfield SandboxGoalObjects[15].object 41EF
Object: TagInstance = 0x000041EF

tags.dat\0x41E4.> 

tags.dat\0x41E4.> setfield SandboxGoalObjects[9].name narrows_iceicle 
Name: StringID = narrows_iceicle

tags.dat\0x41E4.> setfield sandboxGoalObjects[10].name narrows_miceicle
Name: StringID = narrows_miceicle

tags.dat\0x41E4.> setfield sandboxGoalObjects[11].name narrows_iceicle2 
Name: StringID = narrows_iceicle2

tags.dat\0x41E4.> setfield sandboxGoalObjects[12].name narrows_iceicle3
Name: StringID = narrows_iceicle3

tags.dat\0x41E4.> setfield sandboxGoalObjects[13].name turf_Antenna
Name: StringID = turf_Antenna

tags.dat\0x41E4.> setfield sandboxGoalObjects[14].name turf_metalbox
Name: StringID = turf_metalbox

tags.dat\0x41E4.> setfield sandboxGoalObjects[15].name turf_hornet
Name: StringID = turf_hornet

tags.dat\0x41E4.> 

tags.dat\0x41E4.> 

tags.dat\0x41E4.> 

tags.dat\0x41E4.> echo  This changes the name field to the appropriate stringID so they appear correct in the forge menu
This changes the name field to the appropriate stringID so they appear correct in the forge menu 
tags.dat\0x41E4.> setfield sandboxScenery[48].name box_s
Name: StringID = box_s

tags.dat\0x41E4.> setfield sandboxScenery[49].name box_m
Name: StringID = box_m

tags.dat\0x41E4.> setfield sandboxScenery[50].name box_l
Name: StringID = box_l

tags.dat\0x41E4.> setfield sandboxScenery[51].name box_xl
Name: StringID = box_xl

tags.dat\0x41E4.> setfield sandboxScenery[52].name box_xxl
Name: StringID = box_xxl

tags.dat\0x41E4.> setfield sandboxScenery[53].name wall_s
Name: StringID = wall_s

tags.dat\0x41E4.> setfield sandboxScenery[54].name wall_m
Name: StringID = wall_m

tags.dat\0x41E4.> setfield sandboxScenery[55].name wall_l
Name: StringID = wall_l

tags.dat\0x41E4.> setfield sandboxScenery[56].name wall_xl
Name: StringID = wall_xl

tags.dat\0x41E4.> setfield sandboxScenery[57].name wall_xxl
Name: StringID = wall_xxl

tags.dat\0x41E4.> setfield SandboxScenery[58].name Gauss_Turret 
Name: StringID = Gauss_Turret

tags.dat\0x41E4.> setfield SandboxScenery[59].name Chaingun_Turret
Name: StringID = Chaingun_Turret

tags.dat\0x41E4.> setfield SandboxScenery[60].name Wraith_Turret
Name: StringID = Wraith_Turret

tags.dat\0x41E4.> 

tags.dat\0x41E4.> savechanges
Done!

tags.dat\0x41E4.> exit

tags.dat> 

tags.dat> edit 157B
Tag 0x0000157B. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x157B.> echo  editing sandbox propities menu
editing sandbox propities menu 
tags.dat\0x157B.> 

tags.dat\0x157B.> removefrom sandboxTextValuepairs[1].textvalueparis 2 *
Successfully removed 5 elements from TextValueParis at index 2: List`1<TextValuePari>
{...}[2]

tags.dat\0x157B.> addto sandboxTextValuepairs[1].textvalueparis 5
Successfully added 5 elements to TextValueParis: List`1<TextValuePari>
{...}[7]

tags.dat\0x157B.> setfield sandboxTextValuepairs[1].TextValueParis[2].intValue 2
IntValue: Int32 = 2

tags.dat\0x157B.> setfield sandboxTextValuepairs[1].TextValueParis[3].intValue 3
IntValue: Int32 = 3

tags.dat\0x157B.> setfield sandboxTextValuepairs[1].TextValueParis[4].intValue 4
IntValue: Int32 = 4

tags.dat\0x157B.> setfield sandboxTextValuepairs[1].TextValueParis[5].intValue 5
IntValue: Int32 = 5

tags.dat\0x157B.> setfield sandboxTextValuepairs[1].TextValueParis[6].intValue 10
IntValue: Int32 = 10

tags.dat\0x157B.> 

tags.dat\0x157B.> removefrom sandboxTextValuepairs[3].textvalueparis 10 *
Successfully removed 11 elements from TextValueParis at index 10: List`1<TextValuePari>
{...}[10]

tags.dat\0x157B.> addto sandboxTextValuepairs[3].textvalueparis 11
Successfully added 11 elements to TextValueParis: List`1<TextValuePari>
{...}[21]

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[11].intValue 11
IntValue: Int32 = 11

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[12].intValue 12
IntValue: Int32 = 12

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[13].intValue 13
IntValue: Int32 = 13

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[14].intValue 14
IntValue: Int32 = 14

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[15].intValue 15
IntValue: Int32 = 15

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[16].intValue 16
IntValue: Int32 = 16

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[17].intValue 17
IntValue: Int32 = 17

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[18].intValue 18
IntValue: Int32 = 18

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[19].intValue 19
IntValue: Int32 = 19

tags.dat\0x157B.> setfield sandboxTextValuepairs[3].TextValueParis[20].intValue 20
IntValue: Int32 = 20

tags.dat\0x157B.> savechanges
Done!

tags.dat\0x157B.> exit

tags.dat> 

tags.dat> edit 29ED
Tag 0x000029ED. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x29ED.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x29ED.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x29ED.> savechanges
Done!

tags.dat\0x29ED.> exit

tags.dat> 

tags.dat> edit 29EC
Tag 0x000029EC. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x29EC.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x29EC.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x29EC.> savechanges
Done!

tags.dat\0x29EC.> exit

tags.dat> 

tags.dat> edit 3743
Tag 0x00003743. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3743.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3743.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3743.> savechanges
Done!

tags.dat\0x3743.> exit

tags.dat> 

tags.dat> echo making objects on last resort editable 
making objects on last resort editable 
tags.dat> edit 51C7
Tag 0x000051C7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x51C7.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x51C7.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x51C7.> savechanges
Done!

tags.dat\0x51C7.> exit

tags.dat> 

tags.dat> edit 5210
Tag 0x00005210. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5210.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5210.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5210.> savechanges
Done!

tags.dat\0x5210.> exit

tags.dat> 

tags.dat> edit 51FD
Tag 0x000051FD. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x51FD.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x51FD.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x51FD.> savechanges
Done!

tags.dat\0x51FD.> exit

tags.dat> 

tags.dat> edit 51EA
Tag 0x000051EA. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x51EA.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x51EA.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x51EA.> savechanges
Done!

tags.dat\0x51EA.> exit

tags.dat> 

tags.dat> edit 521A
Tag 0x0000521A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x521A.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x521A.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x521A.> savechanges
Done!

tags.dat\0x521A.> exit

tags.dat> 

tags.dat> edit 5225
Tag 0x00005225. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5225.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5225.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5225.> savechanges
Done!

tags.dat\0x5225.> exit

tags.dat> 

tags.dat> edit 522A
Tag 0x0000522A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x522A.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x522A.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x522A.> savechanges
Done!

tags.dat\0x522A.> exit

tags.dat> 

tags.dat> edit 5239
Tag 0x00005239. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5239.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5239.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5239.> savechanges
Done!

tags.dat\0x5239.> exit

tags.dat> 

tags.dat> edit 50E0
Tag 0x000050E0. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50E0.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50E0.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50E0.> savechanges
Done!

tags.dat\0x50E0.> exit

tags.dat> 

tags.dat> edit 3492
Tag 0x00003492. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3492.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3492.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3492.> savechanges
Done!

tags.dat\0x3492.> exit

tags.dat> 

tags.dat> edit 3493
Tag 0x00003493. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3493.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3493.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3493.> savechanges
Done!

tags.dat\0x3493.> exit

tags.dat> 

tags.dat> edit 50E9
Tag 0x000050E9. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50E9.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50E9.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50E9.> savechanges
Done!

tags.dat\0x50E9.> exit

tags.dat> 

tags.dat> edit 50EE
Tag 0x000050EE. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50EE.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50EE.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50EE.> savechanges
Done!

tags.dat\0x50EE.> exit

tags.dat> 

tags.dat> edit 50F3
Tag 0x000050F3. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50F3.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50F3.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50F3.> savechanges
Done!

tags.dat\0x50F3.> exit

tags.dat> 

tags.dat> edit 50F8
Tag 0x000050F8. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50F8.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50F8.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50F8.> savechanges
Done!

tags.dat\0x50F8.> exit

tags.dat> 

tags.dat> edit 50FD
Tag 0x000050FD. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50FD.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50FD.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50FD.> savechanges
Done!

tags.dat\0x50FD.> exit

tags.dat> 

tags.dat> edit 5102
Tag 0x00005102. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5102.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5102.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5102.> savechanges
Done!

tags.dat\0x5102.> exit

tags.dat> 

tags.dat> edit 510E
Tag 0x0000510E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x510E.> removefrom multiplayerObjectProperties 0 *
ERROR: Object reference not set to an instance of an object.

tags.dat\0x510E.> addto multiplayerObjectProperties
ERROR: Object reference not set to an instance of an object.

tags.dat\0x510E.> savechanges
Done!

tags.dat\0x510E.> exit

tags.dat> 

tags.dat> edit 511D
Tag 0x0000511D. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x511D.> removefrom multiplayerObjectProperties 0 *
ERROR: Object reference not set to an instance of an object.

tags.dat\0x511D.> addto multiplayerObjectProperties
ERROR: Object reference not set to an instance of an object.

tags.dat\0x511D.> savechanges
Done!

tags.dat\0x511D.> exit

tags.dat> 

tags.dat> edit 5230
Tag 0x00005230. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5230.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5230.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5230.> savechanges
Done!

tags.dat\0x5230.> exit

tags.dat> 

tags.dat> 

tags.dat> echo making objects on last resort editable 
making objects on last resort editable 
tags.dat> 

tags.dat> edit 48EF
Tag 0x000048EF. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x48EF.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x48EF.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x48EF.> savechanges
Done!

tags.dat\0x48EF.> exit

tags.dat> 

tags.dat> edit 4904
Tag 0x00004904. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4904.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4904.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4904.> savechanges
Done!

tags.dat\0x4904.> exit

tags.dat> 

tags.dat> edit 490E
Tag 0x0000490E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x490E.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x490E.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x490E.> savechanges
Done!

tags.dat\0x490E.> exit

tags.dat> 

tags.dat> edit 4918
Tag 0x00004918. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4918.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4918.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4918.> savechanges
Done!

tags.dat\0x4918.> exit

tags.dat> 

tags.dat> edit 4923
Tag 0x00004923. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4923.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4923.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4923.> savechanges
Done!

tags.dat\0x4923.> exit

tags.dat> 

tags.dat> edit 492F
Tag 0x0000492F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x492F.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x492F.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x492F.> savechanges
Done!

tags.dat\0x492F.> exit

tags.dat> 

tags.dat> edit 4934
Tag 0x00004934. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4934.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4934.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4934.> savechanges
Done!

tags.dat\0x4934.> exit

tags.dat> 

tags.dat> edit 4950
Tag 0x00004950. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4950.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4950.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4950.> savechanges
Done!

tags.dat\0x4950.> exit

tags.dat> 

tags.dat> edit 49B1
Tag 0x000049B1. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x49B1.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x49B1.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x49B1.> savechanges
Done!

tags.dat\0x49B1.> exit

tags.dat> 

tags.dat> edit 49C3
Tag 0x000049C3. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x49C3.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x49C3.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x49C3.> savechanges
Done!

tags.dat\0x49C3.> exit

tags.dat> 

tags.dat> edit 49DE
Tag 0x000049DE. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x49DE.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x49DE.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x49DE.> savechanges
Done!

tags.dat\0x49DE.> exit

tags.dat> 

tags.dat> edit 4703
Tag 0x00004703. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4703.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4703.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4703.> savechanges
Done!

tags.dat\0x4703.> exit

tags.dat> 

tags.dat> edit 4608
Tag 0x00004608. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4608.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4608.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4608.> savechanges
Done!

tags.dat\0x4608.> exit

tags.dat> 

tags.dat> edit 4686
Tag 0x00004686. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4686.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4686.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4686.> savechanges
Done!

tags.dat\0x4686.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 469F
Tag 0x0000469F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x469F.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x469F.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x469F.> savechanges
Done!

tags.dat\0x469F.> exit

tags.dat> 

tags.dat> edit 46D0
Tag 0x000046D0. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46D0.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x46D0.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46D0.> savechanges
Done!

tags.dat\0x46D0.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 461D
Tag 0x0000461D. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x461D.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x461D.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x461D.> savechanges
Done!

tags.dat\0x461D.> exit

tags.dat> 

tags.dat> edit 4628
Tag 0x00004628. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4628.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4628.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4628.> savechanges
Done!

tags.dat\0x4628.> exit

tags.dat> 

tags.dat> edit 4632
Tag 0x00004632. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4632.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4632.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4632.> savechanges
Done!

tags.dat\0x4632.> exit

tags.dat> 

tags.dat> edit 463D
Tag 0x0000463D. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x463D.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x463D.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x463D.> savechanges
Done!

tags.dat\0x463D.> exit

tags.dat> 

tags.dat> edit 4643
Tag 0x00004643. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4643.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4643.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4643.> savechanges
Done!

tags.dat\0x4643.> exit

tags.dat> 

tags.dat> edit 4662
Tag 0x00004662. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4662.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4662.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4662.> savechanges
Done!

tags.dat\0x4662.> exit

tags.dat> 

tags.dat> edit 46BE
Tag 0x000046BE. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46BE.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x46BE.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46BE.> savechanges
Done!

tags.dat\0x46BE.> exit

tags.dat> 

tags.dat> edit 46C7
Tag 0x000046C7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46C7.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x46C7.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46C7.> savechanges
Done!

tags.dat\0x46C7.> exit

tags.dat> 

tags.dat> edit 46CF
Tag 0x000046CF. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46CF.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x46CF.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46CF.> savechanges
Done!

tags.dat\0x46CF.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 46A4
Tag 0x000046A4. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x46A4.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x46A4.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x46A4.> savechanges
Done!

tags.dat\0x46A4.> exit

tags.dat> 

tags.dat> 

tags.dat> 

tags.dat> echo narrows
narrows 
tags.dat> 

tags.dat> edit 4B5E
Tag 0x00004B5E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B5E.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4B5E.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B5E.> savechanges
Done!

tags.dat\0x4B5E.> exit

tags.dat> 

tags.dat> edit 4B76
Tag 0x00004B76. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B76.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4B76.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B76.> savechanges
Done!

tags.dat\0x4B76.> exit

tags.dat> 

tags.dat> edit 4BC8
Tag 0x00004BC8. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4BC8.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4BC8.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4BC8.> savechanges
Done!

tags.dat\0x4BC8.> exit

tags.dat> 

tags.dat> edit 3E0B
Tag 0x00003E0B. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3E0B.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3E0B.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3E0B.> savechanges
Done!

tags.dat\0x3E0B.> exit

tags.dat> 

tags.dat> edit 4B4D
Tag 0x00004B4D. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B4D.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4B4D.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B4D.> savechanges
Done!

tags.dat\0x4B4D.> exit

tags.dat> 

tags.dat> edit 4B4E
Tag 0x00004B4E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B4E.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4B4E.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B4E.> savechanges
Done!

tags.dat\0x4B4E.> exit

tags.dat> 

tags.dat> edit 4B70
Tag 0x00004B70. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B70.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4B70.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B70.> savechanges
Done!

tags.dat\0x4B70.> exit

tags.dat> 

tags.dat> edit 4B7B
Tag 0x00004B7B. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4B7B.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4B7B.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4B7B.> savechanges
Done!

tags.dat\0x4B7B.> exit

tags.dat> 

tags.dat> edit 3E0C
Tag 0x00003E0C. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3E0C.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3E0C.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3E0C.> savechanges
Done!

tags.dat\0x3E0C.> exit

tags.dat> 

tags.dat> edit 3495
Tag 0x00003495. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3495.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3495.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3495.> savechanges
Done!

tags.dat\0x3495.> exit

tags.dat> 

tags.dat> echo making items on standoff editable
making items on standoff editable 
tags.dat> 

tags.dat> edit 4EF5
Tag 0x00004EF5. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4EF5.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4EF5.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4EF5.> savechanges
Done!

tags.dat\0x4EF5.> exit

tags.dat> 

tags.dat> edit 4F04
Tag 0x00004F04. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4F04.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4F04.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4F04.> savechanges
Done!

tags.dat\0x4F04.> exit

tags.dat> 

tags.dat> edit 4F09
Tag 0x00004F09. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4F09.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4F09.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4F09.> savechanges
Done!

tags.dat\0x4F09.> exit

tags.dat> 

tags.dat> edit 4D16
Tag 0x00004D16. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D16.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D16.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D16.> savechanges
Done!

tags.dat\0x4D16.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 4D20
Tag 0x00004D20. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D20.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D20.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D20.> savechanges
Done!

tags.dat\0x4D20.> exit

tags.dat> 

tags.dat> edit 4D44
Tag 0x00004D44. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D44.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D44.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D44.> savechanges
Done!

tags.dat\0x4D44.> exit

tags.dat> 

tags.dat> edit 4D46
Tag 0x00004D46. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D46.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D46.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D46.> savechanges
Done!

tags.dat\0x4D46.> exit

tags.dat> 

tags.dat> edit 4D4F
Tag 0x00004D4F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D4F.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D4F.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D4F.> savechanges
Done!

tags.dat\0x4D4F.> exit

tags.dat> 

tags.dat> edit 4D54
Tag 0x00004D54. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D54.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D54.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D54.> savechanges
Done!

tags.dat\0x4D54.> exit

tags.dat> 

tags.dat> edit 4D59
Tag 0x00004D59. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D59.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D59.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D59.> savechanges
Done!

tags.dat\0x4D59.> exit

tags.dat> 

tags.dat> edit 4D6A
Tag 0x00004D6A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D6A.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D6A.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D6A.> savechanges
Done!

tags.dat\0x4D6A.> exit

tags.dat> 

tags.dat> edit 4D78
Tag 0x00004D78. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D78.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D78.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D78.> savechanges
Done!

tags.dat\0x4D78.> exit

tags.dat> 

tags.dat> edit 4D8C
Tag 0x00004D8C. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D8C.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D8C.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D8C.> savechanges
Done!

tags.dat\0x4D8C.> exit

tags.dat> 

tags.dat> edit 4D9A
Tag 0x00004D9A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4D9A.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4D9A.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4D9A.> savechanges
Done!

tags.dat\0x4D9A.> exit

tags.dat> 

tags.dat> edit 4DA6
Tag 0x00004DA6. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4DA6.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4DA6.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4DA6.> savechanges
Done!

tags.dat\0x4DA6.> exit

tags.dat> 

tags.dat> edit 4DA7
Tag 0x00004DA7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4DA7.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4DA7.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4DA7.> savechanges
Done!

tags.dat\0x4DA7.> exit

tags.dat> 

tags.dat> echo making items on highground editable
making items on highground editable 
tags.dat> 

tags.dat> edit 5495
Tag 0x00005495. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5495.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5495.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5495.> savechanges
Done!

tags.dat\0x5495.> exit

tags.dat> 

tags.dat> edit 54A2
Tag 0x000054A2. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54A2.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x54A2.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54A2.> savechanges
Done!

tags.dat\0x54A2.> exit

tags.dat> 

tags.dat> edit 54AB
Tag 0x000054AB. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54AB.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x54AB.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54AB.> savechanges
Done!

tags.dat\0x54AB.> exit

tags.dat> 

tags.dat> edit 54C7
Tag 0x000054C7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54C7.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x54C7.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54C7.> savechanges
Done!

tags.dat\0x54C7.> exit

tags.dat> 

tags.dat> edit 54CC
Tag 0x000054CC. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54CC.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x54CC.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54CC.> savechanges
Done!

tags.dat\0x54CC.> exit

tags.dat> 

tags.dat> edit 54D1
Tag 0x000054D1. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54D1.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x54D1.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54D1.> savechanges
Done!

tags.dat\0x54D1.> exit

tags.dat> 

tags.dat> edit 54D7
Tag 0x000054D7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x54D7.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x54D7.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x54D7.> savechanges
Done!

tags.dat\0x54D7.> exit

tags.dat> 

tags.dat> edit 53A2
Tag 0x000053A2. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x53A2.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x53A2.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x53A2.> savechanges
Done!

tags.dat\0x53A2.> exit

tags.dat> 

tags.dat> edit 348E
Tag 0x0000348E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x348E.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x348E.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x348E.> savechanges
Done!

tags.dat\0x348E.> exit

tags.dat> 

tags.dat> edit 5324
Tag 0x00005324. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5324.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5324.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5324.> savechanges
Done!

tags.dat\0x5324.> exit

tags.dat> 

tags.dat> edit 4608
Tag 0x00004608. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x4608.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x4608.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x4608.> savechanges
Done!

tags.dat\0x4608.> exit

tags.dat> 

tags.dat> edit 532B
Tag 0x0000532B. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x532B.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x532B.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x532B.> savechanges
Done!

tags.dat\0x532B.> exit

tags.dat> 

tags.dat> edit 535F
Tag 0x0000535F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x535F.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x535F.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x535F.> savechanges
Done!

tags.dat\0x535F.> exit

tags.dat> 

tags.dat> echo making items editable on sandtrap
making items editable on sandtrap 
tags.dat> 

tags.dat> edit 56F5
Tag 0x000056F5. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x56F5.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x56F5.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x56F5.> savechanges
Done!

tags.dat\0x56F5.> exit

tags.dat> 

tags.dat> edit 569E
Tag 0x0000569E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x569E.> removefrom multiplayerObjectProperties 0 *
ERROR: Object reference not set to an instance of an object.

tags.dat\0x569E.> addto multiplayerObjectProperties
ERROR: Object reference not set to an instance of an object.

tags.dat\0x569E.> savechanges
Done!

tags.dat\0x569E.> exit

tags.dat> 

tags.dat> edit 50EE
Tag 0x000050EE. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50EE.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50EE.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50EE.> savechanges
Done!

tags.dat\0x50EE.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 55A8
Tag 0x000055A8. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x55A8.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x55A8.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x55A8.> savechanges
Done!

tags.dat\0x55A8.> exit

tags.dat> 

tags.dat> edit 50F8
Tag 0x000050F8. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50F8.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50F8.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50F8.> savechanges
Done!

tags.dat\0x50F8.> exit

tags.dat> 

tags.dat> edit 50FD
Tag 0x000050FD. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50FD.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50FD.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50FD.> savechanges
Done!

tags.dat\0x50FD.> exit

tags.dat> 

tags.dat> edit 50E9
Tag 0x000050E9. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x50E9.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x50E9.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x50E9.> savechanges
Done!

tags.dat\0x50E9.> exit

tags.dat> 

tags.dat> edit 55E6
Tag 0x000055E6. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x55E6.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x55E6.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x55E6.> savechanges
Done!

tags.dat\0x55E6.> exit

tags.dat> 

tags.dat> edit 55F0
Tag 0x000055F0. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x55F0.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x55F0.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x55F0.> savechanges
Done!

tags.dat\0x55F0.> exit

tags.dat> 

tags.dat> edit 55FB
Tag 0x000055FB. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x55FB.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x55FB.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x55FB.> savechanges
Done!

tags.dat\0x55FB.> exit

tags.dat> 

tags.dat> edit 5600
Tag 0x00005600. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5600.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5600.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5600.> savechanges
Done!

tags.dat\0x5600.> exit

tags.dat> 

tags.dat> edit 5605
Tag 0x00005605. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5605.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5605.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5605.> savechanges
Done!

tags.dat\0x5605.> exit

tags.dat> 

tags.dat> edit 560A
Tag 0x0000560A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x560A.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x560A.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x560A.> savechanges
Done!

tags.dat\0x560A.> exit

tags.dat> 

tags.dat> edit 560F
Tag 0x0000560F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x560F.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x560F.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x560F.> savechanges
Done!

tags.dat\0x560F.> exit

tags.dat> 

tags.dat> edit 5614
Tag 0x00005614. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5614.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5614.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5614.> savechanges
Done!

tags.dat\0x5614.> exit

tags.dat> 

tags.dat> edit 560A
Tag 0x0000560A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x560A.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x560A.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x560A.> savechanges
Done!

tags.dat\0x560A.> exit

tags.dat> 

tags.dat> edit 5619
Tag 0x00005619. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5619.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5619.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5619.> savechanges
Done!

tags.dat\0x5619.> exit

tags.dat> 

tags.dat> edit 561E
Tag 0x0000561E. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x561E.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x561E.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x561E.> savechanges
Done!

tags.dat\0x561E.> exit

tags.dat> 

tags.dat> edit 5623
Tag 0x00005623. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5623.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x5623.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x5623.> savechanges
Done!

tags.dat\0x5623.> exit

tags.dat> 

tags.dat> echo making items editable on Guardian
making items editable on Guardian 
tags.dat> 

tags.dat> edit 2ED9
Tag 0x00002ED9. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2ED9.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2ED9.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2ED9.> savechanges
Done!

tags.dat\0x2ED9.> exit

tags.dat> 

tags.dat> edit 2EDA
Tag 0x00002EDA. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EDA.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EDA.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EDA.> savechanges
Done!

tags.dat\0x2EDA.> exit

tags.dat> 

tags.dat> edit 2EDB
Tag 0x00002EDB. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EDB.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EDB.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EDB.> savechanges
Done!

tags.dat\0x2EDB.> exit

tags.dat> 

tags.dat> edit 2EDD
Tag 0x00002EDD. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EDD.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EDD.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EDD.> savechanges
Done!

tags.dat\0x2EDD.> exit

tags.dat> 

tags.dat> edit 2ED9
Tag 0x00002ED9. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2ED9.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2ED9.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2ED9.> savechanges
Done!

tags.dat\0x2ED9.> exit

tags.dat> 

tags.dat> edit 2EDA
Tag 0x00002EDA. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EDA.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EDA.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EDA.> savechanges
Done!

tags.dat\0x2EDA.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 2EDB
Tag 0x00002EDB. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EDB.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EDB.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EDB.> savechanges
Done!

tags.dat\0x2EDB.> exit

tags.dat> 

tags.dat> edit 2EDD
Tag 0x00002EDD. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EDD.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EDD.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EDD.> savechanges
Done!

tags.dat\0x2EDD.> exit

tags.dat> 

tags.dat> edit 2EF5
Tag 0x00002EF5. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EF5.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EF5.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EF5.> savechanges
Done!

tags.dat\0x2EF5.> exit

tags.dat> 

tags.dat> edit 3AA7
Tag 0x00003AA7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3AA7.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3AA7.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3AA7.> savechanges
Done!

tags.dat\0x3AA7.> exit

tags.dat> 

tags.dat> edit 2EE6
Tag 0x00002EE6. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EE6.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EE6.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EE6.> savechanges
Done!

tags.dat\0x2EE6.> exit

tags.dat> 

tags.dat> edit 2EE7
Tag 0x00002EE7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EE7.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EE7.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EE7.> savechanges
Done!

tags.dat\0x2EE7.> exit

tags.dat> 

tags.dat> edit 2EE8
Tag 0x00002EE8. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EE8.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EE8.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EE8.> savechanges
Done!

tags.dat\0x2EE8.> exit

tags.dat> 

tags.dat> 

tags.dat> edit 2EA4
Tag 0x00002EA4. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EA4.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EA4.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EA4.> savechanges
Done!

tags.dat\0x2EA4.> exit

tags.dat> 

tags.dat> edit 2EA5
Tag 0x00002EA5. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2EA5.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x2EA5.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x2EA5.> savechanges
Done!

tags.dat\0x2EA5.> exit

tags.dat> 

tags.dat> 

tags.dat> echo making items editable on Diamondback
making items editable on Diamondback 
tags.dat> 

tags.dat> edit 3A9F
Tag 0x00003A9F. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3A9F.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3A9F.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3A9F.> savechanges
Done!

tags.dat\0x3A9F.> exit

tags.dat> 

tags.dat> edit 3AA0
Tag 0x00003AA0. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3AA0.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3AA0.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3AA0.> savechanges
Done!

tags.dat\0x3AA0.> exit

tags.dat> 

tags.dat> edit 3AA1
Tag 0x00003AA1. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3AA1.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3AA1.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3AA1.> savechanges
Done!

tags.dat\0x3AA1.> exit

tags.dat> 

tags.dat> edit 3AA2
Tag 0x00003AA2. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3AA2.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3AA2.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3AA2.> savechanges
Done!

tags.dat\0x3AA2.> exit

tags.dat> 

tags.dat> edit 3AA3
Tag 0x00003AA3. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3AA3.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3AA3.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3AA3.> savechanges
Done!

tags.dat\0x3AA3.> exit

tags.dat> 

tags.dat> edit 3AA4
Tag 0x00003AA4. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3AA4.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3AA4.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3AA4.> savechanges
Done!

tags.dat\0x3AA4.> exit

tags.dat> 

tags.dat> edit 3A14
Tag 0x00003A14. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3A14.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3A14.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3A14.> savechanges
Done!

tags.dat\0x3A14.> exit

tags.dat> 

tags.dat> edit 3A15
Tag 0x00003A15. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3A15.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3A15.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3A15.> savechanges
Done!

tags.dat\0x3A15.> exit

tags.dat> 

tags.dat> edit 3A16
Tag 0x00003A16. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3A16.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3A16.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3A16.> savechanges
Done!

tags.dat\0x3A16.> exit

tags.dat> 

tags.dat> edit 3A17
Tag 0x00003A17. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3A17.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3A17.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3A17.> savechanges
Done!

tags.dat\0x3A17.> exit

tags.dat> 

tags.dat> 

tags.dat> echo making items editable on reactor
making items editable on reactor 
tags.dat> 

tags.dat> edit 27C7
Tag 0x000027C7. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x27C7.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x27C7.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x27C7.> savechanges
Done!

tags.dat\0x27C7.> exit

tags.dat> 

tags.dat> edit 3F89
Tag 0x00003F89. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3F89.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3F89.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3F89.> savechanges
Done!

tags.dat\0x3F89.> exit

tags.dat> 

tags.dat> edit 3F8A
Tag 0x00003F8A. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3F8A.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3F8A.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3F8A.> savechanges
Done!

tags.dat\0x3F8A.> exit

tags.dat> 

tags.dat> edit 3F8B
Tag 0x00003F8B. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3F8B.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3F8B.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3F8B.> savechanges
Done!

tags.dat\0x3F8B.> exit

tags.dat> 

tags.dat> edit 3F8C
Tag 0x00003F8C. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x3F8C.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x3F8C.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x3F8C.> savechanges
Done!

tags.dat\0x3F8C.> exit

tags.dat> 

tags.dat> echo making items editable on turf
making items editable on turf 
tags.dat> 

tags.dat> edit 41E9
Tag 0x000041E9. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x41E9.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x41E9.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x41E9.> savechanges
Done!

tags.dat\0x41E9.> exit

tags.dat> 

tags.dat> edit 41EA
Tag 0x000041EA. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x41EA.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x41EA.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x41EA.> savechanges
Done!

tags.dat\0x41EA.> exit

tags.dat> 

tags.dat> edit 41ED
Tag 0x000041ED. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x41ED.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x41ED.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x41ED.> savechanges
Done!

tags.dat\0x41ED.> exit

tags.dat> 

tags.dat> edit 29CD
Tag 0x000029CD. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x29CD.> removefrom multiplayerObjectProperties 0 *
ERROR: Object reference not set to an instance of an object.

tags.dat\0x29CD.> addto multiplayerObjectProperties
ERROR: Object reference not set to an instance of an object.

tags.dat\0x29CD.> savechanges
Done!

tags.dat\0x29CD.> exit

tags.dat> 

tags.dat> edit 41EF
Tag 0x000041EF. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x41EF.> removefrom multiplayerObjectProperties 0 *
Successfully removed 1 element from MultiplayerObjectProperties at index 0: List`1<MultiplayerObjectProperty>
null

tags.dat\0x41EF.> addto multiplayerObjectProperties
Successfully added 1 element to MultiplayerObjectProperties: List`1<MultiplayerObjectProperty>
{...}[1]

tags.dat\0x41EF.> savechanges
Done!

tags.dat\0x41EF.> exit

tags.dat> 

tags.dat> echo making items editable on valhalla 
making items editable on valhalla 
tags.dat> 

tags.dat> edit 34EF
Tag 0x000034EF. has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x34EF.> removefrom multiplayerObjectProperties 0 *
ERROR: Object reference not set to an instance of an object.

tags.dat\0x34EF.> addto multiplayerObjectProperties
ERROR: Object reference not set to an instance of an object.
