Tag Tool [1.0.5982.3255]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23285 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 3:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> XXXX
Unrecognized command: XXXX
Use "help" to list available commands.

tags.dat> 

tags.dat> 

tags.dat> echo

tags.dat> echo

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> 1EF5
Unrecognized command: 1EF5
Use "help" to list available commands.

tags.dat> 1EF5
Unrecognized command: 1EF5
Use "help" to list available commands.

tags.dat> 1EFB
Unrecognized command: 1EFB
Use "help" to list available commands.

tags.dat> 1EFB
Unrecognized command: 1EFB
Use "help" to list available commands.

tags.dat> 1F3F
Unrecognized command: 1F3F
Use "help" to list available commands.

tags.dat> 1F3F
Unrecognized command: 1F3F
Use "help" to list available commands.

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE5
Unrecognized command: 5AE5
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE6
Unrecognized command: 5AE6
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE7
Unrecognized command: 5AE7
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE8
Unrecognized command: 5AE8
Use "help" to list available commands.

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AE9
Unrecognized command: 5AE9
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AEA
Unrecognized command: 5AEA
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AEB
Unrecognized command: 5AEB
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AEC
Unrecognized command: 5AEC
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AED
Unrecognized command: 5AED
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AEE
Unrecognized command: 5AEE
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> resourcedata import resources.dat 0108 tags/HRShotgun.raw
Failed to import resource: Le fichier 'C:\Users\PC\Desktop\ElDewrito_0.6\Halo Online\mods\tagmods\reachmods\reachShotgun\resources.dat' est introuvable.

tags.dat> 

tags.dat> importbitmap 5AE5 DDS/shotgun_diffuse.dds    
Loading textures.dat...
Importing image...
ERROR: Le processus ne peut pas accéder au fichier 'C:\Users\PC\Desktop\ElDewrito_0.6\Halo Online\maps\textures.dat', car il est en cours d'utilisation par un autre processus.

tags.dat> importbitmap 5AE6 DDS/shotgun_zbump.dds      
Loading textures.dat...
Importing image...
ERROR: Le processus ne peut pas accéder au fichier 'C:\Users\PC\Desktop\ElDewrito_0.6\Halo Online\maps\textures.dat', car il est en cours d'utilisation par un autre processus.

tags.dat> importbitmap 5AE7 DDS/shotgun_flat_illum.dds 
Loading textures.dat...
Importing image...
ERROR: Le processus ne peut pas accéder au fichier 'C:\Users\PC\Desktop\ElDewrito_0.6\Halo Online\maps\textures.dat', car il est en cours d'utilisation par un autre processus.

tags.dat> importbitmap 5AE8 DDS/unsc_decals_diffuse.dds
Loading textures.dat...
Importing image...
ERROR: Le processus ne peut pas accéder au fichier 'C:\Users\PC\Desktop\ElDewrito_0.6\Halo Online\maps\textures.dat', car il est en cours d'utilisation par un autre processus.
