Tag Tool [1.5.6823.29009]

Please report any bugs and/or feature requests at
<https://github.com/TheGuardians-CI/TagTool/issues>.

Enter "help" to list available commands. Enter "exit" to quit.

tags> Echo Setup Bitmaps
Setup Bitmaps 
tags> CreateTag bitm
[Index: 0x5D1F, Offset: 0x0629CDC0, Size: 0x00F0] 0x5D1F.bitmap

tags> NameTag * objects\weapons\rifle\dmr\bitmaps\dmr_diffuse
[Index: 0x5D1F, Offset: 0x0629CDC0, Size: 0x00F0] objects\weapons\rifle\dmr\bitmaps\dmr_diffuse.bitmap

tags> Edittag objects\weapons\rifle\dmr\bitmaps\dmr_diffuse.bitm
Tag (0x5D1F) dmr_diffuse.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D1F) dmr_diffuse.bitmap> ImportBitmap 0 Tags\Bitmaps\dmr_diffuse.dds
Importing image data...
Done!

tags\(0x5D1F) dmr_diffuse.bitmap> SaveTagChanges
Done!

tags\(0x5D1F) dmr_diffuse.bitmap> Exit

tags> 

tags> CreateTag bitm
[Index: 0x5D20, Offset: 0x0629CFC0, Size: 0x00F0] 0x5D20.bitmap

tags> NameTag * objects\weapons\rifle\dmr\bitmaps\dmr_normal
[Index: 0x5D20, Offset: 0x0629CFC0, Size: 0x00F0] objects\weapons\rifle\dmr\bitmaps\dmr_normal.bitmap

tags> Edittag objects\weapons\rifle\dmr\bitmaps\dmr_normal.bitm
Tag (0x5D20) dmr_normal.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D20) dmr_normal.bitmap> ImportBitmap 0 Tags\Bitmaps\dmr_normal.dds
Importing image data...
Done!

tags\(0x5D20) dmr_normal.bitmap> SaveTagChanges
Done!

tags\(0x5D20) dmr_normal.bitmap> Exit

tags> 

tags> CreateTag bitm
[Index: 0x5D21, Offset: 0x0629D1C0, Size: 0x00F0] 0x5D21.bitmap

tags> NameTag * objects\weapons\rifle\dmr\bitmaps\dmr_illumination_map
[Index: 0x5D21, Offset: 0x0629D1C0, Size: 0x00F0] objects\weapons\rifle\dmr\bitmaps\dmr_illumination_map.bitmap

tags> Edittag objects\weapons\rifle\dmr\bitmaps\dmr_illumination_map.bitm
Tag (0x5D21) dmr_illumination_map.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D21) dmr_illumination_map.bitmap> ImportBitmap 0 Tags\Bitmaps\dmr_illumination_map.dds
Importing image data...
Done!

tags\(0x5D21) dmr_illumination_map.bitmap> SaveTagChanges
Done!

tags\(0x5D21) dmr_illumination_map.bitmap> Exit

tags> 

tags> CreateTag bitm
[Index: 0x5D22, Offset: 0x0629D3C0, Size: 0x00F0] 0x5D22.bitmap

tags> NameTag * objects\weapons\rifle\dmr\bitmaps\unsc_decals_diffuse
[Index: 0x5D22, Offset: 0x0629D3C0, Size: 0x00F0] objects\weapons\rifle\dmr\bitmaps\unsc_decals_diffuse.bitmap

tags> Edittag objects\weapons\rifle\dmr\bitmaps\unsc_decals_diffuse.bitm
Tag (0x5D22) unsc_decals_diffuse.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D22) unsc_decals_diffuse.bitmap> ImportBitmap 0 Tags\Bitmaps\unsc_decals_diffuse.dds
Importing image data...
Done!

tags\(0x5D22) unsc_decals_diffuse.bitmap> SaveTagChanges
Done!

tags\(0x5D22) unsc_decals_diffuse.bitmap> Exit

tags> 

tags> Duplicatetag objects\weapons\rifle\dmr\fp_dmr\fp_dmr\bitmaps\[05]_rmsh\self_illum_primary_ammunition_ones.bitm 
Tag duplicated successfully!
New tag: bitm 00005D23 [Offset = 0x629D5C0, Size = 0xC50]

tags> NameTag * objects\weapons\rifle\dmr\bitmaps\dmr_numerology
[Index: 0x5D23, Offset: 0x0629D5C0, Size: 0x0C50] objects\weapons\rifle\dmr\bitmaps\dmr_numerology.bitmap

tags> EditTag objects\weapons\rifle\dmr\bitmaps\dmr_numerology.bitm
Tag (0x5D23) dmr_numerology.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 0 Tags\Bitmaps\Numerology\0.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 1 Tags\Bitmaps\Numerology\1.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 2 Tags\Bitmaps\Numerology\2.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 3 Tags\Bitmaps\Numerology\3.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 4 Tags\Bitmaps\Numerology\4.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 5 Tags\Bitmaps\Numerology\5.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 6 Tags\Bitmaps\Numerology\6.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 7 Tags\Bitmaps\Numerology\7.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 8 Tags\Bitmaps\Numerology\8.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> importbitmap 9 Tags\Bitmaps\Numerology\9.dds
Importing image data...
Done!

tags\(0x5D23) dmr_numerology.bitmap> SaveTagChanges
Done!

tags\(0x5D23) dmr_numerology.bitmap> Exit

tags> 

tags> Savetagnames

tags> 

tags> Echo // Setup Shaders
// Setup Shaders 
tags> 

tags> Duplicatetag objects\weapons\rifle\spike_rifle\fp_spike_rifle\fp_spike_rifle\shaders\[00]_rmsh.shader
Tag duplicated successfully!
New tag: rmsh 00005D24 [Offset = 0x629E1E0, Size = 0xAF0]

tags> Nametag * objects\weapons\rifle\dmr\shaders\dmr_composite
[Index: 0x5D24, Offset: 0x0629E1E0, Size: 0x0AF0] objects\weapons\rifle\dmr\shaders\dmr_composite.shader

tags> Edittag objects\weapons\rifle\dmr\shaders\dmr_composite.shader
Tag (0x5D24) dmr_composite.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D24) dmr_composite.shader> Removeblockelements ImportData 0 *
Successfully removed 16 elements from ImportData at index 0: List`1<ImportDatum>
null

tags\(0x5D24) dmr_composite.shader> SetField ShaderProperties[0].Shadermaps[0].Bitmap objects\weapons\rifle\dmr\bitmaps\dmr_diffuse.bitm
Bitmap: CachedTagInstance = [0x5D1F] objects\weapons\rifle\dmr\bitmaps\dmr_diffuse.bitmap 

tags\(0x5D24) dmr_composite.shader> SetField ShaderProperties[0].Shadermaps[1].Bitmap shaders\default_bitmaps\bitmaps\default_detail.bitmap
Bitmap: CachedTagInstance = [0x0343] shaders\default_bitmaps\bitmaps\default_detail.bitmap 

tags\(0x5D24) dmr_composite.shader> SetField ShaderProperties[0].Shadermaps[2].Bitmap objects\weapons\rifle\dmr\bitmaps\dmr_normal.bitm
Bitmap: CachedTagInstance = [0x5D20] objects\weapons\rifle\dmr\bitmaps\dmr_normal.bitmap 

tags\(0x5D24) dmr_composite.shader> SetField ShaderProperties[0].Shadermaps[3].Bitmap shaders\default_bitmaps\bitmaps\default_vector.bitmap
Bitmap: CachedTagInstance = [0x0376] shaders\default_bitmaps\bitmaps\default_vector.bitmap 

tags\(0x5D24) dmr_composite.shader> SetField ShaderProperties[0].Shadermaps[4].Bitmap shaders\default_bitmaps\bitmaps\gray_50_percent.bitmap
Bitmap: CachedTagInstance = [0x02B7] shaders\default_bitmaps\bitmaps\gray_50_percent.bitmap 

tags\(0x5D24) dmr_composite.shader> SetField ShaderProperties[0].Shadermaps[5].Bitmap shaders\default_bitmaps\bitmaps\color_white.bitmap
Bitmap: CachedTagInstance = [0x02B9] shaders\default_bitmaps\bitmaps\color_white.bitmap 

tags\(0x5D24) dmr_composite.shader> SetField ShaderProperties[0].Shadermaps[6].Bitmap objects\weapons\rifle\dmr\bitmaps\dmr_illumination_map.bitm
Bitmap: CachedTagInstance = [0x5D21] objects\weapons\rifle\dmr\bitmaps\dmr_illumination_map.bitmap 

tags\(0x5D24) dmr_composite.shader> Setargument base_map 1 1 0 0

base_map:
	X Scale: 1
	Y Scale: 1
	X Offset: 0
	Y Offset: 0

tags\(0x5D24) dmr_composite.shader> Setargument detail_map 3 3 0 0

detail_map:
	X Scale: 3
	Y Scale: 3
	X Offset: 0
	Y Offset: 0

tags\(0x5D24) dmr_composite.shader> Setargument albedo_color 1 1 1 1

albedo_color:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument bump_map 1 1 0 0

bump_map:
	X Scale: 1
	Y Scale: 1
	X Offset: 0
	Y Offset: 0

tags\(0x5D24) dmr_composite.shader> Setargument bump_detail_map 6 6 0 0

bump_detail_map:
	X Scale: 6
	Y Scale: 6
	X Offset: 0
	Y Offset: 0

tags\(0x5D24) dmr_composite.shader> Setargument bump_detail_coefficient 1 1 1 1

bump_detail_coefficient:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument diffuse_coefficient 1 1 1 1

diffuse_coefficient:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument specular_coefficient 0.2 1 1 1

specular_coefficient:
	X: 0.2
	Y: 1
	Z: 1
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument specular_tint 0.8431373 0.854902 1 1

specular_tint:
	X: 0.8431373
	Y: 0.854902
	Z: 1
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument fresnel_color 0.5019608 0.5019608 0.5019608 1

fresnel_color:
	X: 0.5019608
	Y: 0.5019608
	Z: 0.5019608
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument use_fresnel_color_environment 0 0 0 0

use_fresnel_color_environment:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> Setargument fresnel_color_environment 0.5019608 0.5019608 0.5019608 1

fresnel_color_environment:
	X: 0.5019608
	Y: 0.5019608
	Z: 0.5019608
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument fresnel_power 0 0 0 0

fresnel_power:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> Setargument roughness 0.3 0.3 0.3 0.3

roughness:
	X: 0.3
	Y: 0.3
	Z: 0.3
	W: 0.3

tags\(0x5D24) dmr_composite.shader> Setargument area_specular_contribution 0 0 0 0

area_specular_contribution:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> Setargument analytical_specular_contribution 0.8 0.8 0.8 0.8

analytical_specular_contribution:
	X: 0.8
	Y: 0.8
	Z: 0.8
	W: 0.8

tags\(0x5D24) dmr_composite.shader> Setargument environment_map_specular_contribution 0.5 0.5 0.5 0.5

environment_map_specular_contribution:
	X: 0.5
	Y: 0.5
	Z: 0.5
	W: 0.5

tags\(0x5D24) dmr_composite.shader> Setargument material_texture 1 1 0 0

material_texture:
	X: 1
	Y: 1
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> Setargument albedo_blend_with_specular_tint 0 0 0 0

albedo_blend_with_specular_tint:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> Setargument albedo_blend 0 0 0 0

albedo_blend:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> Setargument analytical_anti_shadow_control 0 0 0 0

analytical_anti_shadow_control:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> Setargument rim_fresnel_coefficient 0 0 0 0

rim_fresnel_coefficient:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> Setargument rim_fresnel_color 1 1 1 1

rim_fresnel_color:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument rim_fresnel_power 2 2 2 2

rim_fresnel_power:
	X: 2
	Y: 2
	Z: 2
	W: 2

tags\(0x5D24) dmr_composite.shader> Setargument rim_fresnel_albedo_blend 0 0 0 0

rim_fresnel_albedo_blend:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> Setargument env_tint_color 0 0 0 1

env_tint_color:
	X: 0
	Y: 0
	Z: 0
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument env_roughness_scale 1 1 1 1

env_roughness_scale:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument self_illum_map 1 1 0 0

self_illum_map:
	X Scale: 1
	Y Scale: 1
	X Offset: 0
	Y Offset: 0

tags\(0x5D24) dmr_composite.shader> Setargument self_illum_color 0.4941177 0.2941177 0.03529412 1

self_illum_color:
	X: 0.4941177
	Y: 0.2941177
	Z: 0.03529412
	W: 1

tags\(0x5D24) dmr_composite.shader> Setargument self_illum_intensity 0 0 0 0

self_illum_intensity:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D24) dmr_composite.shader> SaveTagChanges
Done!

tags\(0x5D24) dmr_composite.shader> Exit

tags> 

tags> Duplicatetag objects\weapons\rifle\dmr\shaders\dmr_composite.shader
Tag duplicated successfully!
New tag: rmsh 00005D25 [Offset = 0x629E5C0, Size = 0x3E0]

tags> NameTag * objects\weapons\rifle\dmr\shaders\dmr_metal
[Index: 0x5D25, Offset: 0x0629E5C0, Size: 0x03E0] objects\weapons\rifle\dmr\shaders\dmr_metal.shader

tags> Duplicatetag objects\weapons\rifle\dmr\shaders\dmr_composite.shader
Tag duplicated successfully!
New tag: rmsh 00005D26 [Offset = 0x629E9A0, Size = 0x3E0]

tags> NameTag * objects\weapons\rifle\dmr\shaders\dmr_metal_shiny
[Index: 0x5D26, Offset: 0x0629E9A0, Size: 0x03E0] objects\weapons\rifle\dmr\shaders\dmr_metal_shiny.shader

tags> Duplicatetag objects\weapons\rifle\dmr\shaders\dmr_composite.shader
Tag duplicated successfully!
New tag: rmsh 00005D27 [Offset = 0x629ED80, Size = 0x3E0]

tags> Nametag * objects\weapons\rifle\dmr\shaders\dmr_rubber
[Index: 0x5D27, Offset: 0x0629ED80, Size: 0x03E0] objects\weapons\rifle\dmr\shaders\dmr_rubber.shader

tags> 

tags> Duplicatetag fx\null_object\null_up\null_up\shaders\[00]_rmsh.shader
Tag duplicated successfully!
New tag: rmsh 00005D28 [Offset = 0x629F160, Size = 0x1C0]

tags> NameTag * objects\weapons\rifle\dmr\shaders\dmr_lens
[Index: 0x5D28, Offset: 0x0629F160, Size: 0x01C0] objects\weapons\rifle\dmr\shaders\dmr_lens.shader

tags> EditTag objects\weapons\rifle\dmr\shaders\dmr_lens.shader
Tag (0x5D28) dmr_lens.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D28) dmr_lens.shader> Removeblockelements ImportData 0 *
Successfully removed 1 element from ImportData at index 0: List`1<ImportDatum>
null

tags\(0x5D28) dmr_lens.shader> Setargument albedo_color 0.7529413 0.7529413 0.7529413 0

albedo_color:
	X: 0.7529413
	Y: 0.7529413
	Z: 0.7529413
	W: 0

tags\(0x5D28) dmr_lens.shader> SaveTagChanges
Done!

tags\(0x5D28) dmr_lens.shader> Exit

tags> 

tags> Duplicatetag objects\weapons\rifle\battle_rifle\fp_battle_rifle\fp_battle_rifle_v2\shaders\[11]_rmsh.shader
Tag duplicated successfully!
New tag: rmsh 00005D29 [Offset = 0x629F2A0, Size = 0x9B0]

tags> NameTag * objects\weapons\rifle\dmr\shaders\dmr_lens_glass
[Index: 0x5D29, Offset: 0x0629F2A0, Size: 0x09B0] objects\weapons\rifle\dmr\shaders\dmr_lens_glass.shader

tags> EditTag objects\weapons\rifle\dmr\shaders\dmr_lens_glass.shader
Tag (0x5D29) dmr_lens_glass.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D29) dmr_lens_glass.shader> Removeblockelements ImportData 0 *
Successfully removed 17 elements from ImportData at index 0: List`1<ImportDatum>
null

tags\(0x5D29) dmr_lens_glass.shader> SetField ShaderProperties[0].Shadermaps[0].Bitmap shaders\default_bitmaps\bitmaps\alpha_grey50.bitmap
Bitmap: CachedTagInstance = [0x02B8] shaders\default_bitmaps\bitmaps\alpha_grey50.bitmap 

tags\(0x5D29) dmr_lens_glass.shader> SetField ShaderProperties[0].Shadermaps[0].Bitmap shaders\default_bitmaps\bitmaps\default_detail.bitmap
Bitmap: CachedTagInstance = [0x0343] shaders\default_bitmaps\bitmaps\default_detail.bitmap 

tags\(0x5D29) dmr_lens_glass.shader> SetField ShaderProperties[0].Shadermaps[0].Bitmap objects\weapons\rifle\dmr\bitmaps\dmr_diffuse.bitm
Bitmap: CachedTagInstance = [0x5D1F] objects\weapons\rifle\dmr\bitmaps\dmr_diffuse.bitmap 

tags\(0x5D29) dmr_lens_glass.shader> SetField ShaderProperties[0].Shadermaps[0].Bitmap shaders\default_bitmaps\bitmaps\alpha_grey50.bitmap
Bitmap: CachedTagInstance = [0x02B8] shaders\default_bitmaps\bitmaps\alpha_grey50.bitmap 

tags\(0x5D29) dmr_lens_glass.shader> setargument base_map 1 1 0 0

base_map:
	X Scale: 1
	Y Scale: 1
	X Offset: 0
	Y Offset: 0

tags\(0x5D29) dmr_lens_glass.shader> setargument detail_map 1 1 0 0

detail_map:
	X Scale: 1
	Y Scale: 1
	X Offset: 0
	Y Offset: 0

tags\(0x5D29) dmr_lens_glass.shader> setargument albedo_color 0.25 0.35 0.15 1

albedo_color:
	X: 0.25
	Y: 0.35
	Z: 0.15
	W: 1

tags\(0x5D29) dmr_lens_glass.shader> setargument specular_mask_texture 1 1 0 0

specular_mask_texture:
	X: 1
	Y: 1
	Z: 0
	W: 0

tags\(0x5D29) dmr_lens_glass.shader> setargument diffuse_coefficient 1 1 1 1

diffuse_coefficient:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D29) dmr_lens_glass.shader> setargument specular_coefficient 0.05 0.05 0.05 0.05

specular_coefficient:
	X: 0.05
	Y: 0.05
	Z: 0.05
	W: 0.05

tags\(0x5D29) dmr_lens_glass.shader> setargument fresnel_coefficient 0.05 0.05 0.05 0.05

fresnel_coefficient:
	X: 0.05
	Y: 0.05
	Z: 0.05
	W: 0.05

tags\(0x5D29) dmr_lens_glass.shader> setargument fresnel_curve_steepness 15 15 15 15

fresnel_curve_steepness:
	X: 15
	Y: 15
	Z: 15
	W: 15

tags\(0x5D29) dmr_lens_glass.shader> setargument fresnel_curve_bias 1 1 1 1

fresnel_curve_bias:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D29) dmr_lens_glass.shader> setargument roughness 1 1 1 1

roughness:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D29) dmr_lens_glass.shader> setargument analytical_specular_contribution 0 0 0 0

analytical_specular_contribution:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D29) dmr_lens_glass.shader> setargument area_specular_contribution 0 0 0 0

area_specular_contribution:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D29) dmr_lens_glass.shader> setargument env_tint_color 1 1 1 1

env_tint_color:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D29) dmr_lens_glass.shader> setargument env_roughness_scale 0.3 0.3 0.3 0.3

env_roughness_scale:
	X: 0.3
	Y: 0.3
	Z: 0.3
	W: 0.3

tags\(0x5D29) dmr_lens_glass.shader> setargument self_illum_map 1 1 0 0

self_illum_map:
	X Scale: 1
	Y Scale: 1
	X Offset: 0
	Y Offset: 0

tags\(0x5D29) dmr_lens_glass.shader> setargument self_illum_color 1 1 1 1

self_illum_color:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D29) dmr_lens_glass.shader> setargument self_illum_intensity 0 0 0 0

self_illum_intensity:
	X: 0
	Y: 0
	Z: 0
	W: 0

tags\(0x5D29) dmr_lens_glass.shader> SaveTagChanges
Done!

tags\(0x5D29) dmr_lens_glass.shader> Exit

tags> 

tags> Duplicatetag objects\weapons\rifle\dmr\fp_dmr\fp_dmr_v2\shaders\[12]_rmsh.shader
Tag duplicated successfully!
New tag: rmsh 00005D2A [Offset = 0x629F550, Size = 0x1D0]

tags> Nametag * objects\shaders\decals\shaders\unsc_decals_fp
[Index: 0x5D2A, Offset: 0x0629F550, Size: 0x01D0] objects\shaders\decals\shaders\unsc_decals_fp.shader

tags> EditTag objects\shaders\decals\shaders\unsc_decals_fp.shader
Tag (0x5D2A) unsc_decals_fp.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D2A) unsc_decals_fp.shader> SetField ShaderProperties[0].Shadermaps[0].Bitmap objects\weapons\rifle\dmr\bitmaps\unsc_decals_diffuse.bitm
Bitmap: CachedTagInstance = [0x5D22] objects\weapons\rifle\dmr\bitmaps\unsc_decals_diffuse.bitmap 

tags\(0x5D2A) unsc_decals_fp.shader> SetField ShaderProperties[0].Shadermaps[1].Bitmap shaders\default_bitmaps\bitmaps\default_detail.bitmap
Bitmap: CachedTagInstance = [0x0343] shaders\default_bitmaps\bitmaps\default_detail.bitmap 

tags\(0x5D2A) unsc_decals_fp.shader> Setargument base_map 1 1 0 0

base_map:
	X Scale: 1
	Y Scale: 1
	X Offset: 0
	Y Offset: 0

tags\(0x5D2A) unsc_decals_fp.shader> Setargument detail_map 1 1 0 0

detail_map:
	X Scale: 1
	Y Scale: 1
	X Offset: 0
	Y Offset: 0

tags\(0x5D2A) unsc_decals_fp.shader> Setargument albedo_color 1 1 1 1

albedo_color:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D2A) unsc_decals_fp.shader> SaveTagChanges
Done!

tags\(0x5D2A) unsc_decals_fp.shader> Exit

tags> 

tags> Duplicatetag objects\weapons\rifle\assault_rifle\fp_assault_rifle\fp_assault_rifle_v5\shaders\[12]_rmsh.shader
Tag duplicated successfully!
New tag: rmsh 00005D2B [Offset = 0x629F730, Size = 0x4E0]

tags> NameTag * objects\weapons\rifle\dmr\bitmaps\dmr_ones
[Index: 0x5D2B, Offset: 0x0629F730, Size: 0x04E0] objects\weapons\rifle\dmr\bitmaps\dmr_ones.shader

tags> Edittag objects\weapons\rifle\dmr\bitmaps\dmr_ones.shader
Tag (0x5D2B) dmr_ones.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D2B) dmr_ones.shader> Removeblockelements ImportData 0 *
Successfully removed 4 elements from ImportData at index 0: List`1<ImportDatum>
null

tags\(0x5D2B) dmr_ones.shader> SetField ShaderProperties[0].Shadermaps[0].Bitmap objects\weapons\rifle\dmr\bitmaps\dmr_numerology.bitm
Bitmap: CachedTagInstance = [0x5D23] objects\weapons\rifle\dmr\bitmaps\dmr_numerology.bitmap 

tags\(0x5D2B) dmr_ones.shader> Setargument self_illum_color 1 1 1 1

self_illum_color:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D2B) dmr_ones.shader> SaveTagChanges
Done!

tags\(0x5D2B) dmr_ones.shader> Exit

tags> Duplicatetag objects\weapons\rifle\assault_rifle\fp_assault_rifle\fp_assault_rifle_v5\shaders\[13]_rmsh.shader
Tag duplicated successfully!
New tag: rmsh 00005D2C [Offset = 0x629F9E0, Size = 0x4E0]

tags> NameTag * objects\weapons\rifle\dmr\bitmaps\dmr_tens
[Index: 0x5D2C, Offset: 0x0629F9E0, Size: 0x04E0] objects\weapons\rifle\dmr\bitmaps\dmr_tens.shader

tags> Edittag objects\weapons\rifle\dmr\bitmaps\dmr_tens.shader
Tag (0x5D2C) dmr_tens.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5D2C) dmr_tens.shader> Removeblockelements ImportData 0 *
Successfully removed 4 elements from ImportData at index 0: List`1<ImportDatum>
null

tags\(0x5D2C) dmr_tens.shader> SetField ShaderProperties[0].Shadermaps[0].Bitmap objects\weapons\rifle\dmr\bitmaps\dmr_numerology.bitm
Bitmap: CachedTagInstance = [0x5D23] objects\weapons\rifle\dmr\bitmaps\dmr_numerology.bitmap 

tags\(0x5D2C) dmr_tens.shader> Setargument self_illum_color 1 1 1 1

self_illum_color:
	X: 1
	Y: 1
	Z: 1
	W: 1

tags\(0x5D2C) dmr_tens.shader> SaveTagChanges
Done!

tags\(0x5D2C) dmr_tens.shader> Exit

tags> Savetagnames

tags> 

tags> Echo // Setup First Person DMR Model
// Setup First Person DMR Model 
tags> Importtag objects\weapons\rifle\dmr\fp_dmr\fp_dmr.render_model Tags\fp_dmr.render_model
Imported 0xA70 bytes.

tags> Edittag objects\weapons\rifle\dmr\fp_dmr\fp_dmr.render_model
Tag (0x0FF3) fp_dmr.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0FF3) fp_dmr.render_model> Replacerendergeometry Tags\Models\dmr.dae
Building render_geometry...done.
Writing render_model tag data...done.
Replaced render_geometry successfully.

tags\(0x0FF3) fp_dmr.render_model> Setfield Materials[0].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_composite.shader
RenderMethod: CachedTagInstance = [0x5D24] objects\weapons\rifle\dmr\shaders\dmr_composite.shader 

tags\(0x0FF3) fp_dmr.render_model> Setfield Materials[1].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_lens.shader
RenderMethod: CachedTagInstance = [0x5D28] objects\weapons\rifle\dmr\shaders\dmr_lens.shader 

tags\(0x0FF3) fp_dmr.render_model> Setfield Materials[2].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_lens_glass.shader
RenderMethod: CachedTagInstance = [0x5D29] objects\weapons\rifle\dmr\shaders\dmr_lens_glass.shader 

tags\(0x0FF3) fp_dmr.render_model> Setfield Materials[3].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_metal_shiny.shader
RenderMethod: CachedTagInstance = [0x5D26] objects\weapons\rifle\dmr\shaders\dmr_metal_shiny.shader 

tags\(0x0FF3) fp_dmr.render_model> Setfield Materials[4].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_rubber.shader
RenderMethod: CachedTagInstance = [0x5D27] objects\weapons\rifle\dmr\shaders\dmr_rubber.shader 

tags\(0x0FF3) fp_dmr.render_model> Setfield Materials[5].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_metal.shader
RenderMethod: CachedTagInstance = [0x5D25] objects\weapons\rifle\dmr\shaders\dmr_metal.shader 

tags\(0x0FF3) fp_dmr.render_model> Setfield Materials[6].RenderMethod objects\weapons\rifle\dmr\bitmaps\dmr_ones.shader
RenderMethod: CachedTagInstance = [0x5D2B] objects\weapons\rifle\dmr\bitmaps\dmr_ones.shader 

tags\(0x0FF3) fp_dmr.render_model> Setfield Materials[7].RenderMethod objects\weapons\rifle\dmr\bitmaps\dmr_tens.shader
RenderMethod: CachedTagInstance = [0x5D2C] objects\weapons\rifle\dmr\bitmaps\dmr_tens.shader 

tags\(0x0FF3) fp_dmr.render_model> Setfield Materials[8].RenderMethod objects\shaders\decals\shaders\unsc_decals_fp.shader
RenderMethod: CachedTagInstance = [0x5D2A] objects\shaders\decals\shaders\unsc_decals_fp.shader 

tags\(0x0FF3) fp_dmr.render_model> Savetagchanges
Done!

tags\(0x0FF3) fp_dmr.render_model> Exit

tags> 

tags> Echo // Setup Third Person DMR Model
// Setup Third Person DMR Model 
tags> Importtag objects\weapons\rifle\dmr\dmr.render_model Tags\dmr.render_model
Imported 0xA70 bytes.

tags> Edittag objects\weapons\rifle\dmr\dmr.render_model
Tag (0x1E25) dmr.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x1E25) dmr.render_model> Replacerendergeometry Tags\Models\dmr.dae
Building render_geometry...done.
Writing render_model tag data...done.
Replaced render_geometry successfully.

tags\(0x1E25) dmr.render_model> Setfield Materials[0].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_composite.shader
RenderMethod: CachedTagInstance = [0x5D24] objects\weapons\rifle\dmr\shaders\dmr_composite.shader 

tags\(0x1E25) dmr.render_model> Setfield Materials[1].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_lens.shader
RenderMethod: CachedTagInstance = [0x5D28] objects\weapons\rifle\dmr\shaders\dmr_lens.shader 

tags\(0x1E25) dmr.render_model> Setfield Materials[2].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_lens_glass.shader
RenderMethod: CachedTagInstance = [0x5D29] objects\weapons\rifle\dmr\shaders\dmr_lens_glass.shader 

tags\(0x1E25) dmr.render_model> Setfield Materials[3].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_metal_shiny.shader
RenderMethod: CachedTagInstance = [0x5D26] objects\weapons\rifle\dmr\shaders\dmr_metal_shiny.shader 

tags\(0x1E25) dmr.render_model> Setfield Materials[4].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_rubber.shader
RenderMethod: CachedTagInstance = [0x5D27] objects\weapons\rifle\dmr\shaders\dmr_rubber.shader 

tags\(0x1E25) dmr.render_model> Setfield Materials[5].RenderMethod objects\weapons\rifle\dmr\shaders\dmr_metal.shader
RenderMethod: CachedTagInstance = [0x5D25] objects\weapons\rifle\dmr\shaders\dmr_metal.shader 

tags\(0x1E25) dmr.render_model> Setfield Materials[6].RenderMethod objects\weapons\rifle\dmr\bitmaps\dmr_ones.shader
RenderMethod: CachedTagInstance = [0x5D2B] objects\weapons\rifle\dmr\bitmaps\dmr_ones.shader 

tags\(0x1E25) dmr.render_model> Setfield Materials[7].RenderMethod objects\weapons\rifle\dmr\bitmaps\dmr_tens.shader
RenderMethod: CachedTagInstance = [0x5D2C] objects\weapons\rifle\dmr\bitmaps\dmr_tens.shader 

tags\(0x1E25) dmr.render_model> Setfield Materials[8].RenderMethod objects\shaders\decals\shaders\unsc_decals_fp.shader
RenderMethod: CachedTagInstance = [0x5D2A] objects\shaders\decals\shaders\unsc_decals_fp.shader 

tags\(0x1E25) dmr.render_model> Savetagchanges
Done!

tags\(0x1E25) dmr.render_model> Exit

tags> 

tags> Echo // Fix Lod Model
// Fix Lod Model 
tags> Edittag objects\weapons\rifle\dmr\dmr.model
Tag (0x1E0B) dmr.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x1E0B) dmr.model> Setfield LodModel null
LodModel: CachedTagInstance = null 

tags\(0x1E0B) dmr.model> Savetagchanges
Done!

tags\(0x1E0B) dmr.model> Exit

tags> 

tags> Savetagnames

tags> Dumplog Reachdmr.txt
