Tag Tool [1.5.6678.2466]

Please report any bugs and/or feature requests at
<https://gitlab.com/TheGuardians/TagTool/issues>.

Enter "help" to list available commands. Enter "exit" to quit.

tags> echo   Installing Halo Reach Battle Rifle
Installing Halo Reach Battle Rifle 
tags> 

tags> createtag bitm
[Index: 0x5ADF, Offset: 0x06282D30, Size: 0x00F0] 0x5ADF.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\dmr_body_bump
[Index: 0x5ADF, Offset: 0x06282D30, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\dmr_body_bump.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\dmr_body_bump.bitmap
Tag (0x5ADF) dmr_body_bump.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5ADF) dmr_body_bump.bitmap> importbitmap 0 DDS/dmr_body_bump.dds
Importing image data...
Done!

tags\(0x5ADF) dmr_body_bump.bitmap> savetagchanges
Done!

tags\(0x5ADF) dmr_body_bump.bitmap> exit

tags> 

tags> createtag bitm
[Index: 0x5AE0, Offset: 0x06282F30, Size: 0x00F0] 0x5AE0.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\dmr_body
[Index: 0x5AE0, Offset: 0x06282F30, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\dmr_body.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\dmr_body.bitmap
Tag (0x5AE0) dmr_body.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE0) dmr_body.bitmap> importbitmap 0 DDS/dmr_body.dds
Importing image data...
Done!

tags\(0x5AE0) dmr_body.bitmap> savetagchanges
Done!

tags\(0x5AE0) dmr_body.bitmap> exit

tags> 

tags> createtag bitm
[Index: 0x5AE1, Offset: 0x06283130, Size: 0x00F0] 0x5AE1.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\mat
[Index: 0x5AE1, Offset: 0x06283130, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\mat.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\mat.bitmap
Tag (0x5AE1) mat.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE1) mat.bitmap> importbitmap 0 DDS/mat.dds
Importing image data...
Done!

tags\(0x5AE1) mat.bitmap> savetagchanges
Done!

tags\(0x5AE1) mat.bitmap> exit

tags> 

tags> duplicatetag 0x0F72
Tag duplicated successfully!
New tag: rmsh 00005AE2 [Offset = 0x6283330, Size = 0xD20]

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader
[Index: 0x5AE2, Offset: 0x06283330, Size: 0x0D20] objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
Tag (0x5AE2) dmr_body_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE2) dmr_body_shader.shader> editblock shaderproperties[0]

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]> editblock shadermaps[0]

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]\shadermaps[0]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\dmr_body.bitmap
Bitmap: CachedTagInstance = 0x00005AE0

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]\shadermaps[0]> exit

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]> editblock shadermaps[3]

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]\shadermaps[3]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\dmr_body_bump.bitmap
Bitmap: CachedTagInstance = 0x00005ADF

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]\shadermaps[3]> exit

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]> editblock shadermaps[7]

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]\shadermaps[7]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\mat.bitmap
Bitmap: CachedTagInstance = 0x00005AE1

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]\shadermaps[7]> exit

tags\(0x5AE2) dmr_body_shader.shader\shaderproperties[0]> exit

tags\(0x5AE2) dmr_body_shader.shader> savetagchanges
Done!

tags\(0x5AE2) dmr_body_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AE3, Offset: 0x06284050, Size: 0x00F0] 0x5AE3.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\br_handle
[Index: 0x5AE3, Offset: 0x06284050, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\br_handle.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\br_handle.bitmap
Tag (0x5AE3) br_handle.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE3) br_handle.bitmap> importbitmap 0 DDS/br_handle.dds
Importing image data...
Done!

tags\(0x5AE3) br_handle.bitmap> savetagchanges
Done!

tags\(0x5AE3) br_handle.bitmap> exit

tags> 

tags> duplicatetag 0x3AB0
Tag duplicated successfully!
New tag: rmsh 00005AE4 [Offset = 0x6284250, Size = 0x1D0]

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\br_handle_shader
[Index: 0x5AE4, Offset: 0x06284250, Size: 0x01D0] objects\weapons\rifle\battle_rifle\reach_br\br_handle_shader.shader

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\br_handle_shader.shader
Tag (0x5AE4) br_handle_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE4) br_handle_shader.shader> editblock shaderproperties[0]

tags\(0x5AE4) br_handle_shader.shader\shaderproperties[0]> editblock shadermaps[0]

tags\(0x5AE4) br_handle_shader.shader\shaderproperties[0]\shadermaps[0]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\br_handle.bitmap
Bitmap: CachedTagInstance = 0x00005AE3

tags\(0x5AE4) br_handle_shader.shader\shaderproperties[0]\shadermaps[0]> exit

tags\(0x5AE4) br_handle_shader.shader\shaderproperties[0]> exit

tags\(0x5AE4) br_handle_shader.shader> savetagchanges
Done!

tags\(0x5AE4) br_handle_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AE5, Offset: 0x06284430, Size: 0x00F0] 0x5AE5.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\ar_body
[Index: 0x5AE5, Offset: 0x06284430, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\ar_body.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\ar_body.bitmap
Tag (0x5AE5) ar_body.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE5) ar_body.bitmap> importbitmap 0 DDS/ar_body.dds
Importing image data...
Done!

tags\(0x5AE5) ar_body.bitmap> savetagchanges
Done!

tags\(0x5AE5) ar_body.bitmap> exit

tags> 

tags> duplicatetag 0x3AB0
Tag duplicated successfully!
New tag: rmsh 00005AE6 [Offset = 0x6284630, Size = 0x1D0]

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\ar_body_shader
[Index: 0x5AE6, Offset: 0x06284630, Size: 0x01D0] objects\weapons\rifle\battle_rifle\reach_br\ar_body_shader.shader

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\ar_body_shader.shader
Tag (0x5AE6) ar_body_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE6) ar_body_shader.shader> editblock shaderproperties[0]

tags\(0x5AE6) ar_body_shader.shader\shaderproperties[0]> editblock shadermaps[0]

tags\(0x5AE6) ar_body_shader.shader\shaderproperties[0]\shadermaps[0]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\ar_body.bitmap
Bitmap: CachedTagInstance = 0x00005AE5

tags\(0x5AE6) ar_body_shader.shader\shaderproperties[0]\shadermaps[0]> exit

tags\(0x5AE6) ar_body_shader.shader\shaderproperties[0]> exit

tags\(0x5AE6) ar_body_shader.shader> savetagchanges
Done!

tags\(0x5AE6) ar_body_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AE7, Offset: 0x06284810, Size: 0x00F0] 0x5AE7.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\bullet_plate
[Index: 0x5AE7, Offset: 0x06284810, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\bullet_plate.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\bullet_plate.bitmap
Tag (0x5AE7) bullet_plate.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE7) bullet_plate.bitmap> importbitmap 0 DDS/bullet_plate.dds
Importing image data...
Done!

tags\(0x5AE7) bullet_plate.bitmap> savetagchanges
Done!

tags\(0x5AE7) bullet_plate.bitmap> exit

tags> 

tags> duplicatetag 0x0EE6
Tag duplicated successfully!
New tag: rmsh 00005AE8 [Offset = 0x6284A10, Size = 0x3D0]

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\bullet_plate_shader
[Index: 0x5AE8, Offset: 0x06284A10, Size: 0x03D0] objects\weapons\rifle\battle_rifle\reach_br\bullet_plate_shader.shader

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\bullet_plate_shader.shader
Tag (0x5AE8) bullet_plate_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE8) bullet_plate_shader.shader> editblock shaderproperties[0]

tags\(0x5AE8) bullet_plate_shader.shader\shaderproperties[0]> editblock shadermaps[0]

tags\(0x5AE8) bullet_plate_shader.shader\shaderproperties[0]\shadermaps[0]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\bullet_plate.bitmap
Bitmap: CachedTagInstance = 0x00005AE7

tags\(0x5AE8) bullet_plate_shader.shader\shaderproperties[0]\shadermaps[0]> exit

tags\(0x5AE8) bullet_plate_shader.shader\shaderproperties[0]> exit

tags\(0x5AE8) bullet_plate_shader.shader> savetagchanges
Done!

tags\(0x5AE8) bullet_plate_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AE9, Offset: 0x06284DF0, Size: 0x00F0] 0x5AE9.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\compass
[Index: 0x5AE9, Offset: 0x06284DF0, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\compass.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\compass.bitmap
Tag (0x5AE9) compass.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AE9) compass.bitmap> importbitmap 0 DDS/compass/0.dds
Importing image data...
Done!

tags\(0x5AE9) compass.bitmap> addblockelements images 7
Successfully added 7 elements to Images: List`1<Image>
{...}[8]

tags\(0x5AE9) compass.bitmap> addblockelements resources 7
Successfully added 7 elements to Resources: List`1<BitmapResource>
{...}[8]

tags\(0x5AE9) compass.bitmap> setfield resources[1].resource null
Resource: PageableResource = null

tags\(0x5AE9) compass.bitmap> setfield resources[2].resource null
Resource: PageableResource = null

tags\(0x5AE9) compass.bitmap> setfield resources[3].resource null
Resource: PageableResource = null

tags\(0x5AE9) compass.bitmap> setfield resources[4].resource null
Resource: PageableResource = null

tags\(0x5AE9) compass.bitmap> setfield resources[5].resource null
Resource: PageableResource = null

tags\(0x5AE9) compass.bitmap> setfield resources[6].resource null
Resource: PageableResource = null

tags\(0x5AE9) compass.bitmap> setfield resources[7].resource null
Resource: PageableResource = null

tags\(0x5AE9) compass.bitmap> importbitmap 1 DDS/compass/1.dds
Importing image data...
Done!

tags\(0x5AE9) compass.bitmap> importbitmap 2 DDS/compass/2.dds
Importing image data...
Done!

tags\(0x5AE9) compass.bitmap> importbitmap 3 DDS/compass/3.dds
Importing image data...
Done!

tags\(0x5AE9) compass.bitmap> importbitmap 4 DDS/compass/4.dds
Importing image data...
Done!

tags\(0x5AE9) compass.bitmap> importbitmap 5 DDS/compass/5.dds
Importing image data...
Done!

tags\(0x5AE9) compass.bitmap> importbitmap 6 DDS/compass/6.dds
Importing image data...
Done!

tags\(0x5AE9) compass.bitmap> importbitmap 7 DDS/compass/7.dds
Importing image data...
Done!

tags\(0x5AE9) compass.bitmap> savetagchanges
Done!

tags\(0x5AE9) compass.bitmap> exit

tags> 

tags> duplicatetag 0x3AB0
Tag duplicated successfully!
New tag: rmsh 00005AEA [Offset = 0x62857C0, Size = 0x1D0]

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\compass_shader
[Index: 0x5AEA, Offset: 0x062857C0, Size: 0x01D0] objects\weapons\rifle\battle_rifle\reach_br\compass_shader.shader

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\compass_shader.shader
Tag (0x5AEA) compass_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AEA) compass_shader.shader> editblock shaderproperties[0]

tags\(0x5AEA) compass_shader.shader\shaderproperties[0]> editblock shadermaps[0]

tags\(0x5AEA) compass_shader.shader\shaderproperties[0]\shadermaps[0]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\compass.bitmap
Bitmap: CachedTagInstance = 0x00005AE9

tags\(0x5AEA) compass_shader.shader\shaderproperties[0]\shadermaps[0]> exit

tags\(0x5AEA) compass_shader.shader\shaderproperties[0]> exit

tags\(0x5AEA) compass_shader.shader> savetagchanges
Done!

tags\(0x5AEA) compass_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AEB, Offset: 0x062859A0, Size: 0x00F0] 0x5AEB.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\display
[Index: 0x5AEB, Offset: 0x062859A0, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\display.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\display.bitmap
Tag (0x5AEB) display.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AEB) display.bitmap> importbitmap 0 DDS/display.dds
Importing image data...
Done!

tags\(0x5AEB) display.bitmap> savetagchanges
Done!

tags\(0x5AEB) display.bitmap> exit

tags> 

tags> duplicatetag 0x3AB0
Tag duplicated successfully!
New tag: rmsh 00005AEC [Offset = 0x6285BA0, Size = 0x1D0]

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\display_shader
[Index: 0x5AEC, Offset: 0x06285BA0, Size: 0x01D0] objects\weapons\rifle\battle_rifle\reach_br\display_shader.shader

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\display_shader.shader
Tag (0x5AEC) display_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AEC) display_shader.shader> editblock shaderproperties[0]

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield template 0x0EFC
Template: CachedTagInstance = 0x00000EFC

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> removeblockelements shadermaps 1 1
Successfully removed 1 element from ShaderMaps at index 1: List`1<ShaderMap>
{...}[1]

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> editblock shadermaps[0]

tags\(0x5AEC) display_shader.shader\shaderproperties[0]\shadermaps[0]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\display.bitmap
Bitmap: CachedTagInstance = 0x00005AEB

tags\(0x5AEC) display_shader.shader\shaderproperties[0]\shadermaps[0]> exit

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> addblockelements arguments 1
Successfully added 1 element to Arguments: List`1<Argument>
{...}[4]

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[0].arg1 0
Arg1: Single = 0

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[0].arg2 0
Arg2: Single = 0

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[0].arg3 0
Arg3: Single = 0

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[0].arg4 1
Arg4: Single = 1

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[1].arg1 1
Arg1: Single = 1

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[1].arg2 1
Arg2: Single = 1

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[1].arg3 0
Arg3: Single = 0

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[1].arg4 0
Arg4: Single = 0

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[2].arg1 0.1058824
Arg1: Single = 0.1058824

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[2].arg2 0.4705883
Arg2: Single = 0.4705883

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[2].arg3 0.4666667
Arg3: Single = 0.4666667

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[2].arg4 1
Arg4: Single = 1

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[3].arg1 1
Arg1: Single = 1

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[3].arg2 1
Arg2: Single = 1

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[3].arg3 1
Arg3: Single = 1

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> setfield arguments[3].arg4 1
Arg4: Single = 1

tags\(0x5AEC) display_shader.shader\shaderproperties[0]> exit

tags\(0x5AEC) display_shader.shader> savetagchanges
Done!

tags\(0x5AEC) display_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AED, Offset: 0x06285D70, Size: 0x00F0] 0x5AED.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\skull
[Index: 0x5AED, Offset: 0x06285D70, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\skull.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\skull.bitmap
Tag (0x5AED) skull.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AED) skull.bitmap> importbitmap 0 DDS/skull.dds
Importing image data...
Done!

tags\(0x5AED) skull.bitmap> savetagchanges
Done!

tags\(0x5AED) skull.bitmap> exit

tags> 

tags> duplicatetag 0x0EE6
Tag duplicated successfully!
New tag: rmsh 00005AEE [Offset = 0x6285F70, Size = 0x3D0]

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\skull_shader
[Index: 0x5AEE, Offset: 0x06285F70, Size: 0x03D0] objects\weapons\rifle\battle_rifle\reach_br\skull_shader.shader

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\skull_shader.shader
Tag (0x5AEE) skull_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AEE) skull_shader.shader> editblock shaderproperties[0]

tags\(0x5AEE) skull_shader.shader\shaderproperties[0]> editblock shadermaps[0]

tags\(0x5AEE) skull_shader.shader\shaderproperties[0]\shadermaps[0]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\skull.bitmap
Bitmap: CachedTagInstance = 0x00005AED

tags\(0x5AEE) skull_shader.shader\shaderproperties[0]\shadermaps[0]> exit

tags\(0x5AEE) skull_shader.shader\shaderproperties[0]> exit

tags\(0x5AEE) skull_shader.shader> savetagchanges
Done!

tags\(0x5AEE) skull_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AEF, Offset: 0x06286350, Size: 0x00F0] 0x5AEF.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\dmr_storm
[Index: 0x5AEF, Offset: 0x06286350, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\dmr_storm.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\dmr_storm.bitmap
Tag (0x5AEF) dmr_storm.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AEF) dmr_storm.bitmap> importbitmap 0 DDS/dmr_storm.dds
Importing image data...
Done!

tags\(0x5AEF) dmr_storm.bitmap> savetagchanges
Done!

tags\(0x5AEF) dmr_storm.bitmap> exit

tags> 

tags> duplicatetag 0x3AB0
Tag duplicated successfully!
New tag: rmsh 00005AF0 [Offset = 0x6286550, Size = 0x1D0]

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\dmr_storm_shader
[Index: 0x5AF0, Offset: 0x06286550, Size: 0x01D0] objects\weapons\rifle\battle_rifle\reach_br\dmr_storm_shader.shader

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\dmr_storm_shader.shader
Tag (0x5AF0) dmr_storm_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AF0) dmr_storm_shader.shader> editblock shaderproperties[0]

tags\(0x5AF0) dmr_storm_shader.shader\shaderproperties[0]> editblock shadermaps[0]

tags\(0x5AF0) dmr_storm_shader.shader\shaderproperties[0]\shadermaps[0]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\dmr_storm.bitmap
Bitmap: CachedTagInstance = 0x00005AEF

tags\(0x5AF0) dmr_storm_shader.shader\shaderproperties[0]\shadermaps[0]> exit

tags\(0x5AF0) dmr_storm_shader.shader\shaderproperties[0]> exit

tags\(0x5AF0) dmr_storm_shader.shader> savetagchanges
Done!

tags\(0x5AF0) dmr_storm_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AF1, Offset: 0x06286730, Size: 0x00F0] 0x5AF1.bitmap

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\unsc_decals
[Index: 0x5AF1, Offset: 0x06286730, Size: 0x00F0] objects\weapons\rifle\battle_rifle\reach_br\unsc_decals.bitmap

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\unsc_decals.bitmap
Tag (0x5AF1) unsc_decals.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AF1) unsc_decals.bitmap> importbitmap 0 DDS/unsc_decals.dds
Importing image data...
Done!

tags\(0x5AF1) unsc_decals.bitmap> savetagchanges
Done!

tags\(0x5AF1) unsc_decals.bitmap> exit

tags> 

tags> duplicatetag 0x3AB0
Tag duplicated successfully!
New tag: rmsh 00005AF2 [Offset = 0x6286930, Size = 0x1D0]

tags> nametag * objects\weapons\rifle\battle_rifle\reach_br\unsc_decals_shader
[Index: 0x5AF2, Offset: 0x06286930, Size: 0x01D0] objects\weapons\rifle\battle_rifle\reach_br\unsc_decals_shader.shader

tags> edittag objects\weapons\rifle\battle_rifle\reach_br\unsc_decals_shader.shader
Tag (0x5AF2) unsc_decals_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AF2) unsc_decals_shader.shader> editblock shaderproperties[0]

tags\(0x5AF2) unsc_decals_shader.shader\shaderproperties[0]> editblock shadermaps[0]

tags\(0x5AF2) unsc_decals_shader.shader\shaderproperties[0]\shadermaps[0]> setfield bitmap objects\weapons\rifle\battle_rifle\reach_br\unsc_decals.bitmap
Bitmap: CachedTagInstance = 0x00005AF1

tags\(0x5AF2) unsc_decals_shader.shader\shaderproperties[0]\shadermaps[0]> exit

tags\(0x5AF2) unsc_decals_shader.shader\shaderproperties[0]> exit

tags\(0x5AF2) unsc_decals_shader.shader> savetagchanges
Done!

tags\(0x5AF2) unsc_decals_shader.shader> exit

tags> 

tags> edittag 0x0F96
Tag (0x0F96) self_illum_primary_ammunition_tens.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 0 DDS/ones/0.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 1 DDS/ones/1.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 2 DDS/ones/2.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 3 DDS/ones/3.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 4 DDS/ones/4.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 5 DDS/ones/5.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 6 DDS/ones/6.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 7 DDS/ones/7.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 8 DDS/ones/8.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> importbitmap 9 DDS/ones/9.dds
Importing image data...
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> savetagchanges
Done!

tags\(0x0F96) self_illum_primary_ammunition_tens.bitmap> exit

tags> 

tags> edittag 0x0F95
Tag (0x0F95) self_illum_primary_ammunition_ones.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 0 DDS/ones/0.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 1 DDS/ones/1.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 2 DDS/ones/2.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 3 DDS/ones/3.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 4 DDS/ones/4.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 5 DDS/ones/5.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 6 DDS/ones/6.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 7 DDS/ones/7.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 8 DDS/ones/8.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> importbitmap 9 DDS/ones/9.dds
Importing image data...
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> savetagchanges
Done!

tags\(0x0F95) self_illum_primary_ammunition_ones.bitmap> exit

tags> 

tags> importtag 0x0F71 tags\reachBR.render_model
Imported 0xC10 bytes.

tags> edittag 0x0F71
Tag (0x0F71) fp_battle_rifle.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0F71) fp_battle_rifle.render_model> replacerendergeometry tags\reachBR.dae
Building render_geometry...done.
Writing render_model tag data...done.
Replaced render_geometry successfully.

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[0].rendermethod objects\weapons\rifle\battle_rifle\reach_br\ar_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE6

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[1].rendermethod objects\weapons\rifle\battle_rifle\reach_br\ar_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE6

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[2].rendermethod objects\weapons\rifle\battle_rifle\reach_br\br_handle_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE4

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[3].rendermethod objects\weapons\rifle\battle_rifle\reach_br\compass_shader.shader
RenderMethod: CachedTagInstance = 0x00005AEA

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[4].rendermethod objects\weapons\rifle\battle_rifle\reach_br\display_shader.shader
RenderMethod: CachedTagInstance = 0x00005AEC

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[5].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[6].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[7].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[8].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[9].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[10].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[11].rendermethod objects\weapons\rifle\battle_rifle\reach_br\bullet_plate_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE8

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[12].rendermethod objects\weapons\rifle\battle_rifle\reach_br\skull_shader.shader
RenderMethod: CachedTagInstance = 0x00005AEE

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[14].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_storm_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF0

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[15].rendermethod 0x0F7A
RenderMethod: CachedTagInstance = 0x00000F7A

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[16].rendermethod objects\weapons\rifle\battle_rifle\reach_br\unsc_decals_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF2

tags\(0x0F71) fp_battle_rifle.render_model> setfield materials[17].rendermethod 0x0F79
RenderMethod: CachedTagInstance = 0x00000F79

tags\(0x0F71) fp_battle_rifle.render_model> savetagchanges
Done!

tags\(0x0F71) fp_battle_rifle.render_model> exit

tags> 

tags> importtag 0x1DA0 tags\reachBR3p.render_model
Imported 0xC10 bytes.

tags> edittag 0x1DA0
Tag (0x1DA0) battle_rifle.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x1DA0) battle_rifle.render_model> replacerendergeometry tags\reachBR.dae
Building render_geometry...done.
Writing render_model tag data...done.
Replaced render_geometry successfully.

tags\(0x1DA0) battle_rifle.render_model> setfield materials[0].rendermethod objects\weapons\rifle\battle_rifle\reach_br\ar_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE6

tags\(0x1DA0) battle_rifle.render_model> setfield materials[1].rendermethod objects\weapons\rifle\battle_rifle\reach_br\ar_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE6

tags\(0x1DA0) battle_rifle.render_model> setfield materials[2].rendermethod objects\weapons\rifle\battle_rifle\reach_br\br_handle_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE4

tags\(0x1DA0) battle_rifle.render_model> setfield materials[3].rendermethod objects\weapons\rifle\battle_rifle\reach_br\compass_shader.shader
RenderMethod: CachedTagInstance = 0x00005AEA

tags\(0x1DA0) battle_rifle.render_model> setfield materials[4].rendermethod objects\weapons\rifle\battle_rifle\reach_br\display_shader.shader
RenderMethod: CachedTagInstance = 0x00005AEC

tags\(0x1DA0) battle_rifle.render_model> setfield materials[5].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x1DA0) battle_rifle.render_model> setfield materials[6].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x1DA0) battle_rifle.render_model> setfield materials[7].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x1DA0) battle_rifle.render_model> setfield materials[8].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x1DA0) battle_rifle.render_model> setfield materials[9].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x1DA0) battle_rifle.render_model> setfield materials[10].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE2

tags\(0x1DA0) battle_rifle.render_model> setfield materials[11].rendermethod objects\weapons\rifle\battle_rifle\reach_br\bullet_plate_shader.shader
RenderMethod: CachedTagInstance = 0x00005AE8

tags\(0x1DA0) battle_rifle.render_model> setfield materials[12].rendermethod objects\weapons\rifle\battle_rifle\reach_br\skull_shader.shader
RenderMethod: CachedTagInstance = 0x00005AEE

tags\(0x1DA0) battle_rifle.render_model> setfield materials[14].rendermethod objects\weapons\rifle\battle_rifle\reach_br\dmr_storm_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF0

tags\(0x1DA0) battle_rifle.render_model> setfield materials[15].rendermethod 0x1DA5
RenderMethod: CachedTagInstance = 0x00001DA5

tags\(0x1DA0) battle_rifle.render_model> setfield materials[16].rendermethod objects\weapons\rifle\battle_rifle\reach_br\unsc_decals_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF2

tags\(0x1DA0) battle_rifle.render_model> setfield materials[17].rendermethod 0x1DA6
RenderMethod: CachedTagInstance = 0x00001DA6

tags\(0x1DA0) battle_rifle.render_model> savetagchanges
Done!

tags\(0x1DA0) battle_rifle.render_model> exit

tags> 

tags> dumplog reachBR.log
