Tag Tool [1.5.6338.16883]

Please report any bugs and/or feature requests at
<https://gitlab.com/TheGuardians/TagTool/issues>.

Enter "help" to list available commands. Enter "exit" to quit.

tags> echo   Installing Halo 3 Beta Armor
Installing Halo 3 Beta Armor 
tags> 

tags> SetLocale US

tags> 

tags> DuplicateTag 0x0f72
Tag duplicated successfully!
New tag: rmsh 00005B7D [Offset = 0x62BFF00, Size = 0xD20]

tags> NameTag * bodyShader
[Index: 0x5B7D, Offset: 0x062BFF00, Size: 0x0D20] bodyShader.shader

tags> importtag bodyShader.rmsh shaders\masterchiefBody.shader
Imported 0xD30 bytes.

tags> 

tags> DuplicateTag 0x0f72
Tag duplicated successfully!
New tag: rmsh 00005B7E [Offset = 0x62C0C30, Size = 0xD20]

tags> NameTag * mark6Visor
[Index: 0x5B7E, Offset: 0x062C0C30, Size: 0x0D20] mark6Visor.shader

tags> importtag mark6Visor.rmsh shaders\Mark6Visor.shader
Imported 0xD30 bytes.

tags> 

tags> CreateTag bitm
[Index: 0x5B7F, Offset: 0x062C1960, Size: 0x00F0] 0x5B7F.bitmap

tags> NameTag * bodyMaterial
[Index: 0x5B7F, Offset: 0x062C1960, Size: 0x00F0] bodyMaterial.bitmap

tags> EditTag bodyMaterial.bitm
Tag (0x5B7F) bodyMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B7F) bodyMaterial.bitmap> importbitmap 0 materials\masterchief_material.dds
Importing image data...
Done!

tags\(0x5B7F) bodyMaterial.bitmap> savetagchanges
Done!

tags\(0x5B7F) bodyMaterial.bitmap> exit

tags> 

tags> CreateTag bitm
[Index: 0x5B80, Offset: 0x062C1B70, Size: 0x00F0] 0x5B80.bitmap

tags> NameTag * M6VisorMaterial
[Index: 0x5B80, Offset: 0x062C1B70, Size: 0x00F0] M6VisorMaterial.bitmap

tags> EditTag M6VisorMaterial.bitm
Tag (0x5B80) M6VisorMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B80) M6VisorMaterial.bitmap> importbitmap 0 materials\visorMaterialAdapted.dds
Importing image data...
Done!

tags\(0x5B80) M6VisorMaterial.bitmap> savetagchanges
Done!

tags\(0x5B80) M6VisorMaterial.bitmap> exit

tags> 

tags> edittag 0x001B
Tag (0x001B) mp_masterchief_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x001B) mp_masterchief_cc.bitmap> importbitmap 0 cc\masterchief.dds
Importing image data...
Done!

tags\(0x001B) mp_masterchief_cc.bitmap> savetagchanges
Done!

tags\(0x001B) mp_masterchief_cc.bitmap> exit

tags> 

tags> edittag 0x001A
Tag (0x001A) mp_masterchief.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x001A) mp_masterchief.bitmap> importbitmap 0 base\MCdotsTrans.dds
Importing image data...
Done!

tags\(0x001A) mp_masterchief.bitmap> savetagchanges
Done!

tags\(0x001A) mp_masterchief.bitmap> exit

tags> 

tags> edittag 0x0024
Tag (0x0024) visor_realtime.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0024) visor_realtime.bitmap> importbitmap 0 base\visor_realtime.dds
Importing image data...
Done!

tags\(0x0024) visor_realtime.bitmap> savetagchanges
Done!

tags\(0x0024) visor_realtime.bitmap> exit

tags> 

tags> EditTag bodyShader.rmsh
Tag (0x5B7D) bodyShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].Arguments[9].Arg1 8.5
Arg1: Single = 8.5

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].Arguments[15].Arg1 0.28
Arg1: Single = 0.28

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].Arguments[18].Arg1 0.85
Arg1: Single = 0.85

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x001A
Bitmap: CachedTagInstance = 0x0000001A

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].ShaderMaps[1].Bitmap 0x000D
Bitmap: CachedTagInstance = 0x0000000D

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x001B
Bitmap: CachedTagInstance = 0x0000001B

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x001C
Bitmap: CachedTagInstance = 0x0000001C

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].ShaderMaps[4].Bitmap 0x001D 
Bitmap: CachedTagInstance = 0x0000001D

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].ShaderMaps[5].Bitmap 0x02B9
Bitmap: CachedTagInstance = 0x000002B9

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].ShaderMaps[6].Bitmap 0x02B9
Bitmap: CachedTagInstance = 0x000002B9

tags\(0x5B7D) bodyShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap bodyMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B7F

tags\(0x5B7D) bodyShader.shader> SaveTagChanges
Done!

tags\(0x5B7D) bodyShader.shader> exit

tags> 

tags> edittag 0x0022
Tag (0x0022) mp_masterchief_black.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0022) mp_masterchief_black.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x001A
Bitmap: CachedTagInstance = 0x0000001A

tags\(0x0022) mp_masterchief_black.shader> savetagchanges
Done!

tags\(0x0022) mp_masterchief_black.shader> exit

tags> 

tags> EditTag mark6Visor.rmsh
Tag (0x5B7E) mark6Visor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B7E) mark6Visor.shader> SetField ShaderProperties[0].Arguments[15].Arg1 5
Arg1: Single = 5

tags\(0x5B7E) mark6Visor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0024
Bitmap: CachedTagInstance = 0x00000024

tags\(0x5B7E) mark6Visor.shader> SetField ShaderProperties[0].ShaderMaps[1].Bitmap 0x0343
Bitmap: CachedTagInstance = 0x00000343

tags\(0x5B7E) mark6Visor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x001B
Bitmap: CachedTagInstance = 0x0000001B

tags\(0x5B7E) mark6Visor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0025
Bitmap: CachedTagInstance = 0x00000025

tags\(0x5B7E) mark6Visor.shader> SetField ShaderProperties[0].ShaderMaps[4].Bitmap 0x001D 
Bitmap: CachedTagInstance = 0x0000001D

tags\(0x5B7E) mark6Visor.shader> SetField ShaderProperties[0].ShaderMaps[5].Bitmap 0x02B9
Bitmap: CachedTagInstance = 0x000002B9

tags\(0x5B7E) mark6Visor.shader> SetField ShaderProperties[0].ShaderMaps[6].Bitmap 0x02B9
Bitmap: CachedTagInstance = 0x000002B9

tags\(0x5B7E) mark6Visor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap M6VisorMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B80

tags\(0x5B7E) mark6Visor.shader> SaveTagChanges
Done!

tags\(0x5B7E) mark6Visor.shader> ExitTo tags

tags> 

tags> edittag 0x0028
Tag (0x0028) base.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0028) base.render_model> SetField Materials[0].RenderMethod mark6Visor.rmsh
RenderMethod: CachedTagInstance = 0x00005B7E

tags\(0x0028) base.render_model> SetField Materials[1].RenderMethod bodyShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B7D

tags\(0x0028) base.render_model> savetagchanges
Done!

tags\(0x0028) base.render_model> exit

tags> 

tags> EditTag 0x0CBD
Tag (0x0CBD) mp_masterchief.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0CBD) mp_masterchief.render_model> SetField Materials[0].RenderMethod bodyShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B7D

tags\(0x0CBD) mp_masterchief.render_model> SaveTagChanges
Done!

tags\(0x0CBD) mp_masterchief.render_model> exit

tags> 

tags> EditTag 0x0005
Tag (0x0005) fp_body.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0005) fp_body.render_model> SetField Materials[0].RenderMethod bodyShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B7D

tags\(0x0005) fp_body.render_model> SetField Materials[2].RenderMethod bodyShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B7D

tags\(0x0005) fp_body.render_model> SaveTagChanges
Done!

tags\(0x0005) fp_body.render_model> exit

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B81, Offset: 0x062C1D60, Size: 0x00F0] 0x5B81.bitmap

tags> NameTag * armsMaterial
[Index: 0x5B81, Offset: 0x062C1D60, Size: 0x00F0] armsMaterial.bitmap

tags> EditTag armsMaterial.bitm
Tag (0x5B81) armsMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B81) armsMaterial.bitmap> importbitmap 0 materials\arm_material_v1.dds
Importing image data...
Done!

tags\(0x5B81) armsMaterial.bitmap> exit

tags> edittag 0x000A
Tag (0x000A) efp_mp_arms_x.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x000A) efp_mp_arms_x.bitmap> importbitmap 0 base\armsBase.dds
Importing image data...
Done!

tags\(0x000A) efp_mp_arms_x.bitmap> savetagchanges
Done!

tags\(0x000A) efp_mp_arms_x.bitmap> exit

tags> edittag 0x0011
Tag (0x0011) efp_arms_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0011) efp_arms_cc.bitmap> importbitmap 0 cc\arms.dds
Importing image data...
Done!

tags\(0x0011) efp_arms_cc.bitmap> savetagchanges
Done!

tags\(0x0011) efp_arms_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B82 [Offset = 0x62C1F70, Size = 0xD20]

tags> nametag * armsShader
[Index: 0x5B82, Offset: 0x062C1F70, Size: 0x0D20] armsShader.shader

tags> importtag armsShader.rmsh shaders\betaArms.shader
Imported 0xD20 bytes.

tags> edittag armsShader.rmsh
Tag (0x5B82) armsShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B82) armsShader.shader> SetField ShaderProperties[0].Arguments[9].Arg1 0.3
Arg1: Single = 0.3

tags\(0x5B82) armsShader.shader> SetField ShaderProperties[0].Arguments[15].Arg1 1
Arg1: Single = 1

tags\(0x5B82) armsShader.shader> SetField ShaderProperties[0].Arguments[18].Arg1 1
Arg1: Single = 1

tags\(0x5B82) armsShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x000A
Bitmap: CachedTagInstance = 0x0000000A

tags\(0x5B82) armsShader.shader> SetField ShaderProperties[0].ShaderMaps[1].Bitmap 0x000D
Bitmap: CachedTagInstance = 0x0000000D

tags\(0x5B82) armsShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0011
Bitmap: CachedTagInstance = 0x00000011

tags\(0x5B82) armsShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0012
Bitmap: CachedTagInstance = 0x00000012

tags\(0x5B82) armsShader.shader> SetField ShaderProperties[0].ShaderMaps[4].Bitmap 0x001D
Bitmap: CachedTagInstance = 0x0000001D

tags\(0x5B82) armsShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap armsMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B81

tags\(0x5B82) armsShader.shader> savetagchanges
Done!

tags\(0x5B82) armsShader.shader> exit

tags> EditTag 0x0004
Tag (0x0004) fp.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0004) fp.render_model> SetField Materials[0].RenderMethod armsShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B82

tags\(0x0004) fp.render_model> SaveTagChanges
Done!

tags\(0x0004) fp.render_model> ExitTo tags

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B83, Offset: 0x062C2C90, Size: 0x00F0] 0x5B83.bitmap

tags> NameTag * ninjaMaterial
[Index: 0x5B83, Offset: 0x062C2C90, Size: 0x00F0] ninjaMaterial.bitmap

tags> EditTag ninjaMaterial.bitm
Tag (0x5B83) ninjaMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B83) ninjaMaterial.bitmap> importbitmap 0 materials\ninjaMaterial.dds
Importing image data...
Done!

tags\(0x5B83) ninjaMaterial.bitmap> savetagchanges
Done!

tags\(0x5B83) ninjaMaterial.bitmap> exit

tags> edittag 0x003B
Tag (0x003B) mp_ninja.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x003B) mp_ninja.bitmap> importbitmap 0 base\ninjaBase.dds
Importing image data...
Done!

tags\(0x003B) mp_ninja.bitmap> savetagchanges
Done!

tags\(0x003B) mp_ninja.bitmap> exit

tags> edittag 0x003C
Tag (0x003C) mp_ninja_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x003C) mp_ninja_cc.bitmap> importbitmap 0 cc\ninja.dds
Importing image data...
Done!

tags\(0x003C) mp_ninja_cc.bitmap> savetagchanges
Done!

tags\(0x003C) mp_ninja_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B84 [Offset = 0x62C2EA0, Size = 0xD20]

tags> nametag * ninjaShader
[Index: 0x5B84, Offset: 0x062C2EA0, Size: 0x0D20] ninjaShader.shader

tags> edittag ninjaShader.rmsh
Tag (0x5B84) ninjaShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B84) ninjaShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x003B
Bitmap: CachedTagInstance = 0x0000003B

tags\(0x5B84) ninjaShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x003C
Bitmap: CachedTagInstance = 0x0000003C

tags\(0x5B84) ninjaShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x003D
Bitmap: CachedTagInstance = 0x0000003D

tags\(0x5B84) ninjaShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap ninjaMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B83

tags\(0x5B84) ninjaShader.shader> savetagchanges
Done!

tags\(0x5B84) ninjaShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B85 [Offset = 0x62C3BC0, Size = 0xD20]

tags> nametag * ninjaVisor
[Index: 0x5B85, Offset: 0x062C3BC0, Size: 0x0D20] ninjaVisor.shader

tags> edittag ninjaVisor.rmsh
Tag (0x5B85) ninjaVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x003B
Bitmap: CachedTagInstance = 0x0000003B

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x003C
Bitmap: CachedTagInstance = 0x0000003C

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x003D
Bitmap: CachedTagInstance = 0x0000003D

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap ninjaMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B83

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[8].Arg1 50
Arg1: Single = 50

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[9].Arg1 1
Arg1: Single = 1

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[14].Arg1 11111
Arg1: Single = 11111

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[15].Arg1 0.1
Arg1: Single = 0.1

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[16].Arg1 0
Arg1: Single = 0

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[17].Arg1 22
Arg1: Single = 22

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[18].Arg1 1
Arg1: Single = 1

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[20].Arg1 0
Arg1: Single = 0

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[21].Arg1 1.8
Arg1: Single = 1.8

tags\(0x5B85) ninjaVisor.shader> SetField ShaderProperties[0].Arguments[23].Arg1 0
Arg1: Single = 0

tags\(0x5B85) ninjaVisor.shader> savetagchanges
Done!

tags\(0x5B85) ninjaVisor.shader> exit

tags> EditTag 0x0040
Tag (0x0040) mp_ninja.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0040) mp_ninja.render_model> SetField Materials[0].RenderMethod bodyShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B7D

tags\(0x0040) mp_ninja.render_model> SetField Materials[1].RenderMethod ninjaShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B84

tags\(0x0040) mp_ninja.render_model> SetField Materials[2].RenderMethod ninjaVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005B85

tags\(0x0040) mp_ninja.render_model> SaveTagChanges
Done!

tags\(0x0040) mp_ninja.render_model> exit

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B86, Offset: 0x062C48E0, Size: 0x00F0] 0x5B86.bitmap

tags> NameTag * intruderMaterial
[Index: 0x5B86, Offset: 0x062C48E0, Size: 0x00F0] intruderMaterial.bitmap

tags> EditTag intruderMaterial.bitm
Tag (0x5B86) intruderMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B86) intruderMaterial.bitmap> importbitmap 0 materials\intruderMaterial.dds
Importing image data...
Done!

tags\(0x5B86) intruderMaterial.bitmap> savetagchanges
Done!

tags\(0x5B86) intruderMaterial.bitmap> exit

tags> edittag 0x0033
Tag (0x0033) mp_intruder.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0033) mp_intruder.bitmap> importbitmap 0 base\intruderBase.dds
Importing image data...
Done!

tags\(0x0033) mp_intruder.bitmap> savetagchanges
Done!

tags\(0x0033) mp_intruder.bitmap> exit

tags> edittag 0x0034
Tag (0x0034) mp_intruder_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0034) mp_intruder_cc.bitmap> importbitmap 0 cc\intruder.dds
Importing image data...
Done!

tags\(0x0034) mp_intruder_cc.bitmap> savetagchanges
Done!

tags\(0x0034) mp_intruder_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B87 [Offset = 0x62C4AF0, Size = 0xD20]

tags> nametag * intruderShader
[Index: 0x5B87, Offset: 0x062C4AF0, Size: 0x0D20] intruderShader.shader

tags> edittag intruderShader.rmsh
Tag (0x5B87) intruderShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B87) intruderShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0033
Bitmap: CachedTagInstance = 0x00000033

tags\(0x5B87) intruderShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0034
Bitmap: CachedTagInstance = 0x00000034

tags\(0x5B87) intruderShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0035
Bitmap: CachedTagInstance = 0x00000035

tags\(0x5B87) intruderShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap intruderMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B86

tags\(0x5B87) intruderShader.shader> savetagchanges
Done!

tags\(0x5B87) intruderShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B88 [Offset = 0x62C5810, Size = 0xD20]

tags> nametag * intruderVisor
[Index: 0x5B88, Offset: 0x062C5810, Size: 0x0D20] intruderVisor.shader

tags> edittag intruderVisor.rmsh
Tag (0x5B88) intruderVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B88) intruderVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0033
Bitmap: CachedTagInstance = 0x00000033

tags\(0x5B88) intruderVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0034
Bitmap: CachedTagInstance = 0x00000034

tags\(0x5B88) intruderVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0035
Bitmap: CachedTagInstance = 0x00000035

tags\(0x5B88) intruderVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap intruderMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B86

tags\(0x5B88) intruderVisor.shader> savetagchanges
Done!

tags\(0x5B88) intruderVisor.shader> exit

tags> EditTag 0x0038
Tag (0x0038) mp_intruder.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0038) mp_intruder.render_model> SetField Materials[0].RenderMethod bodyShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B7D

tags\(0x0038) mp_intruder.render_model> SetField Materials[1].RenderMethod intruderShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B87

tags\(0x0038) mp_intruder.render_model> SetField Materials[2].RenderMethod intruderVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005B88

tags\(0x0038) mp_intruder.render_model> SaveTagChanges
Done!

tags\(0x0038) mp_intruder.render_model> ExitTo tags

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B89, Offset: 0x062C6530, Size: 0x00F0] 0x5B89.bitmap

tags> NameTag * cobraMaterial
[Index: 0x5B89, Offset: 0x062C6530, Size: 0x00F0] cobraMaterial.bitmap

tags> EditTag cobraMaterial.bitm
Tag (0x5B89) cobraMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B89) cobraMaterial.bitmap> importbitmap 0 materials\cobraMaterial.dds
Importing image data...
Done!

tags\(0x5B89) cobraMaterial.bitmap> savetagchanges
Done!

tags\(0x5B89) cobraMaterial.bitmap> exit

tags> edittag 0x002B
Tag (0x002B) mp_cobra.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x002B) mp_cobra.bitmap> importbitmap 0 base\cobraBase.dds
Importing image data...
Done!

tags\(0x002B) mp_cobra.bitmap> savetagchanges
Done!

tags\(0x002B) mp_cobra.bitmap> exit

tags> edittag 0x002C
Tag (0x002C) mp_cobra_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x002C) mp_cobra_cc.bitmap> importbitmap 0 cc\cobra.dds
Importing image data...
Done!

tags\(0x002C) mp_cobra_cc.bitmap> savetagchanges
Done!

tags\(0x002C) mp_cobra_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B8A [Offset = 0x62C6740, Size = 0xD20]

tags> nametag * cobraShader
[Index: 0x5B8A, Offset: 0x062C6740, Size: 0x0D20] cobraShader.shader

tags> edittag cobraShader.rmsh
Tag (0x5B8A) cobraShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B8A) cobraShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x002B
Bitmap: CachedTagInstance = 0x0000002B

tags\(0x5B8A) cobraShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x002C
Bitmap: CachedTagInstance = 0x0000002C

tags\(0x5B8A) cobraShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x002D
Bitmap: CachedTagInstance = 0x0000002D

tags\(0x5B8A) cobraShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap cobraMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B89

tags\(0x5B8A) cobraShader.shader> savetagchanges
Done!

tags\(0x5B8A) cobraShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B8B [Offset = 0x62C7460, Size = 0xD20]

tags> nametag * cobraVisor
[Index: 0x5B8B, Offset: 0x062C7460, Size: 0x0D20] cobraVisor.shader

tags> edittag cobraVisor.rmsh
Tag (0x5B8B) cobraVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B8B) cobraVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x002B
Bitmap: CachedTagInstance = 0x0000002B

tags\(0x5B8B) cobraVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x002C
Bitmap: CachedTagInstance = 0x0000002C

tags\(0x5B8B) cobraVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x002D
Bitmap: CachedTagInstance = 0x0000002D

tags\(0x5B8B) cobraVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap cobraMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B89

tags\(0x5B8B) cobraVisor.shader> savetagchanges
Done!

tags\(0x5B8B) cobraVisor.shader> exit

tags> EditTag 0x0030
Tag (0x0030) mp_cobra.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0030) mp_cobra.render_model> SetField Materials[2].RenderMethod bodyShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B7D

tags\(0x0030) mp_cobra.render_model> SetField Materials[0].RenderMethod cobraShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B8A

tags\(0x0030) mp_cobra.render_model> SetField Materials[1].RenderMethod cobraVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005B8B

tags\(0x0030) mp_cobra.render_model> SaveTagChanges
Done!

tags\(0x0030) mp_cobra.render_model> ExitTo tags

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B8C, Offset: 0x062C8180, Size: 0x00F0] 0x5B8C.bitmap

tags> NameTag * regulMaterial
[Index: 0x5B8C, Offset: 0x062C8180, Size: 0x00F0] regulMaterial.bitmap

tags> EditTag regulMaterial.bitm
Tag (0x5B8C) regulMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B8C) regulMaterial.bitmap> importbitmap 0 materials\regulMaterial.dds
Importing image data...
Done!

tags\(0x5B8C) regulMaterial.bitmap> savetagchanges
Done!

tags\(0x5B8C) regulMaterial.bitmap> exit

tags> edittag 0x0043
Tag (0x0043) mp_regulator.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0043) mp_regulator.bitmap> importbitmap 0 base\regulBase.dds
Importing image data...
Done!

tags\(0x0043) mp_regulator.bitmap> savetagchanges
Done!

tags\(0x0043) mp_regulator.bitmap> exit

tags> edittag 0x0044
Tag (0x0044) mp_regulator_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0044) mp_regulator_cc.bitmap> importbitmap 0 cc\regulator.dds
Importing image data...
Done!

tags\(0x0044) mp_regulator_cc.bitmap> savetagchanges
Done!

tags\(0x0044) mp_regulator_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B8D [Offset = 0x62C8390, Size = 0xD20]

tags> nametag * regulShader
[Index: 0x5B8D, Offset: 0x062C8390, Size: 0x0D20] regulShader.shader

tags> edittag regulShader.rmsh
Tag (0x5B8D) regulShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B8D) regulShader.shader> SetField ShaderProperties[0].Arguments[8].Arg1 2.1
Arg1: Single = 2.1

tags\(0x5B8D) regulShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0043
Bitmap: CachedTagInstance = 0x00000043

tags\(0x5B8D) regulShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0044
Bitmap: CachedTagInstance = 0x00000044

tags\(0x5B8D) regulShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0045
Bitmap: CachedTagInstance = 0x00000045

tags\(0x5B8D) regulShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap regulMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B8C

tags\(0x5B8D) regulShader.shader> savetagchanges
Done!

tags\(0x5B8D) regulShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B8E [Offset = 0x62C90B0, Size = 0xD20]

tags> nametag * regulVisor
[Index: 0x5B8E, Offset: 0x062C90B0, Size: 0x0D20] regulVisor.shader

tags> edittag regulVisor.rmsh
Tag (0x5B8E) regulVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B8E) regulVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0043
Bitmap: CachedTagInstance = 0x00000043

tags\(0x5B8E) regulVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0044
Bitmap: CachedTagInstance = 0x00000044

tags\(0x5B8E) regulVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0045
Bitmap: CachedTagInstance = 0x00000045

tags\(0x5B8E) regulVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap regulMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B8C

tags\(0x5B8E) regulVisor.shader> savetagchanges
Done!

tags\(0x5B8E) regulVisor.shader> exit

tags> EditTag 0x0048
Tag (0x0048) mp_regulator.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0048) mp_regulator.render_model> SetField Materials[0].RenderMethod regulShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B8D

tags\(0x0048) mp_regulator.render_model> SetField Materials[1].RenderMethod regulVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005B8E

tags\(0x0048) mp_regulator.render_model> SaveTagChanges
Done!

tags\(0x0048) mp_regulator.render_model> ExitTo tags

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B8F, Offset: 0x062C9DD0, Size: 0x00F0] 0x5B8F.bitmap

tags> NameTag * markvMaterial
[Index: 0x5B8F, Offset: 0x062C9DD0, Size: 0x00F0] markvMaterial.bitmap

tags> EditTag markvMaterial.bitm
Tag (0x5B8F) markvMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B8F) markvMaterial.bitmap> importbitmap 0 materials\markvMaterial.dds
Importing image data...
Done!

tags\(0x5B8F) markvMaterial.bitmap> savetagchanges
Done!

tags\(0x5B8F) markvMaterial.bitmap> exit

tags> edittag 0x006C
Tag (0x006C) mp_markv.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x006C) mp_markv.bitmap> importbitmap 0 base\markvBase.dds
Importing image data...
Done!

tags\(0x006C) mp_markv.bitmap> savetagchanges
Done!

tags\(0x006C) mp_markv.bitmap> exit

tags> edittag 0x006D
Tag (0x006D) mp_markv_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x006D) mp_markv_cc.bitmap> importbitmap 0 cc\markv.dds
Importing image data...
Done!

tags\(0x006D) mp_markv_cc.bitmap> savetagchanges
Done!

tags\(0x006D) mp_markv_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B90 [Offset = 0x62C9FE0, Size = 0xD20]

tags> nametag * markvShader
[Index: 0x5B90, Offset: 0x062C9FE0, Size: 0x0D20] markvShader.shader

tags> edittag markvShader.rmsh
Tag (0x5B90) markvShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B90) markvShader.shader> SetField ShaderProperties[0].Arguments[8].Arg1 2.1
Arg1: Single = 2.1

tags\(0x5B90) markvShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x006C
Bitmap: CachedTagInstance = 0x0000006C

tags\(0x5B90) markvShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x006D
Bitmap: CachedTagInstance = 0x0000006D

tags\(0x5B90) markvShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x006E
Bitmap: CachedTagInstance = 0x0000006E

tags\(0x5B90) markvShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap markvMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B8F

tags\(0x5B90) markvShader.shader> savetagchanges
Done!

tags\(0x5B90) markvShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B91 [Offset = 0x62CAD00, Size = 0xD20]

tags> nametag * markvVisor
[Index: 0x5B91, Offset: 0x062CAD00, Size: 0x0D20] markvVisor.shader

tags> edittag markvVisor.rmsh
Tag (0x5B91) markvVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B91) markvVisor.shader> SetField ShaderProperties[0].Arguments[15].Arg1 1
Arg1: Single = 1

tags\(0x5B91) markvVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x006C
Bitmap: CachedTagInstance = 0x0000006C

tags\(0x5B91) markvVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x006D
Bitmap: CachedTagInstance = 0x0000006D

tags\(0x5B91) markvVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x006E
Bitmap: CachedTagInstance = 0x0000006E

tags\(0x5B91) markvVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap markvMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B8F

tags\(0x5B91) markvVisor.shader> savetagchanges
Done!

tags\(0x5B91) markvVisor.shader> exit

tags> EditTag 0x0071
Tag (0x0071) mp_markv.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0071) mp_markv.render_model> SetField Materials[0].RenderMethod markvShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B90

tags\(0x0071) mp_markv.render_model> SetField Materials[1].RenderMethod markvVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005B91

tags\(0x0071) mp_markv.render_model> SaveTagChanges
Done!

tags\(0x0071) mp_markv.render_model> ExitTo tags

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B92, Offset: 0x062CBA20, Size: 0x00F0] 0x5B92.bitmap

tags> NameTag * maratMaterial
[Index: 0x5B92, Offset: 0x062CBA20, Size: 0x00F0] maratMaterial.bitmap

tags> EditTag maratMaterial.bitm
Tag (0x5B92) maratMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B92) maratMaterial.bitmap> importbitmap 0 materials\maratMaterial.dds
Importing image data...
Done!

tags\(0x5B92) maratMaterial.bitmap> savetagchanges
Done!

tags\(0x5B92) maratMaterial.bitmap> exit

tags> edittag 0x0053
Tag (0x0053) mp_marathon.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0053) mp_marathon.bitmap> importbitmap 0 base\maratBase.dds
Importing image data...
Done!

tags\(0x0053) mp_marathon.bitmap> savetagchanges
Done!

tags\(0x0053) mp_marathon.bitmap> exit

tags> edittag 0x0054
Tag (0x0054) mp_marathon_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0054) mp_marathon_cc.bitmap> importbitmap 0 cc\marathon.dds
Importing image data...
Done!

tags\(0x0054) mp_marathon_cc.bitmap> savetagchanges
Done!

tags\(0x0054) mp_marathon_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B93 [Offset = 0x62CBC30, Size = 0xD20]

tags> nametag * maratShader
[Index: 0x5B93, Offset: 0x062CBC30, Size: 0x0D20] maratShader.shader

tags> edittag maratShader.rmsh
Tag (0x5B93) maratShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B93) maratShader.shader> SetField ShaderProperties[0].Arguments[8].Arg1 2.1
Arg1: Single = 2.1

tags\(0x5B93) maratShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0053
Bitmap: CachedTagInstance = 0x00000053

tags\(0x5B93) maratShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0054
Bitmap: CachedTagInstance = 0x00000054

tags\(0x5B93) maratShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0055
Bitmap: CachedTagInstance = 0x00000055

tags\(0x5B93) maratShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap maratMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B92

tags\(0x5B93) maratShader.shader> savetagchanges
Done!

tags\(0x5B93) maratShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B94 [Offset = 0x62CC950, Size = 0xD20]

tags> nametag * maratVisor
[Index: 0x5B94, Offset: 0x062CC950, Size: 0x0D20] maratVisor.shader

tags> edittag maratVisor.rmsh
Tag (0x5B94) maratVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B94) maratVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0053
Bitmap: CachedTagInstance = 0x00000053

tags\(0x5B94) maratVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0054
Bitmap: CachedTagInstance = 0x00000054

tags\(0x5B94) maratVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0055
Bitmap: CachedTagInstance = 0x00000055

tags\(0x5B94) maratVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap maratMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B92

tags\(0x5B94) maratVisor.shader> savetagchanges
Done!

tags\(0x5B94) maratVisor.shader> exit

tags> EditTag 0x0058
Tag (0x0058) mp_marathon.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0058) mp_marathon.render_model> SetField Materials[0].RenderMethod maratShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B93

tags\(0x0058) mp_marathon.render_model> SetField Materials[1].RenderMethod maratVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005B94

tags\(0x0058) mp_marathon.render_model> SaveTagChanges
Done!

tags\(0x0058) mp_marathon.render_model> ExitTo tags

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B95, Offset: 0x062CD670, Size: 0x00F0] 0x5B95.bitmap

tags> NameTag * scoutMaterial
[Index: 0x5B95, Offset: 0x062CD670, Size: 0x00F0] scoutMaterial.bitmap

tags> EditTag scoutMaterial.bitm
Tag (0x5B95) scoutMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B95) scoutMaterial.bitmap> importbitmap 0 materials\scoutMaterial.dds
Importing image data...
Done!

tags\(0x5B95) scoutMaterial.bitmap> savetagchanges
Done!

tags\(0x5B95) scoutMaterial.bitmap> exit

tags> edittag 0x005B
Tag (0x005B) mp_scout.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x005B) mp_scout.bitmap> importbitmap 0 base\scoutBase.dds
Importing image data...
Done!

tags\(0x005B) mp_scout.bitmap> savetagchanges
Done!

tags\(0x005B) mp_scout.bitmap> exit

tags> edittag 0x005C
Tag (0x005C) mp_scout_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x005C) mp_scout_cc.bitmap> importbitmap 0 cc\scout.dds
Importing image data...
Done!

tags\(0x005C) mp_scout_cc.bitmap> savetagchanges
Done!

tags\(0x005C) mp_scout_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B96 [Offset = 0x62CD880, Size = 0xD20]

tags> nametag * scoutShader
[Index: 0x5B96, Offset: 0x062CD880, Size: 0x0D20] scoutShader.shader

tags> edittag scoutShader.rmsh
Tag (0x5B96) scoutShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B96) scoutShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x005B
Bitmap: CachedTagInstance = 0x0000005B

tags\(0x5B96) scoutShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x005C
Bitmap: CachedTagInstance = 0x0000005C

tags\(0x5B96) scoutShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x005E
Bitmap: CachedTagInstance = 0x0000005E

tags\(0x5B96) scoutShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap scoutMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B95

tags\(0x5B96) scoutShader.shader> savetagchanges
Done!

tags\(0x5B96) scoutShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B97 [Offset = 0x62CE5A0, Size = 0xD20]

tags> nametag * scoutVisor
[Index: 0x5B97, Offset: 0x062CE5A0, Size: 0x0D20] scoutVisor.shader

tags> edittag scoutVisor.rmsh
Tag (0x5B97) scoutVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B97) scoutVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x005B
Bitmap: CachedTagInstance = 0x0000005B

tags\(0x5B97) scoutVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x005C
Bitmap: CachedTagInstance = 0x0000005C

tags\(0x5B97) scoutVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x005E
Bitmap: CachedTagInstance = 0x0000005E

tags\(0x5B97) scoutVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap scoutMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B95

tags\(0x5B97) scoutVisor.shader> savetagchanges
Done!

tags\(0x5B97) scoutVisor.shader> exit

tags> EditTag 0x0061
Tag (0x0061) mp_scout.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0061) mp_scout.render_model> SetField Materials[0].RenderMethod scoutShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B96

tags\(0x0061) mp_scout.render_model> SetField Materials[1].RenderMethod scoutVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005B97

tags\(0x0061) mp_scout.render_model> SaveTagChanges
Done!

tags\(0x0061) mp_scout.render_model> ExitTo tags

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B98, Offset: 0x062CF2C0, Size: 0x00F0] 0x5B98.bitmap

tags> NameTag * rogueMaterial
[Index: 0x5B98, Offset: 0x062CF2C0, Size: 0x00F0] rogueMaterial.bitmap

tags> EditTag rogueMaterial.bitm
Tag (0x5B98) rogueMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B98) rogueMaterial.bitmap> importbitmap 0 materials\rogueMaterial.dds
Importing image data...
Done!

tags\(0x5B98) rogueMaterial.bitmap> savetagchanges
Done!

tags\(0x5B98) rogueMaterial.bitmap> exit

tags> edittag 0x0074
Tag (0x0074) mp_rogue.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0074) mp_rogue.bitmap> importbitmap 0 base\rogueBase.dds
Importing image data...
Done!

tags\(0x0074) mp_rogue.bitmap> savetagchanges
Done!

tags\(0x0074) mp_rogue.bitmap> exit

tags> edittag 0x0075
Tag (0x0075) mp_rogue_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0075) mp_rogue_cc.bitmap> importbitmap 0 cc\rogue.dds
Importing image data...
Done!

tags\(0x0075) mp_rogue_cc.bitmap> savetagchanges
Done!

tags\(0x0075) mp_rogue_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B99 [Offset = 0x62CF4D0, Size = 0xD20]

tags> nametag * rogueShader
[Index: 0x5B99, Offset: 0x062CF4D0, Size: 0x0D20] rogueShader.shader

tags> edittag rogueShader.rmsh
Tag (0x5B99) rogueShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B99) rogueShader.shader> SetField ShaderProperties[0].Arguments[8].Arg1 2.1
Arg1: Single = 2.1

tags\(0x5B99) rogueShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0074
Bitmap: CachedTagInstance = 0x00000074

tags\(0x5B99) rogueShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0075
Bitmap: CachedTagInstance = 0x00000075

tags\(0x5B99) rogueShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0076
Bitmap: CachedTagInstance = 0x00000076

tags\(0x5B99) rogueShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap rogueMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B98

tags\(0x5B99) rogueShader.shader> savetagchanges
Done!

tags\(0x5B99) rogueShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B9A [Offset = 0x62D01F0, Size = 0xD20]

tags> nametag * rogueVisor
[Index: 0x5B9A, Offset: 0x062D01F0, Size: 0x0D20] rogueVisor.shader

tags> edittag rogueVisor.rmsh
Tag (0x5B9A) rogueVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B9A) rogueVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0074
Bitmap: CachedTagInstance = 0x00000074

tags\(0x5B9A) rogueVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0075
Bitmap: CachedTagInstance = 0x00000075

tags\(0x5B9A) rogueVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0076
Bitmap: CachedTagInstance = 0x00000076

tags\(0x5B9A) rogueVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap rogueMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B98

tags\(0x5B9A) rogueVisor.shader> savetagchanges
Done!

tags\(0x5B9A) rogueVisor.shader> exit

tags> EditTag 0x0079
Tag (0x0079) mp_rogue.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0079) mp_rogue.render_model> SetField Materials[0].RenderMethod rogueShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B99

tags\(0x0079) mp_rogue.render_model> SetField Materials[1].RenderMethod rogueVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005B9A

tags\(0x0079) mp_rogue.render_model> SaveTagChanges
Done!

tags\(0x0079) mp_rogue.render_model> ExitTo tags

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B9B, Offset: 0x062D0F10, Size: 0x00F0] 0x5B9B.bitmap

tags> NameTag * odstMaterial
[Index: 0x5B9B, Offset: 0x062D0F10, Size: 0x00F0] odstMaterial.bitmap

tags> EditTag odstMaterial.bitm
Tag (0x5B9B) odstMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B9B) odstMaterial.bitmap> importbitmap 0 materials\odstMaterial.dds
Importing image data...
Done!

tags\(0x5B9B) odstMaterial.bitmap> savetagchanges
Done!

tags\(0x5B9B) odstMaterial.bitmap> exit

tags> edittag 0x0064
Tag (0x0064) mp_odst_helmet_diffuse.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0064) mp_odst_helmet_diffuse.bitmap> importbitmap 0 base\odstBase.dds
Importing image data...
Done!

tags\(0x0064) mp_odst_helmet_diffuse.bitmap> savetagchanges
Done!

tags\(0x0064) mp_odst_helmet_diffuse.bitmap> exit

tags> edittag 0x0065
Tag (0x0065) mp_odst_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0065) mp_odst_cc.bitmap> importbitmap 0 cc\odst.dds
Importing image data...
Done!

tags\(0x0065) mp_odst_cc.bitmap> savetagchanges
Done!

tags\(0x0065) mp_odst_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B9C [Offset = 0x62D1120, Size = 0xD20]

tags> nametag * odstShader
[Index: 0x5B9C, Offset: 0x062D1120, Size: 0x0D20] odstShader.shader

tags> edittag odstShader.rmsh
Tag (0x5B9C) odstShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B9C) odstShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0064
Bitmap: CachedTagInstance = 0x00000064

tags\(0x5B9C) odstShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0065
Bitmap: CachedTagInstance = 0x00000065

tags\(0x5B9C) odstShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0066
Bitmap: CachedTagInstance = 0x00000066

tags\(0x5B9C) odstShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap odstMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B9B

tags\(0x5B9C) odstShader.shader> savetagchanges
Done!

tags\(0x5B9C) odstShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B9D [Offset = 0x62D1E40, Size = 0xD20]

tags> nametag * odstVisor
[Index: 0x5B9D, Offset: 0x062D1E40, Size: 0x0D20] odstVisor.shader

tags> edittag odstVisor.rmsh
Tag (0x5B9D) odstVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B9D) odstVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x0064
Bitmap: CachedTagInstance = 0x00000064

tags\(0x5B9D) odstVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x0065
Bitmap: CachedTagInstance = 0x00000065

tags\(0x5B9D) odstVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x0066
Bitmap: CachedTagInstance = 0x00000066

tags\(0x5B9D) odstVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap odstMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B9B

tags\(0x5B9D) odstVisor.shader> savetagchanges
Done!

tags\(0x5B9D) odstVisor.shader> exit

tags> EditTag 0x0069
Tag (0x0069) mp_odst.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0069) mp_odst.render_model> SetField Materials[0].RenderMethod bodyShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B7D

tags\(0x0069) mp_odst.render_model> SetField Materials[1].RenderMethod odstShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B9C

tags\(0x0069) mp_odst.render_model> SetField Materials[2].RenderMethod odstVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005B9D

tags\(0x0069) mp_odst.render_model> SaveTagChanges
Done!

tags\(0x0069) mp_odst.render_model> ExitTo tags

tags> 

tags> 

tags> CreateTag bitm
[Index: 0x5B9E, Offset: 0x062D2B60, Size: 0x00F0] 0x5B9E.bitmap

tags> NameTag * ryuMaterial
[Index: 0x5B9E, Offset: 0x062D2B60, Size: 0x00F0] ryuMaterial.bitmap

tags> EditTag ryuMaterial.bitm
Tag (0x5B9E) ryuMaterial.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B9E) ryuMaterial.bitmap> importbitmap 0 materials\ryuMaterial.dds
Importing image data...
Done!

tags\(0x5B9E) ryuMaterial.bitmap> savetagchanges
Done!

tags\(0x5B9E) ryuMaterial.bitmap> exit

tags> edittag 0x004B
Tag (0x004B) mp_ryu.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x004B) mp_ryu.bitmap> importbitmap 0 base\ryuBase.dds
Importing image data...
Done!

tags\(0x004B) mp_ryu.bitmap> savetagchanges
Done!

tags\(0x004B) mp_ryu.bitmap> exit

tags> edittag 0x004C
Tag (0x004C) mp_ryu_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x004C) mp_ryu_cc.bitmap> importbitmap 0 cc\ryu.dds
Importing image data...
Done!

tags\(0x004C) mp_ryu_cc.bitmap> savetagchanges
Done!

tags\(0x004C) mp_ryu_cc.bitmap> exit

tags> DuplicateTag bodyShader.rmsh
Tag duplicated successfully!
New tag: rmsh 00005B9F [Offset = 0x62D2D70, Size = 0xD20]

tags> nametag * ryuShader
[Index: 0x5B9F, Offset: 0x062D2D70, Size: 0x0D20] ryuShader.shader

tags> edittag ryuShader.rmsh
Tag (0x5B9F) ryuShader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5B9F) ryuShader.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x004B
Bitmap: CachedTagInstance = 0x0000004B

tags\(0x5B9F) ryuShader.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x004C
Bitmap: CachedTagInstance = 0x0000004C

tags\(0x5B9F) ryuShader.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x004D
Bitmap: CachedTagInstance = 0x0000004D

tags\(0x5B9F) ryuShader.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap ryuMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B9E

tags\(0x5B9F) ryuShader.shader> savetagchanges
Done!

tags\(0x5B9F) ryuShader.shader> exit

tags> duplicatetag mark6Visor.rmsh
Tag duplicated successfully!
New tag: rmsh 00005BA0 [Offset = 0x62D3A90, Size = 0xD20]

tags> nametag * ryuVisor
[Index: 0x5BA0, Offset: 0x062D3A90, Size: 0x0D20] ryuVisor.shader

tags> edittag ryuVisor.rmsh
Tag (0x5BA0) ryuVisor.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5BA0) ryuVisor.shader> SetField ShaderProperties[0].ShaderMaps[0].Bitmap 0x004B
Bitmap: CachedTagInstance = 0x0000004B

tags\(0x5BA0) ryuVisor.shader> SetField ShaderProperties[0].ShaderMaps[2].Bitmap 0x004C
Bitmap: CachedTagInstance = 0x0000004C

tags\(0x5BA0) ryuVisor.shader> SetField ShaderProperties[0].ShaderMaps[3].Bitmap 0x004D
Bitmap: CachedTagInstance = 0x0000004D

tags\(0x5BA0) ryuVisor.shader> SetField ShaderProperties[0].ShaderMaps[7].Bitmap ryuMaterial.bitm
Bitmap: CachedTagInstance = 0x00005B9E

tags\(0x5BA0) ryuVisor.shader> savetagchanges
Done!

tags\(0x5BA0) ryuVisor.shader> exit

tags> EditTag 0x0050
Tag (0x0050) mp_ryu.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0050) mp_ryu.render_model> SetField Materials[0].RenderMethod ryuShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B9F

tags\(0x0050) mp_ryu.render_model> SetField Materials[1].RenderMethod ryuVisor.rmsh
RenderMethod: CachedTagInstance = 0x00005BA0

tags\(0x0050) mp_ryu.render_model> SaveTagChanges
Done!

tags\(0x0050) mp_ryu.render_model> exit

tags> 

tags> 

tags> edittag 0x007F
Tag (0x007F) mp_katana.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x007F) mp_katana.render_model> SetField Materials[0].RenderMethod ryuShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B9F

tags\(0x007F) mp_katana.render_model> savetagchanges
Done!

tags\(0x007F) mp_katana.render_model> exit

tags> edittag 0x007C
Tag (0x007C) mp_bungie.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x007C) mp_bungie.render_model> SetField Materials[0].RenderMethod regulShader.rmsh
RenderMethod: CachedTagInstance = 0x00005B8D

tags\(0x007C) mp_bungie.render_model> savetagchanges
Done!

tags\(0x007C) mp_bungie.render_model> exit

tags> edittag 0x0083
Tag (0x0083) mp_masterchief_personal_decals_cc.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x0083) mp_masterchief_personal_decals_cc.bitmap> importbitmap 0 decals\personalDecal.dds
Importing image data...
Done!

tags\(0x0083) mp_masterchief_personal_decals_cc.bitmap> savetagchanges
Done!

tags\(0x0083) mp_masterchief_personal_decals_cc.bitmap> exit

tags> 

tags> 

tags> dumplog H3BA.log
