Tag Tool [1.5.6678.2466]

Please report any bugs and/or feature requests at
<https://gitlab.com/TheGuardians/TagTool/issues>.

Enter "help" to list available commands. Enter "exit" to quit.

tags> echo   Installing Halo Reach Sniper Rifle
Installing Halo Reach Sniper Rifle 
tags> 

tags> createtag bitm
[Index: 0x5AF4, Offset: 0x0628A080, Size: 0x00F0] 0x5AF4.bitmap

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body
[Index: 0x5AF4, Offset: 0x0628A080, Size: 0x00F0] objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body.bitmap

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body.bitmap
Tag (0x5AF4) sniper_body.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AF4) sniper_body.bitmap> importbitmap 0 DDS\sniper_rifle_diffuse.dds
Importing image data...
Done!

tags\(0x5AF4) sniper_body.bitmap> savetagchanges
Done!

tags\(0x5AF4) sniper_body.bitmap> exit

tags> 

tags> createtag bitm
[Index: 0x5AF5, Offset: 0x0628A280, Size: 0x00F0] 0x5AF5.bitmap

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_bump
[Index: 0x5AF5, Offset: 0x0628A280, Size: 0x00F0] objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_bump.bitmap

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_bump.bitmap
Tag (0x5AF5) sniper_body_bump.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AF5) sniper_body_bump.bitmap> importbitmap 0 DDS\sniper_rifle_normal.dds
Importing image data...
Done!

tags\(0x5AF5) sniper_body_bump.bitmap> savetagchanges
Done!

tags\(0x5AF5) sniper_body_bump.bitmap> exit

tags> 

tags> createtag bitm
[Index: 0x5AF6, Offset: 0x0628A480, Size: 0x00F0] 0x5AF6.bitmap

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\mat
[Index: 0x5AF6, Offset: 0x0628A480, Size: 0x00F0] objects\weapons\sniper\sniper_rifle\reach_sniper\mat.bitmap

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\mat.bitmap
Tag (0x5AF6) mat.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AF6) mat.bitmap> importbitmap 0 DDS\mat.dds
Importing image data...
Done!

tags\(0x5AF6) mat.bitmap> savetagchanges
Done!

tags\(0x5AF6) mat.bitmap> exit

tags> 

tags> duplicatetag 0x1F95
Tag duplicated successfully!
New tag: rmsh 00005AF7 [Offset = 0x628A680, Size = 0xA70]

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader
[Index: 0x5AF7, Offset: 0x0628A680, Size: 0x0A70] objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
Tag (0x5AF7) sniper_body_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].template 0x50AD
Template: CachedTagInstance = 0x000050AD

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].shadermaps[0].bitmap objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body.bitmap
Bitmap: CachedTagInstance = 0x00005AF4

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].shadermaps[2].bitmap objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_bump.bitmap
Bitmap: CachedTagInstance = 0x00005AF5

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].shadermaps[5].bitmap objects\weapons\sniper\sniper_rifle\reach_sniper\mat.bitmap
Bitmap: CachedTagInstance = 0x00005AF6

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[2].arg1 0.3647059
Arg1: Single = 0.3647059

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[2].arg2 0.3647059
Arg2: Single = 0.3647059

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[2].arg3 0.3647059
Arg3: Single = 0.3647059

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[2].arg4 1
Arg4: Single = 1

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[6].arg1 10
Arg1: Single = 10

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[6].arg2 10
Arg2: Single = 10

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[6].arg3 10
Arg3: Single = 10

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[6].arg4 10
Arg4: Single = 10

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[8].arg1 0.454902
Arg1: Single = 0.454902

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[8].arg2 0.4039216
Arg2: Single = 0.4039216

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[8].arg3 0.2627451
Arg3: Single = 0.2627451

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[8].arg4 1
Arg4: Single = 1

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[9].arg1 0.4784314
Arg1: Single = 0.4784314

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[9].arg2 0.4784314
Arg2: Single = 0.4784314

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[9].arg3 0.4784314
Arg3: Single = 0.4784314

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[9].arg4 1
Arg4: Single = 1

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[10].arg1 0.5019608
Arg1: Single = 0.5019608

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[10].arg2 0.5019608
Arg2: Single = 0.5019608

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[10].arg3 0.5019608
Arg3: Single = 0.5019608

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[10].arg4 1
Arg4: Single = 1

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[12].arg1 0.5019608
Arg1: Single = 0.5019608

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[12].arg2 0.5019608
Arg2: Single = 0.5019608

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[12].arg3 0.5019608
Arg3: Single = 0.5019608

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[12].arg4 1
Arg4: Single = 1

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[13].arg1 0.5
Arg1: Single = 0.5

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[13].arg2 0.5
Arg2: Single = 0.5

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[13].arg3 0.5
Arg3: Single = 0.5

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[13].arg4 0.5
Arg4: Single = 0.5

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[14].arg1 0.1
Arg1: Single = 0.1

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[14].arg2 0.1
Arg2: Single = 0.1

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[14].arg3 0.1
Arg3: Single = 0.1

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[14].arg4 0.1
Arg4: Single = 0.1

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[15].arg1 0.2
Arg1: Single = 0.2

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[15].arg2 0.2
Arg2: Single = 0.2

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[15].arg3 0.2
Arg3: Single = 0.2

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[15].arg4 0.2
Arg4: Single = 0.2

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[16].arg1 0.5
Arg1: Single = 0.5

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[16].arg2 0.5
Arg2: Single = 0.5

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[16].arg3 0.5
Arg3: Single = 0.5

tags\(0x5AF7) sniper_body_shader.shader> setfield shaderproperties[0].arguments[16].arg4 0.5
Arg4: Single = 0.5

tags\(0x5AF7) sniper_body_shader.shader> savetagchanges
Done!

tags\(0x5AF7) sniper_body_shader.shader> exit

tags> 

tags> duplicatetag 0x5527
Tag duplicated successfully!
New tag: rmsh 00005AF8 [Offset = 0x628B100, Size = 0x9C0]

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_rubber_shader
[Index: 0x5AF8, Offset: 0x0628B100, Size: 0x09C0] objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_rubber_shader.shader

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_rubber_shader.shader
Tag (0x5AF8) sniper_rubber_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].shadermaps[0].bitmap objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body.bitmap
Bitmap: CachedTagInstance = 0x00005AF4

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].shadermaps[2].bitmap objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_bump.bitmap
Bitmap: CachedTagInstance = 0x00005AF5

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].shadermaps[4].bitmap objects\weapons\sniper\sniper_rifle\reach_sniper\mat.bitmap
Bitmap: CachedTagInstance = 0x00005AF6

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[0].arg1 1
Arg1: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[0].arg2 1
Arg2: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[1].arg1 60
Arg1: Single = 60

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[1].arg2 60
Arg2: Single = 60

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[2].arg1 1
Arg1: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[2].arg2 1
Arg2: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[2].arg3 1
Arg3: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[2].arg4 1
Arg4: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[4].arg1 60
Arg1: Single = 60

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[4].arg2 60
Arg2: Single = 60

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[6].arg1 2
Arg1: Single = 2

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[6].arg2 2
Arg2: Single = 2

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[6].arg3 2
Arg3: Single = 2

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[6].arg4 2
Arg4: Single = 2

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[7].arg1 1
Arg1: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[7].arg2 1
Arg2: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[7].arg3 1
Arg3: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[7].arg4 1
Arg4: Single = 1

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[8].arg1 0.7254902
Arg1: Single = 0.7254902

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[8].arg2 0.7843138
Arg2: Single = 0.7843138

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[8].arg3 0.9137256
Arg3: Single = 0.9137256

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[9].arg1 0.08627451
Arg1: Single = 0.08627451

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[9].arg2 0.1294118
Arg2: Single = 0.1294118

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[9].arg3 0.2235294
Arg3: Single = 0.2235294

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[12].arg1 0.2
Arg1: Single = 0.2

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[12].arg2 0.2
Arg2: Single = 0.2

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[12].arg3 0.2
Arg3: Single = 0.2

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[12].arg4 0.2
Arg4: Single = 0.2

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[11].arg1 0.5
Arg1: Single = 0.5

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[11].arg2 0.5
Arg2: Single = 0.5

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[11].arg3 0.5
Arg3: Single = 0.5

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[11].arg4 0.5
Arg4: Single = 0.5

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[16].arg1 0.75
Arg1: Single = 0.75

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[16].arg2 0.75
Arg2: Single = 0.75

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[16].arg3 0.75
Arg3: Single = 0.75

tags\(0x5AF8) sniper_rubber_shader.shader> setfield shaderproperties[0].arguments[16].arg4 0.75
Arg4: Single = 0.75

tags\(0x5AF8) sniper_rubber_shader.shader> savetagchanges
Done!

tags\(0x5AF8) sniper_rubber_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AF9, Offset: 0x0628BAC0, Size: 0x00F0] 0x5AF9.bitmap

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\scope
[Index: 0x5AF9, Offset: 0x0628BAC0, Size: 0x00F0] objects\weapons\sniper\sniper_rifle\reach_sniper\scope.bitmap

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\scope.bitmap
Tag (0x5AF9) scope.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AF9) scope.bitmap> importbitmap 0 DDS\sniper_rifle_scope_illum.dds
Importing image data...
Done!

tags\(0x5AF9) scope.bitmap> savetagchanges
Done!

tags\(0x5AF9) scope.bitmap> exit

tags> 

tags> duplicatetag 0x0EE6
Tag duplicated successfully!
New tag: rmsh 00005AFA [Offset = 0x628BCC0, Size = 0x3D0]

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\scope_shader
[Index: 0x5AFA, Offset: 0x0628BCC0, Size: 0x03D0] objects\weapons\sniper\sniper_rifle\reach_sniper\scope_shader.shader

tags> importtag objects\weapons\sniper\sniper_rifle\reach_sniper\scope_shader.shader tags\IllumTag
Imported 0x3D0 bytes.

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\scope_shader.shader
Tag (0x5AFA) scope_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AFA) scope_shader.shader> setfield shaderproperties[0].shadermaps[0].bitmap objects\weapons\sniper\sniper_rifle\reach_sniper\scope.bitmap
Bitmap: CachedTagInstance = 0x00005AF9

tags\(0x5AFA) scope_shader.shader> setfield shaderproperties[0].arguments[2].arg1 0.654902
Arg1: Single = 0.654902

tags\(0x5AFA) scope_shader.shader> setfield shaderproperties[0].arguments[2].arg2 1
Arg2: Single = 1

tags\(0x5AFA) scope_shader.shader> setfield shaderproperties[0].arguments[2].arg3 0.1294118
Arg3: Single = 0.1294118

tags\(0x5AFA) scope_shader.shader> setfield shaderproperties[0].arguments[2].arg4 1
Arg4: Single = 1

tags\(0x5AFA) scope_shader.shader> savetagchanges
Done!

tags\(0x5AFA) scope_shader.shader> exit

tags> 

tags> createtag rmhg
[Index: 0x5AFB, Offset: 0x0628C0A0, Size: 0x0080] 0x5AFB.shader_halogram

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\screen_shader
[Index: 0x5AFB, Offset: 0x0628C0A0, Size: 0x0080] objects\weapons\sniper\sniper_rifle\reach_sniper\screen_shader.shader_halogram

tags> importtag objects\weapons\sniper\sniper_rifle\reach_sniper\screen_shader.shader_halogram tags\HologramTag
Imported 0x7B0 bytes.

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\screen_shader.shader_halogram
Tag (0x5AFB) screen_shader.shader_halogram has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].shadermaps[0].bitmap 0x0343
Bitmap: CachedTagInstance = 0x00000343

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].shadermaps[2].bitmap 0x0343
Bitmap: CachedTagInstance = 0x00000343

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].shadermaps[3].bitmap 0x0343
Bitmap: CachedTagInstance = 0x00000343

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].shadermaps[4].bitmap 0x0379
Bitmap: CachedTagInstance = 0x00000379

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].arguments[3].arg1 0.6
Arg1: Single = 0.6

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].arguments[3].arg2 0.6
Arg2: Single = 0.6

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].arguments[3].arg3 0.185
Arg3: Single = 0.185

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].arguments[3].arg4 0.78
Arg4: Single = 0.78

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].arguments[4].arg1 0.6941177
Arg1: Single = 0.6941177

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].arguments[4].arg2 0.8901961
Arg2: Single = 0.8901961

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].arguments[4].arg3 0.4470589
Arg3: Single = 0.4470589

tags\(0x5AFB) screen_shader.shader_halogram> setfield shaderproperties[0].arguments[4].arg4 1
Arg4: Single = 1

tags\(0x5AFB) screen_shader.shader_halogram> savetagchanges
Done!

tags\(0x5AFB) screen_shader.shader_halogram> exit

tags> 

tags> createtag bitm
[Index: 0x5AFC, Offset: 0x0628C840, Size: 0x00F0] 0x5AFC.bitmap

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals
[Index: 0x5AFC, Offset: 0x0628C840, Size: 0x00F0] objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals.bitmap

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals.bitmap
Tag (0x5AFC) unsc_decals.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AFC) unsc_decals.bitmap> importbitmap 0 DDS\unsc_decals.dds
Importing image data...
Done!

tags\(0x5AFC) unsc_decals.bitmap> savetagchanges
Done!

tags\(0x5AFC) unsc_decals.bitmap> exit

tags> 

tags> createtag rmsh
[Index: 0x5AFD, Offset: 0x0628CA40, Size: 0x0080] 0x5AFD.shader

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals_shader
[Index: 0x5AFD, Offset: 0x0628CA40, Size: 0x0080] objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals_shader.shader

tags> importtag objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals_shader.shader tags\TransparentSupportTag
Imported 0x1D0 bytes.

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals_shader.shader
Tag (0x5AFD) unsc_decals_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AFD) unsc_decals_shader.shader> setfield shaderproperties[0].shadermaps[0].bitmap objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals.bitmap
Bitmap: CachedTagInstance = 0x00005AFC

tags\(0x5AFD) unsc_decals_shader.shader> setfield shaderproperties[0].shadermaps[1].bitmap 0x0343
Bitmap: CachedTagInstance = 0x00000343

tags\(0x5AFD) unsc_decals_shader.shader> savetagchanges
Done!

tags\(0x5AFD) unsc_decals_shader.shader> exit

tags> 

tags> createtag bitm
[Index: 0x5AFE, Offset: 0x0628CC20, Size: 0x00F0] 0x5AFE.bitmap

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\lens
[Index: 0x5AFE, Offset: 0x0628CC20, Size: 0x00F0] objects\weapons\sniper\sniper_rifle\reach_sniper\lens.bitmap

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\lens.bitmap
Tag (0x5AFE) lens.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AFE) lens.bitmap> importbitmap 0 DDS\sniper_rifle_scope_alpha.dds
Importing image data...
Done!

tags\(0x5AFE) lens.bitmap> savetagchanges
Done!

tags\(0x5AFE) lens.bitmap> exit

tags> 

tags> createtag rmsh
[Index: 0x5AFF, Offset: 0x0628CE20, Size: 0x0080] 0x5AFF.shader

tags> nametag * objects\weapons\sniper\sniper_rifle\reach_sniper\lens_shader
[Index: 0x5AFF, Offset: 0x0628CE20, Size: 0x0080] objects\weapons\sniper\sniper_rifle\reach_sniper\lens_shader.shader

tags> importtag objects\weapons\sniper\sniper_rifle\reach_sniper\lens_shader.shader tags\TransparentSupportTag
Imported 0x1D0 bytes.

tags> edittag objects\weapons\sniper\sniper_rifle\reach_sniper\lens_shader.shader
Tag (0x5AFF) lens_shader.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5AFF) lens_shader.shader> setfield shaderproperties[0].shadermaps[0].bitmap objects\weapons\sniper\sniper_rifle\reach_sniper\lens.bitmap
Bitmap: CachedTagInstance = 0x00005AFE

tags\(0x5AFF) lens_shader.shader> setfield shaderproperties[0].shadermaps[1].bitmap 0x0343
Bitmap: CachedTagInstance = 0x00000343

tags\(0x5AFF) lens_shader.shader> savetagchanges
Done!

tags\(0x5AFF) lens_shader.shader> exit

tags> 

tags> importtag 0x1F8D tags\sniper.render_model
Imported 0xBA0 bytes.

tags> edittag 0x1F8D
Tag (0x1F8D) fp_sniper_rifle.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x1F8D) fp_sniper_rifle.render_model> replacerendergeometry tags\sniper.dae
Building render_geometry...done.
Writing render_model tag data...done.
Replaced render_geometry successfully.

tags\(0x1F8D) fp_sniper_rifle.render_model> savetagchanges
Done!

tags\(0x1F8D) fp_sniper_rifle.render_model> exit

tags> edittag 0x1F8D
Tag (0x1F8D) fp_sniper_rifle.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield markergroups[1].markers[0].translation 0.06916446 -0.003040792 -0.03955528
Translation: RealPoint3d = { X: 0.06916446, Y: -0.003040792, Z: -0.03955528 }

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[0].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[1].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[2].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[3].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\lens_shader.shader
RenderMethod: CachedTagInstance = 0x00005AFF

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[4].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[5].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_rubber_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF8

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[6].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[8].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\screen_shader.shader_halogram
RenderMethod: CachedTagInstance = 0x00005AFB

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[9].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\scope_shader.shader
RenderMethod: CachedTagInstance = 0x00005AFA

tags\(0x1F8D) fp_sniper_rifle.render_model> setfield materials[10].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals_shader.shader
RenderMethod: CachedTagInstance = 0x00005AFD

tags\(0x1F8D) fp_sniper_rifle.render_model> savetagchanges
Done!

tags\(0x1F8D) fp_sniper_rifle.render_model> exit

tags> 

tags> importtag 0x203C tags\sniper3p.render_model
Imported 0xA60 bytes.

tags> edittag 0x203C
Tag (0x203C) sniper_rifle.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x203C) sniper_rifle.render_model> replacerendergeometry tags\sniper3p.dae
Building render_geometry...done.
Writing render_model tag data...done.
Replaced render_geometry successfully.

tags\(0x203C) sniper_rifle.render_model> setfield materials[0].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x203C) sniper_rifle.render_model> setfield materials[1].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x203C) sniper_rifle.render_model> setfield materials[2].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x203C) sniper_rifle.render_model> setfield materials[3].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\lens_shader.shader
RenderMethod: CachedTagInstance = 0x00005AFF

tags\(0x203C) sniper_rifle.render_model> setfield materials[4].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x203C) sniper_rifle.render_model> setfield materials[5].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_rubber_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF8

tags\(0x203C) sniper_rifle.render_model> setfield materials[6].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\sniper_body_shader.shader
RenderMethod: CachedTagInstance = 0x00005AF7

tags\(0x203C) sniper_rifle.render_model> setfield materials[7].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\scope_shader.shader
RenderMethod: CachedTagInstance = 0x00005AFA

tags\(0x203C) sniper_rifle.render_model> setfield materials[8].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\screen_shader.shader_halogram
RenderMethod: CachedTagInstance = 0x00005AFB

tags\(0x203C) sniper_rifle.render_model> setfield materials[9].rendermethod objects\weapons\sniper\sniper_rifle\reach_sniper\unsc_decals_shader.shader
RenderMethod: CachedTagInstance = 0x00005AFD

tags\(0x203C) sniper_rifle.render_model> savetagchanges
Done!

tags\(0x203C) sniper_rifle.render_model> exit

tags> 

tags> dumplog reachSniper.log
