Tag Tool [1.0.5938.29681]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...28910 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 9:40 AM.
Reading stringIDs...37522 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> --DEPS_FIXUP--
Unrecognized command: --DEPS_FIXUP--
Use "help" to list available commands.

tags.dat> dep add 6E23 6E24

tags.dat> dep add 6E23 6E25

tags.dat> dep remove 6E23 348A

tags.dat> dep remove 6E23 3489

tags.dat> dep remove 6E25 3489

tags.dat> 

tags.dat> dep add 6E23 6E26

tags.dat> dep add 6E23 6E27
Added dependency on tag 00006E27.

tags.dat> dep add 6E23 6E28
Added dependency on tag 00006E28.

tags.dat> dep add 6E23 6E29

tags.dat> dep add 6E23 6E2A
Added dependency on tag 00006E2A.

tags.dat> dep add 6E23 6E2B
Added dependency on tag 00006E2B.

tags.dat> dep add 6E23 6E2C

tags.dat> dep add 6E23 6E2D
Added dependency on tag 00006E2D.

tags.dat> dep add 6E23 6E2E
Added dependency on tag 00006E2E.

tags.dat> dep add 6E23 6E2F
Added dependency on tag 00006E2F.

tags.dat> dep add 6E23 6E30
Added dependency on tag 00006E30.

tags.dat> dep add 6E23 6E31
Added dependency on tag 00006E31.

tags.dat> dep add 6E23 6E32
Added dependency on tag 00006E32.

tags.dat> dep add 6E23 6E33
Added dependency on tag 00006E33.

tags.dat> dep add 6E23 6E34
Added dependency on tag 00006E34.

tags.dat> dep add 6E23 6E35
Added dependency on tag 00006E35.

tags.dat> dep add 6E23 6E36
Added dependency on tag 00006E36.

tags.dat> dep add 6E23 6E37
Added dependency on tag 00006E37.

tags.dat> dep add 6E23 6E38
Added dependency on tag 00006E38.

tags.dat> dep add 6E23 6E39
Added dependency on tag 00006E39.

tags.dat> dep add 6E23 6E3A
Added dependency on tag 00006E3A.

tags.dat> dep add 6E23 6E3B
Added dependency on tag 00006E3B.

tags.dat> dep add 6E23 6E3C

tags.dat> dep add 6E23 6E3D
Added dependency on tag 00006E3D.

tags.dat> dep add 6E23 6E3E
Added dependency on tag 00006E3E.

tags.dat> dep add 6E23 6E3F
Added dependency on tag 00006E3F.

tags.dat> dep add 6E23 6E44
Added dependency on tag 00006E44.

tags.dat> dep add 6E23 6E45
Added dependency on tag 00006E45.

tags.dat> dep add 6E23 6E46
Added dependency on tag 00006E46.

tags.dat> dep add 6E23 6E47
Added dependency on tag 00006E47.

tags.dat> dep add 6E23 6E48
Added dependency on tag 00006E48.

tags.dat> dep add 6E23 6E49
Added dependency on tag 00006E49.

tags.dat> dep add 6E23 6E4A
Added dependency on tag 00006E4A.

tags.dat> dep add 6E23 6E4B
Added dependency on tag 00006E4B.

tags.dat> dep add 6E23 6E4C
Added dependency on tag 00006E4C.

tags.dat> dep add 6E43 6E23
Added dependency on tag 00006E23.

tags.dat> 

tags.dat> --DEPS--
Unrecognized command: --DEPS--
Use "help" to list available commands.

tags.dat> dep add 6E23 27D6
Added dependency on tag 000027D6.

tags.dat> dep add 6E23 27D7
Added dependency on tag 000027D7.

tags.dat> dep add 6E23 481A
Added dependency on tag 0000481A.

tags.dat> dep add 6E23 4965
Added dependency on tag 00004965.

tags.dat> dep add 6E23 4DEF
Added dependency on tag 00004DEF.

tags.dat> dep add 6E23 4DFA
Added dependency on tag 00004DFA.

tags.dat> dep add 6E23 4E08
Added dependency on tag 00004E08.

tags.dat> dep add 6E23 4E10
Added dependency on tag 00004E10.

tags.dat> dep add 6E23 4E20
Added dependency on tag 00004E20.

tags.dat> dep add 6E23 4E46
Added dependency on tag 00004E46.

tags.dat> dep add 6E23 4E58
Added dependency on tag 00004E58.

tags.dat> dep add 6E23 517A
Added dependency on tag 0000517A.

tags.dat> dep add 6E23 5189
Added dependency on tag 00005189.

tags.dat> 

tags.dat> dep add 6E23 6D83
Added dependency on tag 00006D83.

tags.dat> dep add 6E23 6D84
Added dependency on tag 00006D84.

tags.dat> dep add 6E23 6D85
Added dependency on tag 00006D85.

tags.dat> dep add 6E23 6D86
Added dependency on tag 00006D86.

tags.dat> dep add 6E23 6D87
Added dependency on tag 00006D87.

tags.dat> dep add 6E23 6D88
Added dependency on tag 00006D88.

tags.dat> dep add 6E23 6D89
Added dependency on tag 00006D89.

tags.dat> dep add 6E23 6D8A
Added dependency on tag 00006D8A.

tags.dat> dep add 6E23 6D8B
Added dependency on tag 00006D8B.

tags.dat> dep add 6E23 6D8C
Added dependency on tag 00006D8C.

tags.dat> dep add 6E23 6D8D
Added dependency on tag 00006D8D.

tags.dat> dep add 6E23 6D8E
Added dependency on tag 00006D8E.

tags.dat> dep add 6E23 6D8F
Added dependency on tag 00006D8F.

tags.dat> dep add 6E23 6D90
Added dependency on tag 00006D90.

tags.dat> dep add 6E23 6D91
Added dependency on tag 00006D91.

tags.dat> dep add 6E23 6D92
Added dependency on tag 00006D92.

tags.dat> dep add 6E23 6D93
Added dependency on tag 00006D93.

tags.dat> dep add 6E23 6D94
Added dependency on tag 00006D94.

tags.dat> dep add 6E23 6D95
Added dependency on tag 00006D95.

tags.dat> dep add 6E23 6D96
Added dependency on tag 00006D96.

tags.dat> dep add 6E23 6D97
Added dependency on tag 00006D97.

tags.dat> dep add 6E23 6D98
Added dependency on tag 00006D98.

tags.dat> dep add 6E23 6D99
Added dependency on tag 00006D99.

tags.dat> dep add 6E23 6D9A
Added dependency on tag 00006D9A.

tags.dat> dep add 6E23 6D9B
Added dependency on tag 00006D9B.

tags.dat> dep add 6E23 6D9C
Added dependency on tag 00006D9C.

tags.dat> dep add 6E23 6D9D
Added dependency on tag 00006D9D.

tags.dat> dep add 6E23 6D9E
Added dependency on tag 00006D9E.

tags.dat> dep add 6E23 6D9F
Added dependency on tag 00006D9F.

tags.dat> dep add 6E23 6DA0
Added dependency on tag 00006DA0.

tags.dat> dep add 6E23 6DA1
Added dependency on tag 00006DA1.

tags.dat> dep add 6E23 6DA2
Added dependency on tag 00006DA2.

tags.dat> dep add 6E23 6DA3
Added dependency on tag 00006DA3.

tags.dat> dep add 6E23 6DA4
Added dependency on tag 00006DA4.

tags.dat> dep add 6E23 6DA5
Added dependency on tag 00006DA5.

tags.dat> dep add 6E23 6DA6
Added dependency on tag 00006DA6.

tags.dat> dep add 6E23 6DA7
Added dependency on tag 00006DA7.

tags.dat> dep add 6E23 6DA8
Added dependency on tag 00006DA8.

tags.dat> dep add 6E23 6DA9
Added dependency on tag 00006DA9.

tags.dat> dep add 6E23 6DAA
Added dependency on tag 00006DAA.

tags.dat> dep add 6E23 6DAB
Added dependency on tag 00006DAB.

tags.dat> dep add 6E23 6DAC
Added dependency on tag 00006DAC.

tags.dat> dep add 6E23 6DAD
Added dependency on tag 00006DAD.

tags.dat> dep add 6E23 6DAE
Added dependency on tag 00006DAE.

tags.dat> dep add 6E23 6DAF
Added dependency on tag 00006DAF.

tags.dat> dep add 6E23 6DB0
Added dependency on tag 00006DB0.

tags.dat> dep add 6E23 6DB1
Added dependency on tag 00006DB1.

tags.dat> dep add 6E23 6DB2
Added dependency on tag 00006DB2.

tags.dat> dep add 6E23 6DB3
Added dependency on tag 00006DB3.

tags.dat> dep add 6E23 6DB4
Added dependency on tag 00006DB4.

tags.dat> dep add 6E23 6DB5
Added dependency on tag 00006DB5.

tags.dat> dep add 6E23 6DB6
Added dependency on tag 00006DB6.

tags.dat> dep add 6E23 6DB7
Added dependency on tag 00006DB7.

tags.dat> dep add 6E23 6DB8
Added dependency on tag 00006DB8.

tags.dat> dep add 6E23 6DB9
Added dependency on tag 00006DB9.

tags.dat> dep add 6E23 6DBA
Added dependency on tag 00006DBA.

tags.dat> dep add 6E23 6DBB
Added dependency on tag 00006DBB.

tags.dat> dep add 6E23 6DBC
Added dependency on tag 00006DBC.

tags.dat> dep add 6E23 6DBD
Added dependency on tag 00006DBD.

tags.dat> dep add 6E23 6DBE
Added dependency on tag 00006DBE.

tags.dat> dep add 6E23 6DBF

tags.dat> dep add 6E23 6DC0
Added dependency on tag 00006DC0.

tags.dat> dep add 6E23 6DC1
Added dependency on tag 00006DC1.

tags.dat> dep add 6E23 6DC2
Added dependency on tag 00006DC2.

tags.dat> dep add 6E23 6DC3
Added dependency on tag 00006DC3.

tags.dat> dep add 6E23 6DC4

tags.dat> dep add 6E23 6DC5
Added dependency on tag 00006DC5.

tags.dat> dep add 6E23 6DC6
Added dependency on tag 00006DC6.

tags.dat> dep add 6E23 6DC7
Added dependency on tag 00006DC7.

tags.dat> dep add 6E23 6DC8
Added dependency on tag 00006DC8.

tags.dat> dep add 6E23 6DC9

tags.dat> dep add 6E23 6DCA
Added dependency on tag 00006DCA.

tags.dat> dep add 6E23 6DCB
Added dependency on tag 00006DCB.

tags.dat> dep add 6E23 6DCC
Added dependency on tag 00006DCC.

tags.dat> dep add 6E23 6DCD
Added dependency on tag 00006DCD.

tags.dat> dep add 6E23 6DCE

tags.dat> dep add 6E23 6DCF
Added dependency on tag 00006DCF.

tags.dat> dep add 6E23 6DD0
Added dependency on tag 00006DD0.

tags.dat> dep add 6E23 6DD1
Added dependency on tag 00006DD1.

tags.dat> dep add 6E23 6DD2
Added dependency on tag 00006DD2.

tags.dat> dep add 6E23 6DD3

tags.dat> dep add 6E23 6DD4
Added dependency on tag 00006DD4.

tags.dat> dep add 6E23 6DD5
Added dependency on tag 00006DD5.

tags.dat> dep add 6E23 6DD6
Added dependency on tag 00006DD6.

tags.dat> dep add 6E23 6DD7
Added dependency on tag 00006DD7.

tags.dat> dep add 6E23 6DD8

tags.dat> dep add 6E23 6DD9
Added dependency on tag 00006DD9.

tags.dat> dep add 6E23 6DDA
Added dependency on tag 00006DDA.

tags.dat> dep add 6E23 6DDB
Added dependency on tag 00006DDB.

tags.dat> dep add 6E23 6DDC
Added dependency on tag 00006DDC.

tags.dat> dep add 6E23 6DDD

tags.dat> dep add 6E23 6DDE
Added dependency on tag 00006DDE.

tags.dat> dep add 6E23 6DDF
Added dependency on tag 00006DDF.

tags.dat> dep add 6E23 6DE0
Added dependency on tag 00006DE0.

tags.dat> dep add 6E23 6DE1
Added dependency on tag 00006DE1.

tags.dat> dep add 6E23 6DE2

tags.dat> dep add 6E23 6DE3
Added dependency on tag 00006DE3.

tags.dat> dep add 6E23 6DE4
Added dependency on tag 00006DE4.

tags.dat> dep add 6E23 6DE5
Added dependency on tag 00006DE5.

tags.dat> dep add 6E23 6DE6
Added dependency on tag 00006DE6.

tags.dat> dep add 6E23 6DE7
Added dependency on tag 00006DE7.

tags.dat> dep add 6E23 6DE8

tags.dat> dep add 6E23 6DE9
Added dependency on tag 00006DE9.

tags.dat> dep add 6E23 6DEA

tags.dat> dep add 6E23 6DEB
Added dependency on tag 00006DEB.

tags.dat> dep add 6E23 6DEC

tags.dat> dep add 6E23 6DED
Added dependency on tag 00006DED.

tags.dat> dep add 6E23 6DEE

tags.dat> dep add 6E23 6DEF
Added dependency on tag 00006DEF.

tags.dat> dep add 6E23 6DF0
Added dependency on tag 00006DF0.

tags.dat> dep add 6E23 6DF1
Added dependency on tag 00006DF1.

tags.dat> dep add 6E23 6DF2
Added dependency on tag 00006DF2.

tags.dat> dep add 6E23 6DF3
Added dependency on tag 00006DF3.

tags.dat> dep add 6E23 6DF4
Added dependency on tag 00006DF4.

tags.dat> dep add 6E23 6DF5
Added dependency on tag 00006DF5.

tags.dat> dep add 6E23 6DF6
Added dependency on tag 00006DF6.

tags.dat> dep add 6E23 6DF7
Added dependency on tag 00006DF7.

tags.dat> dep add 6E23 6DF8
Added dependency on tag 00006DF8.

tags.dat> dep add 6E23 6DF9

tags.dat> dep add 6E23 6DFA
Added dependency on tag 00006DFA.

tags.dat> dep add 6E23 6DFB
Added dependency on tag 00006DFB.

tags.dat> dep add 6E23 6DFC
Added dependency on tag 00006DFC.

tags.dat> dep add 6E23 6DFD
Added dependency on tag 00006DFD.

tags.dat> dep add 6E23 6DFE

tags.dat> dep add 6E23 6DFF
Added dependency on tag 00006DFF.

tags.dat> dep add 6E23 6E00

tags.dat> dep add 6E23 6E01
Added dependency on tag 00006E01.

tags.dat> dep add 6E23 6E02

tags.dat> dep add 6E23 6E03
Added dependency on tag 00006E03.

tags.dat> dep add 6E23 6E04
Added dependency on tag 00006E04.

tags.dat> dep add 6E23 6E05
Added dependency on tag 00006E05.

tags.dat> dep add 6E23 6E06
Added dependency on tag 00006E06.

tags.dat> dep add 6E23 6E07
Added dependency on tag 00006E07.

tags.dat> dep add 6E23 6E08
Added dependency on tag 00006E08.

tags.dat> dep add 6E23 6E09
Added dependency on tag 00006E09.

tags.dat> dep add 6E23 6E0A
Added dependency on tag 00006E0A.

tags.dat> 

tags.dat> dumplog x_Forge-x5.txt
