Tag Tool [1.0.5938.29681]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...28910 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 9:40 AM.
Reading stringIDs...37522 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> --TAG_SETUP--
Unrecognized command: --TAG_SETUP--
Use "help" to list available commands.

tags.dat> extract 3314 x_UserMods\BUNGIE_HLMT.tag full
Wrote 0x2B0 bytes to x_UserMods\BUNGIE_HLMT.tag.
The tag's main struct will be at offset 0xF0.

tags.dat> extract 3317 x_UserMods\BUNGIE_MODE.tag full
Wrote 0x560 bytes to x_UserMods\BUNGIE_MODE.tag.
The tag's main struct will be at offset 0x390.

tags.dat> extract 3314 x_UserMods\ETERNAL_HLMT.tag full
Wrote 0x2B0 bytes to x_UserMods\ETERNAL_HLMT.tag.
The tag's main struct will be at offset 0xF0.

tags.dat> extract 3317 x_UserMods\ETERNAL_MODE.tag full
Wrote 0x560 bytes to x_UserMods\ETERNAL_MODE.tag.
The tag's main struct will be at offset 0x390.

tags.dat> import 6F4D x_UserMods\BUNGIE_SCEN.tag full
Imported 0x240 bytes.

tags.dat> import 6F4E x_UserMods\BUNGIE_HLMT.tag full
Imported 0x2B0 bytes.

tags.dat> import 6F4F x_UserMods\BUNGIE_MODE.tag full
Imported 0x560 bytes.

tags.dat> import 6F50 x_UserMods\ETERNAL_SCEN.tag full
Imported 0x240 bytes.

tags.dat> import 6F51 x_UserMods\ETERNAL_HLMT.tag full
Imported 0x2B0 bytes.

tags.dat> import 6F52 x_UserMods\ETERNAL_MODE.tag full
Imported 0x560 bytes.

tags.dat> import 6F53 x_UserMods\BUNGIE_EFFE.tag full
Imported 0x19F0 bytes.

tags.dat> import 6F54 x_UserMods\ETERNAL_EFFE.tag full
Imported 0x19F0 bytes.

tags.dat> 

tags.dat> --MODEL_PORT--
Unrecognized command: --MODEL_PORT--
Use "help" to list available commands.

tags.dat> modeltest 6F4F x_UserMods\Assets\Models\Marker\FX.dae
Info,  T6572: Load x_UserMods\Assets\Models\Marker\FX.dae

Info,  T6572: Found a matching importer for this file format

Info,  T6572: Import root directory is 'x_UserMods\Assets\Models\Marker\'

Info,  T6572: Entering post processing pipeline

Info,  T6572: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T6572: Kept 0 lights and 0 cameras

Info,  T6572: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T6572: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T6572: CalcTangentsProcess finished. Tangents have been calculated

Info,  T6572: JoinVerticesProcess finished | Verts in: 2880 out: 1934 | ~32.8%

Info,  T6572: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> modeltest 6F52 x_UserMods\Assets\Models\Marker\FX.dae
Info,  T6572: Load x_UserMods\Assets\Models\Marker\FX.dae

Info,  T6572: Found a matching importer for this file format

Info,  T6572: Import root directory is 'x_UserMods\Assets\Models\Marker\'

Info,  T6572: Entering post processing pipeline

Info,  T6572: Removed 2 nodes and 0 animation channels (1 output nodes)

Info,  T6572: Kept 0 lights and 0 cameras

Info,  T6572: Moved 1 meshes to WCS (number of output meshes: 1)

Info,  T6572: Points: 0, Lines: 0, Triangles: 1, Polygons: 0 (Meshes, X = removed)

Info,  T6572: CalcTangentsProcess finished. Tangents have been calculated

Info,  T6572: JoinVerticesProcess finished | Verts in: 2880 out: 1934 | ~32.8%

Info,  T6572: Leaving post processing pipeline

Assembling vertices...
Building Blam mesh data...
Writing resource data...
Writing tag data...
Model imported successfully!

tags.dat> 

tags.dat> --BUNGIE_SCEN--
Unrecognized command: --BUNGIE_SCEN--
Use "help" to list available commands.

tags.dat> edit 6F4D
Tag 0x00006F4D.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x6F4D.scenery> 

tags.dat\0x6F4D.scenery> --TARGETS--
Unrecognized command: --TARGETS--
Use "help" to list available commands.

tags.dat\0x6F4D.scenery> RemoveFrom NodeMaps 1 50
Successfully removed 50 elements from NodeMaps at index 1: List`1<NodeMap>
{...}[1]

tags.dat\0x6F4D.scenery> setField NodeMaps[0].TargetNode 15
TargetNode: SByte = 15

tags.dat\0x6F4D.scenery> SaveChanges
Done!

tags.dat\0x6F4D.scenery> exit

tags.dat> 

tags.dat> --BUNGIE_HLMT--
Unrecognized command: --BUNGIE_HLMT--
Use "help" to list available commands.

tags.dat> edit 6F4E
Tag 0x00006F4E.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x6F4E.model> setField RenderModel 6F4F
RenderModel: TagInstance = 0x00006F4F

tags.dat\0x6F4E.model> setField CollisionModel null
CollisionModel: TagInstance = null

tags.dat\0x6F4E.model> setField PhysicsModel null
PhysicsModel: TagInstance = null

tags.dat\0x6F4E.model> 

tags.dat\0x6F4E.model> --REGIONS--
Unrecognized command: --REGIONS--
Use "help" to list available commands.

tags.dat\0x6F4E.model> setField CollisionRegions[0].Name acc
Name: StringID = acc

tags.dat\0x6F4E.model> setField CollisionRegions[0].Permutations[0].Name flaming_ninja
Name: StringID = flaming_ninja

tags.dat\0x6F4E.model> SaveChanges
Done!

tags.dat\0x6F4E.model> exit

tags.dat> 

tags.dat> --BUNGIE_MODE--
Unrecognized command: --BUNGIE_MODE--
Use "help" to list available commands.

tags.dat> edit 6F4F
Tag 0x00006F4F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x6F4F.render_model> 

tags.dat\0x6F4F.render_model> --REGIONS--
Unrecognized command: --REGIONS--
Use "help" to list available commands.

tags.dat\0x6F4F.render_model> setField Regions[0].Name acc
Name: StringID = acc

tags.dat\0x6F4F.render_model> setField Regions[0].Permutations[0].Name flaming_ninja
Name: StringID = flaming_ninja

tags.dat\0x6F4F.render_model> 

tags.dat\0x6F4F.render_model> --NODES--
Unrecognized command: --NODES--
Use "help" to list available commands.

tags.dat\0x6F4F.render_model> setField Nodes[0].Name head
Name: StringID = head

tags.dat\0x6F4F.render_model> setField Nodes[0].ParentNode 10
ParentNode: Int16 = 10

tags.dat\0x6F4F.render_model> setField Nodes[0].FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x6F4F.render_model> setField Nodes[0].NextSiblingNode -1
NextSiblingNode: Int16 = -1

tags.dat\0x6F4F.render_model> setField Nodes[0].DefaultTranslation 0.0172475 7.450581E-09 -1.997705E-09
DefaultTranslation: Vector3 = { X: 0.0172475, Y: 7.450581E-09, Z: -1.997705E-09 }

tags.dat\0x6F4F.render_model> setField Nodes[0].DefaultRotation -1.225241E-07 -1.584244E-08 -0.07668432 -0.9970555
DefaultRotation: Vector4 = -1.225241E-07, -1.584244E-08, -0.07668432, -0.9970555

tags.dat\0x6F4F.render_model> setField Nodes[0].DefaultScale 1
DefaultScale: Single = 1

tags.dat\0x6F4F.render_model> setField Nodes[0].InverseForward 0.2842644 0.9587459 5.190407E-07
InverseForward: Vector3 = { X: 0.2842644, Y: 0.9587459, Z: 5.190407E-07 }

tags.dat\0x6F4F.render_model> setField Nodes[0].InverseLeft 1.414099E-06 -8.984799E-07 0.9999999
InverseLeft: Vector3 = { X: 1.414099E-06, Y: -8.984799E-07, Z: 0.9999999 }

tags.dat\0x6F4F.render_model> setField Nodes[0].InverseUp 0.9587459 -0.2842643 -1.551562E-06
InverseUp: Vector3 = { X: 0.9587459, Y: -0.2842643, Z: -1.551562E-06 }

tags.dat\0x6F4F.render_model> setField Nodes[0].InversePosition -0.5994011 0.175451 7.049541E-07
InversePosition: Vector3 = { X: -0.5994011, Y: 0.175451, Z: 7.049541E-07 }

tags.dat\0x6F4F.render_model> setField Nodes[0].DistancefromParent 0.0172475
DistanceFromParent: Single = 0.0172475

tags.dat\0x6F4F.render_model> 

tags.dat\0x6F4F.render_model> --MARKERS--
Unrecognized command: --MARKERS--
Use "help" to list available commands.

tags.dat\0x6F4F.render_model> AddTo MarkerGroups 1
Successfully added 1 element to MarkerGroups: List`1<MarkerGroup>
{...}[1]

tags.dat\0x6F4F.render_model> AddTo MarkerGroups[0].Markers 1
Successfully added 1 element to Markers: List`1<Marker>
{...}[1]

tags.dat\0x6F4F.render_model> setField MarkerGroups[0].Name flaming_ninja
Name: StringID = flaming_ninja

tags.dat\0x6F4F.render_model> setField MarkerGroups[0].Markers[0].RegionIndex -1
RegionIndex: SByte = -1

tags.dat\0x6F4F.render_model> setField MarkerGroups[0].Markers[0].PermutationIndex -1
PermutationIndex: SByte = -1

tags.dat\0x6F4F.render_model> setField MarkerGroups[0].Markers[0].NodeIndex 0
NodeIndex: SByte = 0

tags.dat\0x6F4F.render_model> setField MarkerGroups[0].Markers[0].Translation 0.04645691 -0.001428986 -2.57447E-07
Translation: Vector3 = { X: 0.04645691, Y: -0.001428986, Z: -2.57447E-07 }

tags.dat\0x6F4F.render_model> setField MarkerGroups[0].Markers[0].Rotation 0.7014564 0.08921874 0.08921821 0.7014551
Rotation: Vector4 = 0.7014564, 0.08921874, 0.08921821, 0.7014551

tags.dat\0x6F4F.render_model> setField MarkerGroups[0].Markers[0].Scale 0
Scale: Single = 0

tags.dat\0x6F4F.render_model> 

tags.dat\0x6F4F.render_model> --MATERIALS--
Unrecognized command: --MATERIALS--
Use "help" to list available commands.

tags.dat\0x6F4F.render_model> setField Materials[0].RenderMethod null
RenderMethod: TagInstance = null

tags.dat\0x6F4F.render_model> SaveChanges
Done!

tags.dat\0x6F4F.render_model> exit

tags.dat> 

tags.dat> --ETERNAL_SCEN--
Unrecognized command: --ETERNAL_SCEN--
Use "help" to list available commands.

tags.dat> edit 6F50
Tag 0x00006F50.scenery has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x6F50.scenery> 

tags.dat\0x6F50.scenery> --TARGETS--
Unrecognized command: --TARGETS--
Use "help" to list available commands.

tags.dat\0x6F50.scenery> RemoveFrom NodeMaps 1 50
Successfully removed 50 elements from NodeMaps at index 1: List`1<NodeMap>
{...}[1]

tags.dat\0x6F50.scenery> setField NodeMaps[0].TargetNode 15
TargetNode: SByte = 15

tags.dat\0x6F50.scenery> SaveChanges
Done!

tags.dat\0x6F50.scenery> exit

tags.dat> 

tags.dat> --ETERNAL_HLMT--
Unrecognized command: --ETERNAL_HLMT--
Use "help" to list available commands.

tags.dat> edit 6F51
Tag 0x00006F51.model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x6F51.model> setField RenderModel 6F52
RenderModel: TagInstance = 0x00006F52

tags.dat\0x6F51.model> setField CollisionModel null
CollisionModel: TagInstance = null

tags.dat\0x6F51.model> setField PhysicsModel null
PhysicsModel: TagInstance = null

tags.dat\0x6F51.model> 

tags.dat\0x6F51.model> --REGIONS--
Unrecognized command: --REGIONS--
Use "help" to list available commands.

tags.dat\0x6F51.model> setField CollisionRegions[0].Name acc
Name: StringID = acc

tags.dat\0x6F51.model> setField CollisionRegions[0].Permutations[0].Name flaming_ninja
Name: StringID = flaming_ninja

tags.dat\0x6F51.model> SaveChanges
Done!

tags.dat\0x6F51.model> exit

tags.dat> 

tags.dat> --ETERNAL_MODE--
Unrecognized command: --ETERNAL_MODE--
Use "help" to list available commands.

tags.dat> edit 6F52
Tag 0x00006F52.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x6F52.render_model> 

tags.dat\0x6F52.render_model> --REGIONS--
Unrecognized command: --REGIONS--
Use "help" to list available commands.

tags.dat\0x6F52.render_model> setField Regions[0].Name acc
Name: StringID = acc

tags.dat\0x6F52.render_model> setField Regions[0].Permutations[0].Name flaming_ninja
Name: StringID = flaming_ninja

tags.dat\0x6F52.render_model> 

tags.dat\0x6F52.render_model> --NODES--
Unrecognized command: --NODES--
Use "help" to list available commands.

tags.dat\0x6F52.render_model> setField Nodes[0].Name head
Name: StringID = head

tags.dat\0x6F52.render_model> setField Nodes[0].ParentNode 10
ParentNode: Int16 = 10

tags.dat\0x6F52.render_model> setField Nodes[0].FirstChildNode -1
FirstChildNode: Int16 = -1

tags.dat\0x6F52.render_model> setField Nodes[0].NextSiblingNode -1
NextSiblingNode: Int16 = -1

tags.dat\0x6F52.render_model> setField Nodes[0].DefaultTranslation 0.0172475 7.450581E-09 -1.997705E-09
DefaultTranslation: Vector3 = { X: 0.0172475, Y: 7.450581E-09, Z: -1.997705E-09 }

tags.dat\0x6F52.render_model> setField Nodes[0].DefaultRotation -1.225241E-07 -1.584244E-08 -0.07668432 -0.9970555
DefaultRotation: Vector4 = -1.225241E-07, -1.584244E-08, -0.07668432, -0.9970555

tags.dat\0x6F52.render_model> setField Nodes[0].DefaultScale 1
DefaultScale: Single = 1

tags.dat\0x6F52.render_model> setField Nodes[0].InverseForward 0.2842644 0.9587459 5.190407E-07
InverseForward: Vector3 = { X: 0.2842644, Y: 0.9587459, Z: 5.190407E-07 }

tags.dat\0x6F52.render_model> setField Nodes[0].InverseLeft 1.414099E-06 -8.984799E-07 0.9999999
InverseLeft: Vector3 = { X: 1.414099E-06, Y: -8.984799E-07, Z: 0.9999999 }

tags.dat\0x6F52.render_model> setField Nodes[0].InverseUp 0.9587459 -0.2842643 -1.551562E-06
InverseUp: Vector3 = { X: 0.9587459, Y: -0.2842643, Z: -1.551562E-06 }

tags.dat\0x6F52.render_model> setField Nodes[0].InversePosition -0.5994011 0.175451 7.049541E-07
InversePosition: Vector3 = { X: -0.5994011, Y: 0.175451, Z: 7.049541E-07 }

tags.dat\0x6F52.render_model> setField Nodes[0].DistancefromParent 0.0172475
DistanceFromParent: Single = 0.0172475

tags.dat\0x6F52.render_model> 

tags.dat\0x6F52.render_model> --MARKERS--
Unrecognized command: --MARKERS--
Use "help" to list available commands.

tags.dat\0x6F52.render_model> AddTo MarkerGroups 1
Successfully added 1 element to MarkerGroups: List`1<MarkerGroup>
{...}[1]

tags.dat\0x6F52.render_model> AddTo MarkerGroups[0].Markers 1
Successfully added 1 element to Markers: List`1<Marker>
{...}[1]

tags.dat\0x6F52.render_model> setField MarkerGroups[0].Name flaming_ninja
Name: StringID = flaming_ninja

tags.dat\0x6F52.render_model> setField MarkerGroups[0].Markers[0].RegionIndex -1
RegionIndex: SByte = -1

tags.dat\0x6F52.render_model> setField MarkerGroups[0].Markers[0].PermutationIndex -1
PermutationIndex: SByte = -1

tags.dat\0x6F52.render_model> setField MarkerGroups[0].Markers[0].NodeIndex 0
NodeIndex: SByte = 0

tags.dat\0x6F52.render_model> setField MarkerGroups[0].Markers[0].Translation 0.04645691 -0.001428986 -2.57447E-07
Translation: Vector3 = { X: 0.04645691, Y: -0.001428986, Z: -2.57447E-07 }

tags.dat\0x6F52.render_model> setField MarkerGroups[0].Markers[0].Rotation 0.7014564 0.08921874 0.08921821 0.7014551
Rotation: Vector4 = 0.7014564, 0.08921874, 0.08921821, 0.7014551

tags.dat\0x6F52.render_model> setField MarkerGroups[0].Markers[0].Scale 0
Scale: Single = 0

tags.dat\0x6F52.render_model> 

tags.dat\0x6F52.render_model> --MATERIALS--
Unrecognized command: --MATERIALS--
Use "help" to list available commands.

tags.dat\0x6F52.render_model> setField Materials[0].RenderMethod null
RenderMethod: TagInstance = null

tags.dat\0x6F52.render_model> SaveChanges
Done!

tags.dat\0x6F52.render_model> exit

tags.dat> 

tags.dat> --STRINGS--
Unrecognized command: --STRINGS--
Use "help" to list available commands.

tags.dat> stringid add xe_effect_bungie
Added string "xe_effect_bungie" as 0x00009292.

tags.dat> stringid add xe_effect_eternal
Added string "xe_effect_eternal" as 0x00009293.

tags.dat> stringid add xe_effect_horizon
Added string "xe_effect_horizon" as 0x00009294.

tags.dat> 

tags.dat> dumplog x_UserMods-x1.txt
