Tag Tool [1.0.5938.29681]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...28910 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 9:40 AM.
Reading stringIDs...37525 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> --DEPS--
Unrecognized command: --DEPS--
Use "help" to list available commands.

tags.dat> dep add 0 6F4D

tags.dat> dep add 0 6F4E

tags.dat> dep add 0 6F4F

tags.dat> dep add 0 6F50

tags.dat> dep add 0 6F51

tags.dat> dep add 0 6F52

tags.dat> dep add 0 6F53

tags.dat> dep add 0 6F54

tags.dat> 

tags.dat> --MULG_FIXUP--
Unrecognized command: --MULG_FIXUP--
Use "help" to list available commands.

tags.dat> dep remove 028E 01AD
Removed dependency on tag 000001AD.

tags.dat> dep remove 028E 01B0
Removed dependency on tag 000001B0.

tags.dat> dep remove 028E 01B3
Removed dependency on tag 000001B3.

tags.dat> dep remove 028E 01B6
Removed dependency on tag 000001B6.

tags.dat> dep remove 028E 06D9
Removed dependency on tag 000006D9.

tags.dat> dep remove 028E 01D9

tags.dat> dep remove 028E 15C8
Removed dependency on tag 000015C8.

tags.dat> dep remove 028E 15C9
Removed dependency on tag 000015C9.

tags.dat> dep remove 028E 15CA
Removed dependency on tag 000015CA.

tags.dat> dep remove 028E 15CB
Removed dependency on tag 000015CB.

tags.dat> dep remove 028E 15CD
Removed dependency on tag 000015CD.

tags.dat> dep remove 028E 15CE
Removed dependency on tag 000015CE.

tags.dat> dep remove 028E 15CF
Removed dependency on tag 000015CF.

tags.dat> dep remove 028E 15D0
Removed dependency on tag 000015D0.

tags.dat> dep remove 028E 1517
Removed dependency on tag 00001517.

tags.dat> dep remove 028E 1518
Removed dependency on tag 00001518.

tags.dat> dep remove 028E 1519
Removed dependency on tag 00001519.

tags.dat> dep remove 028E 151A
Removed dependency on tag 0000151A.

tags.dat> dep remove 028E 151F
Removed dependency on tag 0000151F.

tags.dat> dep remove 028E 1520
Removed dependency on tag 00001520.

tags.dat> dep remove 028E 1596
Removed dependency on tag 00001596.

tags.dat> dep remove 028E 1598
Removed dependency on tag 00001598.

tags.dat> dep remove 028E 1599
Removed dependency on tag 00001599.

tags.dat> dep remove 028E 159B
Removed dependency on tag 0000159B.

tags.dat> dep remove 028E 15C5
Removed dependency on tag 000015C5.

tags.dat> dep remove 028E 4441
Removed dependency on tag 00004441.

tags.dat> dep remove 028E 4442
Removed dependency on tag 00004442.

tags.dat> dep remove 028E 4443
Removed dependency on tag 00004443.

tags.dat> dep remove 028E 4444
Removed dependency on tag 00004444.

tags.dat> dep remove 028E 4445
Removed dependency on tag 00004445.

tags.dat> dep remove 028E 4446
Removed dependency on tag 00004446.

tags.dat> dep remove 028E 4447
Removed dependency on tag 00004447.

tags.dat> dep remove 028E 4448
Removed dependency on tag 00004448.

tags.dat> dep remove 028E 4449
Removed dependency on tag 00004449.

tags.dat> dep remove 028E 1A45
Removed dependency on tag 00001A45.

tags.dat> dep remove 028E 1A54
Removed dependency on tag 00001A54.

tags.dat> dep remove 028E 1A55
Removed dependency on tag 00001A55.

tags.dat> dep remove 028E 1A56
Removed dependency on tag 00001A56.

tags.dat> dep remove 028E 6F4D
Removed dependency on tag 00006F4D.

tags.dat> dep remove 028E 6F50
Removed dependency on tag 00006F50.

tags.dat> 

tags.dat> dumplog x_UserMods-x3.txt
