Tag Tool [1.5.7320.9819]

Please report any bugs and/or feature requests at
<https://github.com/TheGuardians-CI/TagTool/issues>.

Enter "help" to list available commands. Enter "exit" to quit.

tags> CreateTag "mode" 0x1EFB
[Index: 0x1EFB, Offset: 0x014ED560, Size: 0x0200] 0x1EFB.render_model

tags> NameTag 0x1EFB objects\weapons\rifle\shotgun\fp_shotgun\fp_shotgun
[Index: 0x1EFB, Offset: 0x014ED560, Size: 0x0200] objects\weapons\rifle\shotgun\fp_shotgun\fp_shotgun.render_model

tags> ImportTag 0x1EFB "tags\objects\weapons\rifle\shotgun\fp_shotgun\fp_shotgun.render_model"
Imported 0xD40 bytes.

tags> 

tags> CreateTag "rmsh" 0x5D19
[Index: 0x5D19, Offset: 0x062988F0, Size: 0x0080] 0x5D19.shader

tags> NameTag 0x5D19 objects\weapons\rifle\shotgun\shaders\shotgun_composite
[Index: 0x5D19, Offset: 0x062988F0, Size: 0x0080] objects\weapons\rifle\shotgun\shaders\shotgun_composite.shader

tags> ImportTag 0x5D19 "tags\0x5D19.shader"
Imported 0xAE0 bytes.

tags> 

tags> CreateTag "rmsh" 0x5D1A
[Index: 0x5D1A, Offset: 0x062993D0, Size: 0x0080] 0x5D1A.shader

tags> NameTag 0x5D1A objects\weapons\rifle\shotgun\shaders\shotgun_decal
[Index: 0x5D1A, Offset: 0x062993D0, Size: 0x0080] objects\weapons\rifle\shotgun\shaders\shotgun_decal.shader

tags> ImportTag 0x5D1A "tags\0x5D1A.shader"
Imported 0xAE0 bytes.

tags> 

tags> CreateTag "rmsh" 0x5D1B
[Index: 0x5D1B, Offset: 0x06299EB0, Size: 0x0080] 0x5D1B.shader

tags> NameTag 0x5D1B objects\weapons\rifle\shotgun\shaders\shotgun_new_aim_illum
[Index: 0x5D1B, Offset: 0x06299EB0, Size: 0x0080] objects\weapons\rifle\shotgun\shaders\shotgun_new_aim_illum.shader

tags> ImportTag 0x5D1B "tags\0x5D1B.shader"
Imported 0xAE0 bytes.

tags> 

tags> CreateTag "rmsh" 0x5D1C
[Index: 0x5D1C, Offset: 0x0629A990, Size: 0x0080] 0x5D1C.shader

tags> NameTag 0x5D1C objects\weapons\rifle\shotgun\shaders\shotgun_metal
[Index: 0x5D1C, Offset: 0x0629A990, Size: 0x0080] objects\weapons\rifle\shotgun\shaders\shotgun_metal.shader

tags> ImportTag 0x5D1C "tags\0x5D1C.shader"
Imported 0xAE0 bytes.

tags> 

tags> CreateTag "rmsh" 0x5D1D
[Index: 0x5D1D, Offset: 0x0629B470, Size: 0x0080] 0x5D1D.shader

tags> NameTag 0x5D1D objects\weapons\rifle\shotgun\shaders\shotgun_rubber
[Index: 0x5D1D, Offset: 0x0629B470, Size: 0x0080] objects\weapons\rifle\shotgun\shaders\shotgun_rubber.shader

tags> ImportTag 0x5D1D "tags\0x5D1D.shader"
Imported 0x1D0 bytes.

tags> 

tags> CreateTag "rmsh" 0x5D1E
[Index: 0x5D1E, Offset: 0x0629B640, Size: 0x0080] 0x5D1E.shader

tags> NameTag 0x5D1E objects\weapons\rifle\shotgun\shaders\shotgun_metal_shiny
[Index: 0x5D1E, Offset: 0x0629B640, Size: 0x0080] objects\weapons\rifle\shotgun\shaders\shotgun_metal_shiny.shader

tags> ImportTag 0x5D1E "tags\0x5D1E.shader"
Imported 0x320 bytes.

tags> 

tags> CreateTag "bitm" 0x5D15
[Index: 0x5D15, Offset: 0x062988F0, Size: 0x00F0] 0x5D15.bitmap

tags> NameTag 0x5D15 objects\weapons\rifle\shotgun\bitmaps\shotgun_diffuse
[Index: 0x5D15, Offset: 0x062988F0, Size: 0x00F0] objects\weapons\rifle\shotgun\bitmaps\shotgun_diffuse.bitmap

tags> ImportTag 0x5D15 "tags\0x5D15.bitmap"
Imported 0x260 bytes.

tags> 

tags> CreateTag "bitm" 0x5D16
[Index: 0x5D16, Offset: 0x06298B50, Size: 0x00F0] 0x5D16.bitmap

tags> NameTag 0x5D16 objects\weapons\rifle\shotgun\bitmaps\shotgun_zbump
[Index: 0x5D16, Offset: 0x06298B50, Size: 0x00F0] objects\weapons\rifle\shotgun\bitmaps\shotgun_zbump.bitmap

tags> ImportTag 0x5D16 "tags\0x5D16.bitmap"
Imported 0x260 bytes.

tags> 

tags> CreateTag "bitm" 0x0379
[Index: 0x0379, Offset: 0x00203108, Size: 0x00F0] 0x0379.bitmap

tags> NameTag 0x0379 shaders\default_bitmaps\bitmaps\default_dynamic_cube_map
[Index: 0x0379, Offset: 0x00203108, Size: 0x00F0] shaders\default_bitmaps\bitmaps\default_dynamic_cube_map.bitmap

tags> ImportTag 0x0379 "tags\shaders\default_bitmaps\bitmaps\default_dynamic_cube_map.bitmap"
Imported 0x210 bytes.

tags> 

tags> CreateTag "bitm" 0x0376
[Index: 0x0376, Offset: 0x00202AA8, Size: 0x00F0] 0x0376.bitmap

tags> NameTag 0x0376 shaders\default_bitmaps\bitmaps\default_vector
[Index: 0x0376, Offset: 0x00202AA8, Size: 0x00F0] shaders\default_bitmaps\bitmaps\default_vector.bitmap

tags> ImportTag 0x0376 "tags\shaders\default_bitmaps\bitmaps\default_vector.bitmap"
Imported 0x210 bytes.

tags> 

tags> CreateTag "bitm" 0x02B9
[Index: 0x02B9, Offset: 0x001A2CA8, Size: 0x00F0] 0x02B9.bitmap

tags> NameTag 0x02B9 shaders\default_bitmaps\bitmaps\color_white
[Index: 0x02B9, Offset: 0x001A2CA8, Size: 0x00F0] shaders\default_bitmaps\bitmaps\color_white.bitmap

tags> ImportTag 0x02B9 "tags\shaders\default_bitmaps\bitmaps\color_white.bitmap"
Imported 0x240 bytes.

tags> 

tags> CreateTag "bitm" 0x0343
[Index: 0x0343, Offset: 0x001B6AC8, Size: 0x00F0] 0x0343.bitmap

tags> NameTag 0x0343 shaders\default_bitmaps\bitmaps\default_detail
[Index: 0x0343, Offset: 0x001B6AC8, Size: 0x00F0] shaders\default_bitmaps\bitmaps\default_detail.bitmap

tags> ImportTag 0x0343 "tags\shaders\default_bitmaps\bitmaps\default_detail.bitmap"
Imported 0x210 bytes.

tags> 

tags> CreateTag "bitm" 0x02B7
[Index: 0x02B7, Offset: 0x001A2848, Size: 0x00F0] 0x02B7.bitmap

tags> NameTag 0x02B7 shaders\default_bitmaps\bitmaps\gray_50_percent
[Index: 0x02B7, Offset: 0x001A2848, Size: 0x00F0] shaders\default_bitmaps\bitmaps\gray_50_percent.bitmap

tags> ImportTag 0x02B7 "tags\shaders\default_bitmaps\bitmaps\gray_50_percent.bitmap"
Imported 0x210 bytes.

tags> 

tags> CreateTag "bitm" 0x5D18
[Index: 0x5D18, Offset: 0x06298DB0, Size: 0x00F0] 0x5D18.bitmap

tags> NameTag 0x5D18 objects\weapons\rifle\shotgun\bitmaps\shotgun_flat_illum
[Index: 0x5D18, Offset: 0x06298DB0, Size: 0x00F0] objects\weapons\rifle\shotgun\bitmaps\shotgun_flat_illum.bitmap

tags> ImportTag 0x5D18 "tags\0x5D18.bitmap"
Imported 0x260 bytes.

tags> 

tags> CreateTag "bitm" 0x5D17
[Index: 0x5D17, Offset: 0x06298DB0, Size: 0x00F0] 0x5D17.bitmap

tags> NameTag 0x5D17 objects\weapons\rifle\shotgun\bitmaps\unsc_decals_diffuse
[Index: 0x5D17, Offset: 0x06298DB0, Size: 0x00F0] objects\weapons\rifle\shotgun\bitmaps\unsc_decals_diffuse.bitmap

tags> ImportTag 0x5D17 "tags\0x5D17.bitmap"
Imported 0x260 bytes.

tags> 

tags> CreateTag "hlmt" 0x1EF5
[Index: 0x1EF5, Offset: 0x014E9E90, Size: 0x0210] 0x1EF5.model

tags> NameTag 0x1EF5 objects\weapons\rifle\shotgun\shotgun
[Index: 0x1EF5, Offset: 0x014E9E90, Size: 0x0210] objects\weapons\rifle\shotgun\shotgun.model

tags> ImportTag 0x1EF5 "tags\objects\weapons\rifle\shotgun\shotgun.model"
Imported 0x420 bytes.

tags> 

tags> CreateTag "mode" 0x1F3F
[Index: 0x1F3F, Offset: 0x01560300, Size: 0x0200] 0x1F3F.render_model

tags> NameTag 0x1F3F objects\weapons\rifle\shotgun\shotgun
[Index: 0x1F3F, Offset: 0x01560300, Size: 0x0200] objects\weapons\rifle\shotgun\shotgun.render_model

tags> ImportTag 0x1F3F "tags\objects\weapons\rifle\shotgun\shotgun.render_model"
Imported 0xD40 bytes.

tags> 

tags> CreateTag "coll" 0x1F40
[Index: 0x1F40, Offset: 0x01561040, Size: 0x0080] 0x1F40.collision_model

tags> NameTag 0x1F40 objects\weapons\rifle\shotgun\shotgun
[Index: 0x1F40, Offset: 0x01561040, Size: 0x0080] objects\weapons\rifle\shotgun\shotgun.collision_model

tags> ImportTag 0x1F40 "tags\objects\weapons\rifle\shotgun\shotgun.collision_model"
Imported 0x1820 bytes.

tags> 

tags> CreateTag "jmad" 0x1F41
[Index: 0x1F41, Offset: 0x01562860, Size: 0x0140] 0x1F41.model_animation_graph

tags> NameTag 0x1F41 objects\weapons\rifle\shotgun\shotgun
[Index: 0x1F41, Offset: 0x01562860, Size: 0x0140] objects\weapons\rifle\shotgun\shotgun.model_animation_graph

tags> ImportTag 0x1F41 "tags\objects\weapons\rifle\shotgun\shotgun.model_animation_graph"
Imported 0x520 bytes.

tags> 

tags> CreateTag "phmo" 0x1F42
[Index: 0x1F42, Offset: 0x01562D80, Size: 0x01D0] 0x1F42.physics_model

tags> NameTag 0x1F42 objects\weapons\rifle\shotgun\shotgun
[Index: 0x1F42, Offset: 0x01562D80, Size: 0x01D0] objects\weapons\rifle\shotgun\shotgun.physics_model

tags> ImportTag 0x1F42 "tags\objects\weapons\rifle\shotgun\shotgun.physics_model"
Imported 0x410 bytes.

tags> 

tags> CreateTag "mode" 0x1F43
[Index: 0x1F43, Offset: 0x01563190, Size: 0x0200] 0x1F43.render_model

tags> NameTag 0x1F43 objects\weapons\lod\lod_shotgun\lod_shotgun
[Index: 0x1F43, Offset: 0x01563190, Size: 0x0200] objects\weapons\lod\lod_shotgun\lod_shotgun.render_model

tags> ImportTag 0x1F43 "tags\objects\weapons\lod\lod_shotgun\lod_shotgun.render_model"
Imported 0x560 bytes.

tags> 

tags> CreateTag "rmsh" 0x1F44
[Index: 0x1F44, Offset: 0x015636F0, Size: 0x0080] 0x1F44.shader

tags> NameTag 0x1F44 objects\weapons\lod\lod_shotgun\lod_shotgun\shaders\[00]_rmsh
[Index: 0x1F44, Offset: 0x015636F0, Size: 0x0080] objects\weapons\lod\lod_shotgun\lod_shotgun\shaders\[00]_rmsh.shader

tags> ImportTag 0x1F44 "tags\objects\weapons\lod\lod_shotgun\lod_shotgun\shaders\[00]_rmsh.shader"
Imported 0xC30 bytes.

tags> 

tags> CreateTag "bitm" 0x1F45
[Index: 0x1F45, Offset: 0x01564320, Size: 0x00F0] 0x1F45.bitmap

tags> NameTag 0x1F45 objects\weapons\lod\lod_shotgun\lod_shotgun\bitmaps\[00]_rmsh\alpha_test
[Index: 0x1F45, Offset: 0x01564320, Size: 0x00F0] objects\weapons\lod\lod_shotgun\lod_shotgun\bitmaps\[00]_rmsh\alpha_test.bitmap

tags> ImportTag 0x1F45 "tags\objects\weapons\lod\lod_shotgun\lod_shotgun\bitmaps\[00]_rmsh\alpha_test.bitmap"
Imported 0x210 bytes.

tags> 

tags> EditTag 0x1EFB
Tag objects\weapons\rifle\shotgun\fp_shotgun\fp_shotgun.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\objects\weapons\rifle\shotgun\fp_shotgun\fp_shotgun.render_model> SetField Geometry.Resource.Page.Index -1
Index: Int32 = -1 

tags\objects\weapons\rifle\shotgun\fp_shotgun\fp_shotgun.render_model> SetField Geometry.Resource ResourcesB "tags\objects\weapons\rifle\shotgun\fp_shotgun\fp_shotgun_geometry.render_geometry_api_resource_definition"
Resource: PageableResource = { Location: ResourcesB, Index: 0x0005, CompressedSize: 0x00050D38 } 

tags\objects\weapons\rifle\shotgun\fp_shotgun\fp_shotgun.render_model> SaveTagChanges
Done!

tags\objects\weapons\rifle\shotgun\fp_shotgun\fp_shotgun.render_model> ExitTo tags

tags> 

tags> EditTag 0x5D15
Tag objects\weapons\rifle\shotgun\bitmaps\shotgun_diffuse.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_diffuse.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_diffuse.bitmap> SetField Resources[0].Resource ResourcesB "tags\0x5D15_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x0006, CompressedSize: 0x0013A747 } 

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_diffuse.bitmap> SaveTagChanges
Done!

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_diffuse.bitmap> ExitTo tags

tags> 

tags> EditTag 0x5D16
Tag objects\weapons\rifle\shotgun\bitmaps\shotgun_zbump.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_zbump.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_zbump.bitmap> SetField Resources[0].Resource ResourcesB "tags\0x5D16_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x0007, CompressedSize: 0x00070BBE } 

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_zbump.bitmap> SaveTagChanges
Done!

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_zbump.bitmap> ExitTo tags

tags> 

tags> EditTag 0x0379
Tag shaders\default_bitmaps\bitmaps\default_dynamic_cube_map.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\shaders\default_bitmaps\bitmaps\default_dynamic_cube_map.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\shaders\default_bitmaps\bitmaps\default_dynamic_cube_map.bitmap> SetField Resources[0].Resource ResourcesB "tags\shaders\default_bitmaps\bitmaps\default_dynamic_cube_map_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x0008, CompressedSize: 0x00007162 } 

tags\shaders\default_bitmaps\bitmaps\default_dynamic_cube_map.bitmap> SaveTagChanges
Done!

tags\shaders\default_bitmaps\bitmaps\default_dynamic_cube_map.bitmap> ExitTo tags

tags> 

tags> EditTag 0x0376
Tag shaders\default_bitmaps\bitmaps\default_vector.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\shaders\default_bitmaps\bitmaps\default_vector.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\shaders\default_bitmaps\bitmaps\default_vector.bitmap> SetField Resources[0].Resource ResourcesB "tags\shaders\default_bitmaps\bitmaps\default_vector_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x0009, CompressedSize: 0x00000017 } 

tags\shaders\default_bitmaps\bitmaps\default_vector.bitmap> SaveTagChanges
Done!

tags\shaders\default_bitmaps\bitmaps\default_vector.bitmap> ExitTo tags

tags> 

tags> EditTag 0x02B9
Tag shaders\default_bitmaps\bitmaps\color_white.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\shaders\default_bitmaps\bitmaps\color_white.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\shaders\default_bitmaps\bitmaps\color_white.bitmap> SetField Resources[0].Resource ResourcesB "tags\shaders\default_bitmaps\bitmaps\color_white_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x000A, CompressedSize: 0x0000000D } 

tags\shaders\default_bitmaps\bitmaps\color_white.bitmap> SaveTagChanges
Done!

tags\shaders\default_bitmaps\bitmaps\color_white.bitmap> ExitTo tags

tags> 

tags> EditTag 0x0343
Tag shaders\default_bitmaps\bitmaps\default_detail.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\shaders\default_bitmaps\bitmaps\default_detail.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\shaders\default_bitmaps\bitmaps\default_detail.bitmap> SetField Resources[0].Resource ResourcesB "tags\shaders\default_bitmaps\bitmaps\default_detail_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x000B, CompressedSize: 0x0000000D } 

tags\shaders\default_bitmaps\bitmaps\default_detail.bitmap> SaveTagChanges
Done!

tags\shaders\default_bitmaps\bitmaps\default_detail.bitmap> ExitTo tags

tags> 

tags> EditTag 0x02B7
Tag shaders\default_bitmaps\bitmaps\gray_50_percent.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\shaders\default_bitmaps\bitmaps\gray_50_percent.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\shaders\default_bitmaps\bitmaps\gray_50_percent.bitmap> SetField Resources[0].Resource ResourcesB "tags\shaders\default_bitmaps\bitmaps\gray_50_percent_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x000C, CompressedSize: 0x00000014 } 

tags\shaders\default_bitmaps\bitmaps\gray_50_percent.bitmap> SaveTagChanges
Done!

tags\shaders\default_bitmaps\bitmaps\gray_50_percent.bitmap> ExitTo tags

tags> 

tags> EditTag 0x5D18
Tag objects\weapons\rifle\shotgun\bitmaps\shotgun_flat_illum.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_flat_illum.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_flat_illum.bitmap> SetField Resources[0].Resource ResourcesB "tags\0x5D18_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x000D, CompressedSize: 0x0003AA70 } 

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_flat_illum.bitmap> SaveTagChanges
Done!

tags\objects\weapons\rifle\shotgun\bitmaps\shotgun_flat_illum.bitmap> ExitTo tags

tags> 

tags> EditTag 0x5D17
Tag objects\weapons\rifle\shotgun\bitmaps\unsc_decals_diffuse.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\objects\weapons\rifle\shotgun\bitmaps\unsc_decals_diffuse.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\objects\weapons\rifle\shotgun\bitmaps\unsc_decals_diffuse.bitmap> SetField Resources[0].Resource ResourcesB "tags\0x5D17_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x000E, CompressedSize: 0x00000185 } 

tags\objects\weapons\rifle\shotgun\bitmaps\unsc_decals_diffuse.bitmap> SaveTagChanges
Done!

tags\objects\weapons\rifle\shotgun\bitmaps\unsc_decals_diffuse.bitmap> ExitTo tags

tags> 

tags> EditTag 0x1F3F
Tag objects\weapons\rifle\shotgun\shotgun.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\objects\weapons\rifle\shotgun\shotgun.render_model> SetField Geometry.Resource.Page.Index -1
Index: Int32 = -1 

tags\objects\weapons\rifle\shotgun\shotgun.render_model> SetField Geometry.Resource ResourcesB "tags\objects\weapons\rifle\shotgun\shotgun_geometry.render_geometry_api_resource_definition"
Resource: PageableResource = { Location: ResourcesB, Index: 0x000F, CompressedSize: 0x00050D38 } 

tags\objects\weapons\rifle\shotgun\shotgun.render_model> SaveTagChanges
Done!

tags\objects\weapons\rifle\shotgun\shotgun.render_model> ExitTo tags

tags> 

tags> EditTag 0x1F41
Tag objects\weapons\rifle\shotgun\shotgun.model_animation_graph has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\objects\weapons\rifle\shotgun\shotgun.model_animation_graph> SetField ResourceGroups[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\objects\weapons\rifle\shotgun\shotgun.model_animation_graph> SetField ResourceGroups[0].Resource ResourcesB "tags\objects\weapons\rifle\shotgun\shotgun_group.model_animation_tag_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x0010, CompressedSize: 0x000000E2 } 

tags\objects\weapons\rifle\shotgun\shotgun.model_animation_graph> SaveTagChanges
Done!

tags\objects\weapons\rifle\shotgun\shotgun.model_animation_graph> ExitTo tags

tags> 

tags> EditTag 0x1F43
Tag objects\weapons\lod\lod_shotgun\lod_shotgun.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\objects\weapons\lod\lod_shotgun\lod_shotgun.render_model> SetField Geometry.Resource.Page.Index -1
Index: Int32 = -1 

tags\objects\weapons\lod\lod_shotgun\lod_shotgun.render_model> SetField Geometry.Resource ResourcesB "tags\objects\weapons\lod\lod_shotgun\lod_shotgun_geometry.render_geometry_api_resource_definition"
Resource: PageableResource = { Location: ResourcesB, Index: 0x0011, CompressedSize: 0x000002E0 } 

tags\objects\weapons\lod\lod_shotgun\lod_shotgun.render_model> SaveTagChanges
Done!

tags\objects\weapons\lod\lod_shotgun\lod_shotgun.render_model> ExitTo tags

tags> 

tags> EditTag 0x1F45
Tag objects\weapons\lod\lod_shotgun\lod_shotgun\bitmaps\[00]_rmsh\alpha_test.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\objects\weapons\lod\lod_shotgun\lod_shotgun\bitmaps\[00]_rmsh\alpha_test.bitmap> SetField Resources[0].Resource.Page.Index -1
Index: Int32 = -1 

tags\objects\weapons\lod\lod_shotgun\lod_shotgun\bitmaps\[00]_rmsh\alpha_test.bitmap> SetField Resources[0].Resource ResourcesB "tags\objects\weapons\lod\lod_shotgun\lod_shotgun\bitmaps\[00]_rmsh\alpha_test_image.bitmap_texture_interop_resource"
Resource: PageableResource = { Location: ResourcesB, Index: 0x0012, CompressedSize: 0x000007BD } 

tags\objects\weapons\lod\lod_shotgun\lod_shotgun\bitmaps\[00]_rmsh\alpha_test.bitmap> SaveTagChanges
Done!

tags\objects\weapons\lod\lod_shotgun\lod_shotgun\bitmaps\[00]_rmsh\alpha_test.bitmap> ExitTo tags

tags> 

tags> SaveTagNames

tags> DumpLog ReachShotgun.txt
