Tag Tool [1.0.5982.3255]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23623 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 3:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> XXXX
Unrecognized command: XXXX
Use "help" to list available commands.

tags.dat> 

tags.dat> 

tags.dat> echo

tags.dat> echo

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> 1EF5
Unrecognized command: 1EF5
Use "help" to list available commands.

tags.dat> 1EF5
Unrecognized command: 1EF5
Use "help" to list available commands.

tags.dat> 1EFB
Unrecognized command: 1EFB
Use "help" to list available commands.

tags.dat> 1EFB
Unrecognized command: 1EFB
Use "help" to list available commands.

tags.dat> 1F3F
Unrecognized command: 1F3F
Use "help" to list available commands.

tags.dat> 1F3F
Unrecognized command: 1F3F
Use "help" to list available commands.

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C37
Unrecognized command: 5C37
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C38
Unrecognized command: 5C38
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C39
Unrecognized command: 5C39
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C3A
Unrecognized command: 5C3A
Use "help" to list available commands.

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C3B
Unrecognized command: 5C3B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C3C
Unrecognized command: 5C3C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C3D
Unrecognized command: 5C3D
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C3E
Unrecognized command: 5C3E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C3F
Unrecognized command: 5C3F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5C40
Unrecognized command: 5C40
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> resourcedata import resources.dat 0108 tags/HRShotgun.raw
Imported 0x9D690 bytes.
Compressed size = 0x420BF

tags.dat> 

tags.dat> importbitmap 5C37 DDS/shotgun_diffuse.dds    
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005C37 [Offset = 0x62D43D0, Size = 0x260]

tags.dat> importbitmap 5C38 DDS/shotgun_zbump.dds      
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005C38 [Offset = 0x62D4630, Size = 0x260]

tags.dat> importbitmap 5C39 DDS/shotgun_flat_illum.dds 
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005C39 [Offset = 0x62D4890, Size = 0x260]

tags.dat> importbitmap 5C3A DDS/unsc_decals_diffuse.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005C3A [Offset = 0x62D4AF0, Size = 0x260]

tags.dat> 

tags.dat> import 1EF5 tags/hlmt_HRSH
Imported 0x420 bytes.

tags.dat> import 1F3F tags/mode_HRSH3d
Imported 0xD40 bytes.

tags.dat> import 1EFB tags/mode_HRSHfp
Imported 0xD40 bytes.

tags.dat> import 5C3B tags/shad_HRSHcomp
Imported 0xAE0 bytes.

tags.dat> import 5C3F tags/shad_HRSHdeca
Imported 0x1D0 bytes.

tags.dat> import 5C40 tags/shad_HRSHillu
Imported 0x320 bytes.

tags.dat> import 5C3C tags/shad_HRSHmeta
Imported 0xAE0 bytes.

tags.dat> import 5C3E tags/shad_HRSHrubb
Imported 0xAE0 bytes.

tags.dat> import 5C3D tags/shad_HRSHshin
Imported 0xAE0 bytes.

tags.dat> 

tags.dat> edit 5C3B
Tag 0x00005C3B.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5C3B.shader> SpecifyBitmaps
Please enter the base_map index: 5C37
Please enter the detail_map index: 0343
Please enter the bump_map index: 5C38
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x5C3B.shader> exitTo tags.dat

tags.dat> edit 5C3C
Tag 0x00005C3C.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5C3C.shader> SpecifyBitmaps
Please enter the base_map index: 5C37
Please enter the detail_map index: 0343
Please enter the bump_map index: 5C38
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x5C3C.shader> exitTo tags.dat

tags.dat> edit 5C3D
Tag 0x00005C3D.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5C3D.shader> SpecifyBitmaps
Please enter the base_map index: 5C37
Please enter the detail_map index: 0343
Please enter the bump_map index: 5C38
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x5C3D.shader> exitTo tags.dat

tags.dat> edit 5C3E
Tag 0x00005C3E.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5C3E.shader> SpecifyBitmaps
Please enter the base_map index: 5C37
Please enter the detail_map index: 0343
Please enter the bump_map index: 5C38
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x5C3E.shader> exitTo tags.dat

tags.dat> edit 5C3F
Tag 0x00005C3F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5C3F.shader> SpecifyBitmaps
Please enter the base_map index: 5C3A
Please enter the detail_map index: 0343
Done!

tags.dat\0x5C3F.shader> exitTo tags.dat

tags.dat> edit 5C40
Tag 0x00005C40.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5C40.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5C39
Done!

tags.dat\0x5C40.shader> 0343
Unrecognized command: 0343
Use "help" to list available commands.

tags.dat\0x5C40.shader> exitTo tags.dat

tags.dat> edit 1EFB
Tag 0x00001EFB.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1EFB.render_model> SpecifyShaders
Please enter the replacement 0000583C index: 5C3B
Please enter the replacement 0000583D index: 5C3C
Please enter the replacement 0000583E index: 5C3D
Please enter the replacement 0000583F index: 5C3E
Please enter the replacement 00005840 index: 5C3F
Please enter the replacement 00005841 index: 5C40
Done!

tags.dat\0x1EFB.render_model> exitTo tags.dat

tags.dat> edit 1F3F
Tag 0x00001F3F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F3F.render_model> SpecifyShaders
Please enter the replacement 000059C1 index: 5C3B
Please enter the replacement 000059C2 index: 5C3C
Please enter the replacement 000059C3 index: 5C3D
Please enter the replacement 000059C4 index: 5C3E
Please enter the replacement 000059C5 index: 5C3F
Please enter the replacement 000059C6 index: 5C40
Done!

tags.dat\0x1F3F.render_model> exitTo tags.dat

tags.dat> 

tags.dat> dumplog reachShotgun.log
