Tag Tool [1.5.6678.2466]

Please report any bugs and/or feature requests at
<https://gitlab.com/TheGuardians/TagTool/issues>.

Enter "help" to list available commands. Enter "exit" to quit.

tags> echo SNOWVERHAUL Sandtrap (Snowtrap) created by RejectedShotgun (ElDewrito 0.6)
SNOWVERHAUL Sandtrap (Snowtrap) created by RejectedShotgun (ElDewrito 0.6) 
tags> echo

tags> echo

tags> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags> 

tags> EditTag 0x54EC
Tag (0x54EC) stone_laminate_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x54EC) stone_laminate_dif.bitmap> ImportBitmap 0 dds\000054EC.dds
Importing image data...
Done!

tags\(0x54EC) stone_laminate_dif.bitmap> exit

tags> 

tags> EditTag 0x54F0
Tag (0x54F0) stone_broken_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x54F0) stone_broken_dif.bitmap> ImportBitmap 0 dds\000054F0.dds
Importing image data...
Done!

tags\(0x54F0) stone_broken_dif.bitmap> exit

tags> 

tags> EditTag 0x54F4
Tag (0x54F4) stone_laminate_pitted_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x54F4) stone_laminate_pitted_dif.bitmap> ImportBitmap 0 dds\000054F4.dds
Importing image data...
Done!

tags\(0x54F4) stone_laminate_pitted_dif.bitmap> exit

tags> 

tags> EditTag 0x56DC
Tag (0x56DC) stone_edge_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x56DC) stone_edge_dif.bitmap> ImportBitmap 0 dds\000056DC.dds
Importing image data...
Done!

tags\(0x56DC) stone_edge_dif.bitmap> exit

tags> 

tags> EditTag 0x56DF
Tag (0x56DF) stone_edge2_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x56DF) stone_edge2_dif.bitmap> ImportBitmap 0 dds\000056DF.dds
Importing image data...
Done!

tags\(0x56DF) stone_edge2_dif.bitmap> exit

tags> 

tags> EditTag 0x56E3
Tag (0x56E3) sand_decal1_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x56E3) sand_decal1_dif.bitmap> ImportBitmap 0 dds\000056E3.dds
Importing image data...
Done!

tags\(0x56E3) sand_decal1_dif.bitmap> exit

tags> 

tags> EditTag 0x56E6
Tag (0x56E6) sand_decal2_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x56E6) sand_decal2_dif.bitmap> ImportBitmap 0 dds\000056E6.dds
Importing image data...
Done!

tags\(0x56E6) sand_decal2_dif.bitmap> exit

tags> 

tags> EditTag 0x56EA
Tag (0x56EA) sand_mound_decal_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x56EA) sand_mound_decal_dif.bitmap> ImportBitmap 0 dds\000056EA.dds
Importing image data...
Done!

tags\(0x56EA) sand_mound_decal_dif.bitmap> exit

tags> 

tags> EditTag 0x550A
Tag (0x550A) copper_plate_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x550A) copper_plate_dif.bitmap> ImportBitmap 0 dds\0000550A.dds
Importing image data...
Done!

tags\(0x550A) copper_plate_dif.bitmap> exit

tags> 

tags> EditTag 0x550B
Tag (0x550B) copper_text_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x550B) copper_text_dif.bitmap> ImportBitmap 0 dds\0000550B.dds
Importing image data...
Done!

tags\(0x550B) copper_text_dif.bitmap> exit

tags> 

tags> EditTag 0x5506
Tag (0x5506) copper_layers_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5506) copper_layers_dif.bitmap> ImportBitmap 0 dds\00005506.dds
Importing image data...
Done!

tags\(0x5506) copper_layers_dif.bitmap> exit

tags> 

tags> EditTag 0x5510
Tag (0x5510) copper_strip_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5510) copper_strip_dif.bitmap> ImportBitmap 0 dds\00005510.dds
Importing image data...
Done!

tags\(0x5510) copper_strip_dif.bitmap> exit

tags> 

tags> EditTag 0x5515
Tag (0x5515) copper_tech_roof_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5515) copper_tech_roof_dif.bitmap> ImportBitmap 0 dds\00005515.dds
Importing image data...
Done!

tags\(0x5515) copper_tech_roof_dif.bitmap> exit

tags> 

tags> EditTag 0x5547
Tag (0x5547) copper_tombstone_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5547) copper_tombstone_dif.bitmap> ImportBitmap 0 dds\00005547.dds
Importing image data...
Done!

tags\(0x5547) copper_tombstone_dif.bitmap> exit

tags> 

tags> EditTag 0x5561
Tag (0x5561) sand_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5561) sand_dif.bitmap> ImportBitmap 0 dds\00005561.dds
Importing image data...
Done!

tags\(0x5561) sand_dif.bitmap> exit

tags> 

tags> EditTag 0x5574
Tag (0x5574) stone_inset_door_dif.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5574) stone_inset_door_dif.bitmap> ImportBitmap 0 dds\00005574.dds
Importing image data...
Done!

tags\(0x5574) stone_inset_door_dif.bitmap> exit

tags> 

tags> EditTag 0x5635
Tag (0x5635) bohemeth_floor_detail_diff.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\(0x5635) bohemeth_floor_detail_diff.bitmap> ImportBitmap 0 dds\00005635.dds
Importing image data...
Done!

tags\(0x5635) bohemeth_floor_detail_diff.bitmap> exit

tags> 

tags> EditTag 0x5736
Tag 0x5736.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x5736.bitmap> ImportBitmap 0 dds\00005736.dds
Importing image data...
Done!

tags\0x5736.bitmap> exit

tags> 

tags> ImportTag 0x54EB tags\54EB
Imported 0x1360 bytes.

tags> ImportTag 0x56D9 tags\56D9
Imported 0x1200 bytes.

tags> ImportTag 0x56E2 tags\56E2
Imported 0x2F0 bytes.

tags> ImportTag 0x56E5 tags\56E5
Imported 0x2F0 bytes.

tags> ImportTag 0x550F tags\550F
Imported 0xF40 bytes.

tags> ImportTag 0x551F tags\551F
Imported 0x18F0 bytes.

tags> ImportTag 0x555C tags\555C
Imported 0x1360 bytes.

tags> ImportTag 0x555E tags\555E
Imported 0x13E0 bytes.

tags> ImportTag 0x555F tags\555F
Imported 0x1180 bytes.

tags> ImportTag 0x571D tags\571D
Imported 0x1A0 bytes.

tags> ImportTag 0x571E tags\571E
Imported 0x130 bytes.

tags> ImportTag 0x5505 tags\5505
Imported 0xF50 bytes.

tags> ImportTag 0x5509 tags\5509
Imported 0x10C0 bytes.

tags> ImportTag 0x5512 tags\5512
Imported 0xFA0 bytes.

tags> ImportTag 0x5514 tags\5514
Imported 0x1120 bytes.

tags> ImportTag 0x5518 tags\5518
Imported 0x1360 bytes.

tags> ImportTag 0x5536 tags\5536
Imported 0xFE0 bytes.

tags> ImportTag 0x5546 tags\5546
Imported 0xF50 bytes.

tags> ImportTag 0x5565 tags\5565
Imported 0xA20 bytes.

tags> 

tags> dumplog snowtrap.log
